{
    "status": "ok",
    "totalResults": 17894,
    "articles": [
        {
            "source": {
                "name": "Wired",
                "article_id": 1
            },
            "author": "Marah Eakin",
            "title": "Filmmakers Are Worried About AI. Big Tech Wants Them to See ‘What's Possible’",
            "description": "Amazon is hosting AI filmmaking competitions. Meta is letting directors test Movie Gen. As tech companies develop new tools, they need filmmakers to show they can be used responsibly.",
            "url": "https://www.wired.com/story/filmmakers-are-worried-about-ai-big-tech-wants-them-to-see-whats-possible/",
            "urlToImage": "https://media.wired.com/photos/6711554a3597949fe9631a86/191:100/w_1280,c_limit/Hollywood-Worried-About-AI-Culver-Cup-Now-Playing-Board-Culture.jpg",
            "publishedAt": "2024-10-17T18:59:14Z",
            "content": "When Hollywood’s writers and actors went on strike last year, it was, in part, because of AI. Actors didn’t care for the notion that their likenesses could be used without their permission, whether by the studios that hired them that week or by someone at home with a computer in 2040. Writers didn’t want to do punch-ups on potentially crummy AI scripts or have their words (or ideas) cannibalized by large language models that didn’t pay them a dime. But while some Hollywood filmmakers came out of the strikes fearful of how AI might wreck their industries, others wanted to learn more. This week, many of those filmmakers gathered in a movie theater in Culver City, California, for the inaugural Culver Cup, a generative-AI film competition sponsored by FBRC.AI and Amazon Web Services. Hundreds of moviemakers applied to be in the competition, and 50 were chosen. They got prompts and a production manifesto from Black Mirror: Bandersnatch and Hard Candy director David Slade, credits to use on AI tools like Luma Dream Machine and Playbook, and a 3D version of a diner from Global Objects to use as a setting. They had a little under three weeks to turn in a two- to five-minute short. From those, eight were chosen to compete (you can watch seven of them here), in-person, with the audience at Monday’s LA Tech Week event selecting the ultimate winner. The Culver Cup championship belt that is awarded to the winner of the Culver Cup gen AI film competition. The final bracket for the Culver Cup. The competition was meant to be “a little experiment,” says FBRC.AI cofounder Todd Terrazas, a way to gauge where the still nascent scene is now compared to where it’s been and where it’s going. Some mistakes in the shorts were inevitable, like inconsistencies in characters or noticeable visual artifacts, but event attendees generally seemed to come away impressed. Jon Jones, the head of AWS Startups, says the point was to see “what’s possible, not what’s perfect.” Figuring out what’s possible is a fraught proposition when it comes to AI in Hollywood. Because even while AWS Startups is working with companies making generative AI tools for filmmaking, the division of Amazon that produces content for Prime Video spent much of last year bargaining with writers’ and actors’ unions, as part of the Alliance of Motion Picture and Television Producers, over best practices for using AI in movie- and TV-making. The AMPTP has been negotiating with animators over AI, among other things, since August. Amazon MGM Studios wasn’t involved with the Culver Cup. Instead, the event was an attempt to show how AI could be used to automate processes that independent filmmakers couldn’t do on their own. Hollywood will have to figure out the most fair way to use them. A similar refrain came out of Adobe’s Max conference this week, where the company showed off new AI-powered video-editing tools while claiming they’re “not a replacement for human creativity.” Meta sang a similar tune on Thursday, when the company announced a collaboration with Blumhouse for which the horror studio paired filmmakers—Casey Affleck, Searching’s Aneesh Chaganty—with Meta researchers to test out its forthcoming Movie Gen video tool. Connor Hayes, Meta’s head of gen AI, said in a blog post that it was about figuring out the “responsible use” of AI. Blumhouse CEO Jason Blum said the studio “welcomed the chance” to allow directors to “test this cutting-edge technology and give their notes on its pros and cons while it’s still in development.” As a longtime director, Slade says he saw his role in the Culver Cup similarly. He wants to be a sober voice in the conversation about the technology’s role in filmmaking, even as he’s quick to admit that “there are things that terrify [him] about AI.” If anyone can make a gen AI film, he argues, then perhaps that’s how you find the next James Cameron or the next David Lynch. “I couldn’t make a full-length, Pixar-like feature film on my own, just due to the amount of time to do every single second of animation,” says Playbook CTO Skylar Thomas, “but with gen AI, the volume that the individual contributor can create is that much higher, and that’s super exciting.” (It’s also cheaper, with Playbook cofounder JD LeRoy noting that a single second of VFX in a movie can cost anywhere from $2,000 to $20,000, depending on complexity.) Gen AI also means filmmakers can do more with less—or without access to the bureaucrats, budgets, and gatekeepers that have traditionally dictated what gets made in Hollywood. “The thing about making films is that, if you go to a studio, it costs a million dollars to take the camera out of the box,” says Slade. “That’s just the way it is. You’re immediately working in a very high-stress scenario where a lot of people are asking a lot of you and you’re asking a lot of permission to do everything you do.” Granted, gen AI’s next auteur, animated or otherwise, probably won’t just be some Joe off the street with an idea and no technical know-how. Most of the Culver Cup finalists have some sort of filmmaking background or education, which has clearly given them a leg up in terms of the technical processes and general lingo involved in creation. The contest’s winner, who goes by the name Meta Puppet, says he’s been a full-time video editor for 18 years, as well as an actor and a screenwriter. “You have to learn the fundamentals,” he says. “Technology will change, but storytelling won’t.” To make his short, “Mnemonade,” really sing, Meta Puppet says he focused on giving the story some emotional heft. “I don’t think AI films will go fully mainstream until we get emotional dialog,” he says. He played all the roles in his short, about the poignance of sense memory and an elderly woman’s loss of memory, using AI from Silicon Valley “unicorn” ElevenLabs to shift his vocal performance into each character’s range and voice. Maddie Hong, who went head-to-head with Meta Puppet in the Culver Cup finals, says that she understands Hollywood’s trepidation when it comes to AI. “There’s more potential for legal backlash and financial loss,” she says, referring to the danger of unintended (or even flagrant) copyright infringement during generation. The studios also have a “higher standard for image continuity,” Hong says, “given that they’re thinking about distribution on all types of platforms and screens.” That being said, Hong agrees with people like Luma cofounder Amit Jain, who says that gen AI filmmaking could give the traditional studio system some flexibility in terms of budget and diversity of product. “If you look at Hollywood today,” Jain says, “the majority of the high-budget productions are just recycling old franchises because it’s too tough to bet on a new idea or a new franchise .” It’s just safer, he says, to reproduce something than it is to imagine something new. In Jain’s (admittedly biased) view, making more projects, even with lower budgets, means more people will work and more money will come rolling in. “I would actually posit,” he adds, “that people will actually have far better careers that are more fulfilling and long-lasting when they’re able to produce things that people actually do want to watch.” If there’s going to be any job loss in Hollywood because of AI, he suggests, the people who are going to go will be the ones most resistant to AI. Recent research contradicts that notion. A survey of 300 entertainment industry leaders conducted earlier this year found that 75 percent believed gen AI had led to the elimination, reduction, or consolidation of jobs within their departments. It had also led to the creation of some jobs, but it was “not clear” if new jobs would offset jobs lost. Other studies have examined how the VFX world in particular might be affected by more AI in production, with artists typically reporting interest or excitement around tools that could streamline their sometimes tedious workflows, but concern about the ethical and financial implications of the technology. While it would be cool, as Jain suggests, to team up with 11 of your friends to “make a feature film about a Boston Terrier that has superpowers” for relatively little money, it remains to be seen what effect the impact of sweeping AI availability will have on the industry as a whole. For Meta Puppet, it comes down to skill, and who has it. “I liken gen AI to the piano,” he says. “Everybody knows about the piano. Not everybody is Mozart. Writing real masterpieces with AI, you have to wear a lot of hats, which is a good and a bad thing because if you have experience, that’s great. If you don’t, whatever you make is probably going to be bad.” This content can also be viewed on the site it originates from. In your inbox: A new series of tips for how to use AI every day Meet the masked vigilante tracking down billions in crypto scams Deep dive: This app set out to fight pesticides. Now it sells them How a 12-ounce layer of foam changed the NFL Event: Join us for The Big Interview on December 3 in San Francisco More From WIRED Reviews and Guides © 2024 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 2
            },
            "author": "Wes Davis",
            "title": "Apple’s Vision Pro leader, Dan Riccio, is retiring",
            "description": "Dan Riccio, who heads the Vision Pro and oversaw much of Apple’s popular new hardware from 2012 to 2021, is reportedly retiring this month after 26 years.",
            "url": "https://www.theverge.com/2024/10/9/24266321/apple-dan-riccio-retiring",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/Ed7T1NHwsYw7ALRGvqF9Z9pWj74=/0x0:1960x1362/1200x628/filters:focal(980x681:981x682)/cdn.vox-cdn.com/uploads/chorus_asset/file/22259288/Apple_dan_riccio_begins_a_new_chapter_at_apple_01252020_big.jpg.large_2x.jpg",
            "publishedAt": "2024-10-09T19:20:47Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Dan Riccio, a longtime Apple executive formerly in charge of hardware, is retiring from the company this month, Bloomberg reports.  Riccio has been with Apple for 26 years. Before becoming the SVP of hardware engineering in 2012, he led the company’s iPad division. As the company's hardware head, he oversaw some of the company’s most successful products, including the AirPods and large iPhones, as Bloomberg notes. He also headed up projects such as the Apple Car, which never came to be, and the Vision Pro, which has struggled to gain much of a foothold.  He was replaced as SVP of hardware engineering by John Ternus in 2021. At the time, he was said to be taking over an unspecified “new project” that ultimately turned out to be the company’s VR headset. Now, the Vision Products Group will be under the purview of Ternus, who has been rumored as a candidate to replace CEO Tim Cook in the future. Apple has seen other significant executives leave since Jony Ive’s 2019 departure, like Evans Hankey, who took over industrial design from Ive but left in 2023. Hankey was followed by others, including VP of iPhone and Apple Watch design Tang Tan and longtime industrial designer Bart Andre.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 3
            },
            "author": "Andrew Webster",
            "title": "I’ve given up on trying to predict what Nintendo will do — especially when it comes to the Switch 2",
            "description": "Ahead of the announcement of the Switch 2, Nintendo has focused on all kinds of other initiatives including a museum, an alarm clock, and a mystery MMO.",
            "url": "https://www.theverge.com/2024/10/22/24276650/nintendo-switch-2-predictions-playtest-alarmo",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/ERWV6in9Txm6WmKTi7cronGTn8o=/0x0:1920x1280/1200x628/filters:focal(960x640:961x641)/cdn.vox-cdn.com/uploads/chorus_asset/file/25693054/Exhibition_Building_2_Second_floor_exhibit_.jpg",
            "publishedAt": "2024-10-22T15:00:00Z",
            "content": "By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. In 2018, Nintendo invited me to a meeting in New York City to see a mysterious new initiative. It was teased as an “interactive experience for Nintendo Switch,” which sent my mind to all sorts of places. This is the company that made a weird dual-screen Game Boy and bongo controllers, after all. It could be anything. Even still, I did not guess that I would spend that meeting folding bits of cardboard — or that those cardboard accessories would turn out to be so awesome. That was the moment I completely gave up on trying to guess what Nintendo would do next. That meeting has been on my mind quite a bit over the last few weeks. While much of the game industry has been on edge in anticipation of whatever the follow-up to the Switch will be, Nintendo has focused on pretty much anything and everything else.  Last month, I went to visit the company in Kyoto, but not to see new hardware; instead, I went on a tour of the just-opened Nintendo Museum. This month, Nintendo did announce a new gadget, but instead of a console, it was an alarm clock. And just this week, details started trickling out about the company’s secretive online test, which some predicted would provide hints at the Switch 2. Nope: instead, it seems to be an online game in the vein of Minecraft. Three big moments, zero Switch successors. This isn’t new, of course. Nintendo generally goes its own way. When Sony and Microsoft ushered in the current generation of consoles, Nintendo launched a new version of the Game & Watch, an LCD handheld from the ’80s. But the rapid succession of announcements and reveals from the company over the last few weeks has been surprising and indicative of its idiosyncratic nature. And while it might seem random, the weeks full of museum openings and alarm clock launches are likely part of a very calculated strategy. It could mean a few things. Maybe Nintendo is clearing the runway to keep the focus on the Switch 2 whenever it does decide to announce it. In the Switch era, Nintendo has become much more adept at clear messaging, which hasn’t always been the case. Just think back to when the Wii U was first announced, and some (myself included) initially confused it for a Wii accessory. So it makes a lot of sense to get this other stuff out of the way before the next console. Nintendo Direct presentations have become huge moments, and the one dedicated to the next console will possibly be the biggest to date. You don’t want to mess that up. It could also be an indication of where Nintendo is right now. This is a company that doesn’t want to be only known for games. Super Mario creator Shigeru Miyamoto said as much when I was in Kyoto in September. “A lot of people may see Nintendo as a video game company,” he explained during a press conference. “But what I wanted to express with this museum is that we are first and foremost an entertainment company.” While it’s been building a new console in secret and sending out its current one on a high note, it has also been branching out in new directions. That includes bringing Nintendo experiences into the real world through a theme park partnership with Universal — an initiative so important that Miyamoto has played a major role — and a (so far) successful jump into feature films with The Super Mario Bros. Movie, created by Minions studio Illumination. It’s relatively early days, but the company is using its long-running success in games to transform into an entertainment empire. Which is to say, Nintendo has a lot more irons in the fire than just a new console. Maybe we’ll get a live-action Zelda movie trailer before we see the Switch 2. Doing things differently isn’t always a guarantee of success, of course, and Nintendo has certainly had its share of failures. These glory days of the Switch, The Super Mario Bros. Movie, and Super Nintendo World famously happened in the aftermath of the Wii U, Nintendo’s worst-selling home console to date. It took 30 years for the company to follow up the infamous original Mario movie flop with a billion-dollar film. The industry ebbs and flows, and it only takes one console generation to move from the top of the market to the bottom. That only makes it harder to predict what Nintendo will do; I certainly would have never guessed the Switch was its next system back in 2017 or that it would go on to outsell the Wii and Game Boy. This is all a long way of saying that, just like when I sat down in front of some stacks of cardboard in New York, I am currently at a loss trying to figure out what Nintendo’s execs are thinking. I have some ideas, of course, helped along by a steady stream of rumors, but no real sense of what the company’s next console will look like or when it will be announced. All I know for sure is that it won’t be boring. But if it is? That’d be another big surprise.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 4
            },
            "author": "Wes Davis",
            "title": "Michelle Yeoh’s Star Trek spy movie has a release date",
            "description": "Michelle Yeoh’s Star Trek: Discovery character, Emperor Philippa Georgiou takes the lead as a Federation spy when Star Trek: Section 31 premieres in January.",
            "url": "https://www.theverge.com/2024/10/20/24274900/star-trek-section-31-michelle-yeoh-paramount-plus-streaming-premiere-date",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/ORbY_Z5pU-TbbdYQioWCBzKtKps=/436x134:1770x878/1200x628/filters:focal(885x477:886x478)/cdn.vox-cdn.com/uploads/chorus_asset/file/25690382/Screenshot_2024_10_20_at_5.15.01_PM.png",
            "publishedAt": "2024-10-20T22:32:47Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Star Trek: Section 31 will premiere as a direct-to-streaming movie on January 24th on Paramount Plus, which revealed the date during a Trek panel at the New York Comic Con. Fans will finally see Michelle Yeoh’s Star Trek: Discovery character, Emperor Philippa Georgiou, put her Mirrorverse skills to use as a super secret space spy. When we last saw Emperor Georgiou (an alternate dimension version of Captain Georgiou Discovery’s first season) she was flung back in time by a being called the Guardian of Forever. Before that, though, she had been recruited as a member of Section 31, the clandestine organization that the Trek franchise often uses to illustrate that even the glossy Federation has a shady side. The film, originally announced as a TV series in 2019 before being reintroduced as a movie, will follow her time as a Section 31 operative who “must face the sins of her past.” In addition to Yeoh, Section 31 will also star Sam Richardson, Sven Ruygrok, Omari Hardwick, Robert Kazinsky, and Miku Martineau, who plays “a young Philippa Georgiou.” Paramount Plus subscribers can stream it anywhere the service is available on January 24th.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 5
            },
            "author": "Wes Davis",
            "title": "Spotify’s new playlist art maker gets that design is your passion",
            "description": "Spotify’s new cover art maker lets you create custom collages for playlists, using images you upload or colorful backgrounds, along with custom stickers and effects.",
            "url": "https://www.theverge.com/2024/10/22/24275651/spotify-create-cover-art-playlist-image-maker",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/wtcqPbcwZRu53WRp3USIHqZ3grY=/0x0:2000x1125/1200x628/filters:focal(1000x563:1001x564)/cdn.vox-cdn.com/uploads/chorus_asset/file/25692989/E2E_Screens.jpg",
            "publishedAt": "2024-10-22T13:03:59Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Spotify now has a new “Create cover art” option for playlists that lets you make custom collages to represent your playlists. The beta feature, which is available for both free and Spotify Premium members, is launching for English users in 65 markets. The company says it partnered with artists like Ugly Primo, who designed Bad Bunny’s Un Verano Sin Ti album cover, and Cey Adams, who has worked on albums and logos for The Notorious B.I.G and Beastie Boys. I gave it a shot and produced the masterpiece below, using a picture I took of a possum that was lurking outside my kid’s bedroom one night. It’s a pleasantly robust image maker, with layering, various effects, and the ability to rotate or change the size of images. It’s still in beta, and at the moment, you can’t edit images once you’ve saved them, or even save drafts. YouTube Music introduced a similar feature last year that uses AI with preselected themes and prompt elements. Spotify easily could have gone the same route but chose to do something more interactive and engaging than tapping through a short menu. It also says it hired actual artists to make the 40 stickers that users can add to their pictures. To try it out, open a playlist you’ve made, tap the three dots button, then tap “Create cover art.” (You may need to close the app and reopen it to see this.)   / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 6
            },
            "author": "Wes Davis",
            "title": "Alien: Romulus is getting a VHS release",
            "description": "A limited edition, “fully functioning VHS tape” of Alien: Romulus will release alongside other physical formats to celebrate the franchise’s 45th anniversary.",
            "url": "https://www.theverge.com/2024/10/20/24274915/alien-romulus-vhs-limited-edition-collectible-release-date",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/6i9DkJBlL6JmcZSXoFkoF1bnxCE=/0x0:1300x730/1200x628/filters:focal(650x365:651x366)/cdn.vox-cdn.com/uploads/chorus_asset/file/25689729/g_alienromulus_3216_5_3d7ca4d9.jpeg",
            "publishedAt": "2024-10-20T15:59:13Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. It’s time to dust off your VCR and clean the heads because Alien: Romulus is coming to VHS as a limited edition on December 3rd alongside the other physical releases, director Fede Álvarez announced during “a special Beyond Fest-partnered screening” in Los Angeles yesterday.  The “fully functioning VHS tape” is meant to celebrate 45 years since the Alien franchise first (chest) burst into theaters, 20th Century Studios wrote in a release emailed to The Verge. It’ll present the movie, appropriately, in a 4:3 aspect ratio (hopefully with well-done pan-and-scan). It also comes in a slick vintage-style sleeve. The art for the box comes from Matt Ferguson, whose other work you can see on his website. A few weeks ago, he posted a wider version of the same image as a poster, which I now desperately want on my wall. I’ve embedded that below for your viewing pleasure. 20th Century Studios hasn’t said how many copies of the tape will be available, nor has it provided pricing for the collectible. If you don’t want to wait for the VHS or the other physical releases, though, you can already buy a digital license of Alien: Romulus on a streaming storefront near you.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 7
            },
            "author": "Wes Davis",
            "title": "Threshold’s Wi-Fi sensing plugs offer caregiver monitoring without cameras",
            "description": "The Motion Wi-Fi Sensing Plugs use interference to detect motion, allowing remote caregivers to monitor household activity without installing an invasive camera.",
            "url": "https://www.theverge.com/2024/10/10/24266406/threshold-wi-fi-sensing-plugs-motion-detection",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/XxOIPRRqtY7nxH8VZ6UXhNKdwnA=/0x0:2048x1435/1200x628/filters:focal(1024x718:1025x719)/cdn.vox-cdn.com/uploads/chorus_asset/file/25668281/Threshold_Care__Inc._r1_770A4901_crop.jpg",
            "publishedAt": "2024-10-10T13:00:00Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement. Threshold Care’s new Motion Wi-Fi Sensing Plugs can help caregivers monitor older adults, like aging parents, in a noninvasive way that maintains the privacy of everyone in the home.  Its built-in Wi-Fi sensing technology measures physical interference with Wi-Fi signals to enable real-time monitoring of “movement without capturing images or photos.”  Wi-Fi sensing technology has been kicked around for a few years. It was part of a motion-sensing security feature built into Linksys Velop routers a few years ago, and Signify also uses the tech for its Wiz lightbulbs that turn on when you enter a room — and off when you leave.  The Motion plugs are available in a three-pack for $59.99, so you can place them “throughout the home to create a comprehensive motion zone” as they communicate with your existing Wi-Fi router. The company describes it as a “plug and play” setup, without relying on wearable devices that might need batteries or paid subscription services for ongoing monitoring.  Monitoring motion can allow a caregiver to know that someone is up and moving around in the morning, whereas no motion could indicate there’s a problem. Similarly, motion at odd times, such as in the middle of the night, could alert them to an issue. Threshold lets you monitor motion patterns and access up to two weeks of motion data in the app (iOS and Android). One thing it lacks, however, is actual “smart plug” capabilities that would allow you to turn a device plugged into it on or off. They have passthrough AC outlets, but at launch, that’s it. Threshold’s website says it has other features in development, such as a “Circle of Care” due this month that manages shared access to the system and customizable notifications that it expects to deliver in November.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 8
            },
            "author": "Wes Davis",
            "title": "Chrome introduces new ‘Performance’ tools to wrangle the tabs gobbling up your memory",
            "description": "Chrome’s new Performance Issue Alerts let you know when a tabs is using too many resources, while new Memory Saver modes offer more fine-tuning.",
            "url": "https://www.theverge.com/2024/10/29/24282864/chrome-performance-detection-issue-alerts-memory-saver-management-tabs",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/zCUZ308k3-5t-4co4I_I3j6n2ic=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24418649/STK114_Google_Chrome_02.jpg",
            "publishedAt": "2024-10-29T18:11:50Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Google is rolling out some new Chrome memory management features aimed at helping you wrangle out-of-control tabs more easily. The updates include new “Performance issue alerts” and some tweaks to the existing Memory Saver mode, which already tries to free up the resources of inactive tabs in the background. The new alerts appear when a new Performance Detection tool finds that one of your tabs is using more resources than it should. The notification appears next to your account thumbnail in Chrome’s toolbar as a tiny graphic that looks like a speedometer. (If I didn’t know about it already, I might think I’d accidentally added an Ookla Speedtest extension to my browser.) If you click the graphic, it will list the offending tabs and give you the option to “Dismiss” or “Fix now.”  Here’s what it looks like: Google also updated Memory Saver, a feature that the company introduced to Chrome in 2022 that snoozes tabs when they’re hogging your computer’s resources. Google spokesperson Scott Westover has confirmed to The Verge via email that the modes are named “Moderate,” “Balanced,” and “Maximum,” as in the screenshot at the bottom of this article. (As of this writing, Google’s blog lists the names incorrectly; Westover said this will be corrected later today.) According to Google, Moderate interprets your system’s needs and manages tabs for you, Balanced operates based on system needs and your browsing habits, and Maximum will deactivate tabs the fastest after you stop using them.  To check out the new settings, simply click the three-dot menu in the upper-right corner of Chrome, click Settings, and click the “Performance” tab on the left. You should see a new “Performance issue alerts” toggle under General and updated Memory Saver options in Memory below that. Here are our screenshots, if you want to see what the Performance issue alert toggle looks like. Update, October 29th: Updated with Google spokesperson Scott Westover’s confirmation of the Memory Saver mode names.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 9
            },
            "author": "Andrew Webster",
            "title": "Persona director says making beautiful menus is ‘actually really annoying’",
            "description": "Katsura Hashino, director of games like Persona 5 and Metaphor: ReFantazio, explains why these RPGs have such beautiful and memorable menus.",
            "url": "https://www.theverge.com/2024/10/7/24262357/persona-metaphor-menu-design",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/6fwevGVcixcDzpRuIUUkY4VU060=/0x0:3840x2160/1200x628/filters:focal(1920x1080:1921x1081)/cdn.vox-cdn.com/uploads/chorus_asset/file/25658719/ss_6956a6d6ff1745101aa0cd4a8445ff2d19853bfa.jpg",
            "publishedAt": "2024-10-07T14:30:00Z",
            "content": "By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. Persona is one of the rare video game series where people actually talk about the menus. They’re functional, sure, but they’re also so incredibly stylish that you almost don’t mind constantly pausing to equip gear or heal your party. So when I had the chance to talk to longtime Persona director Katsura Hashino about his new game, Metaphor: ReFantazio, which continues this tradition of beautiful menus, I had to ask how they do it. The answer, as Hashino explains it, is simply a lot of work: In general, the way most game developers make UI is very simple. That’s what we try to do as well — we try to keep things simple, practical, and usable. But maybe the reason that we’ve achieved both [functionality and beauty] is that we have unique designs that we make for each and every menu. This is actually really annoying to do. We have separate programs running for each of them as well. Whether it’s the shop menu or the main menu, when you open them up there’s a whole separate program running and a separate design that goes into making it. It takes a lot of time. There are elements of craft and experience to it as well. While games like Persona 3 had stylish menus, there was a clear evolution in later games as the designs became more elaborate and animated. You can even see a difference between Persona 5 and Metaphor (see above). Hashino says this is simply a matter of building off of previous work. “How we achieve both of them together is by the know-how that we built up over years,” he says. As an example, Persona 5’s menus feature a lot of angular elements, which initially created issues with legibility. “It was impossible to read at first,” Hashino says, “so we did lots of tweaking and adjusting so it became legible.” You can explore Metaphor’s menus — along with the rest of the game — yourself when it launches on October 11th.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 10
            },
            "author": "Wes Davis",
            "title": "Kevin Bacon, Kate McKinnon, and other creatives warn of ‘unjust’ AI threat",
            "description": "Over 11,000 creatives have signed a statement accusing unpermitted AI model training on copyrighted work of being an existential threat to their work.",
            "url": "https://www.theverge.com/2024/10/22/24276994/ai-statement-training-data-copyright-threat-actors-authors-musicians-kevin-bacon-kate-mckinnon",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/1im3ZgLeERN7CpyGHISq0IwfXLo=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24440561/AI_art_chat_H_Jeong_1.jpg",
            "publishedAt": "2024-10-22T22:06:14Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Thousands of creatives, including famous actors like Kevin Bacon and Kate McKinnon, along with other actors, authors, and musicians, have signed a statement warning that the unpermitted use of copyrighted materials to train AI models threatens the people who made those creative works. 11,500 names are on the list of signatories so far. Here is the one-sentence statement: “The unlicensed use of creative works for training generative AI is a major, unjust threat to the livelihoods of the people behind those works, and must not be permitted.” The statement was published by Fairly Trained, a group advocating for fair training data use by AI companies. Fairly Trained CEO Ed Newton-Rex told The Guardian that generative AI companies need “people, compute, and data” to build their models, and while they spend “vast sums” on the former two, they “expect to take the third – training data – for free.” Newton-Rex founded Fairly Trained after he quit Stability AI, accusing generative AI of “exploiting creators.”  Several professionals and organizations like News Corp and the Recording Industry Association of America have sued AI companies for using copyrighted work while training AI models.  The RIAA is among the organizations that have signed Fairly Trained’s statement and has even posted about it. As has the News/Media Alliance.  There are also some notable names not appearing among the signatories. Scarlett Johansson, who had a high-profile spat with OpenAI after accusations it modeled GPT-4o’s voice after her, isn’t on the list. Neither are actors like Dame Judi Dench and John Cena, who signed up to have Meta AI’s voice chat system replicate them.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 11
            },
            "author": "Wes Davis",
            "title": "Hackers took over robovacs to chase pets and yell slurs",
            "description": "A bad actor gained access to Ecovacs Deebot X2 Omni robotic vacuums, using them to chase pets and yell racist slurs at their owners.",
            "url": "https://www.theverge.com/2024/10/12/24268508/hacked-ecovacs-deebot-x2-racial-slurs-chase-pets",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/oZWxzrEc02aZl4xQgN-FV5TMXHg=/0x0:5760x3840/1200x628/filters:focal(2880x1920:2881x1921)/cdn.vox-cdn.com/uploads/chorus_asset/file/24889891/8A0A9622.jpeg",
            "publishedAt": "2024-10-12T17:23:49Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Someone gained access to Ecovacs Deebot X2 Omni robotic vacuums across several US cities earlier this year and used them to chase pets and yell racist slurs at their owners, reported ABC News in Australia this week.  The outlet spoke with multiple Deebot X2 owners who say their Deebot X2s had been hacked in May, including Minnesota lawyer Daniel Swenson, who said he was watching TV with his family when a noise “like a broken-up radio signal or something” started coming from the robot’s speaker. He said after he reset his password and rebooted the robot, it began again, only this time the sound was clearly a voice — he guessed a teenager’s — yelling slurs.  ABC News lists other, similar accounts from owners in El Paso and Los Angeles, the latter of which involved someone using a Deebot to antagonize a dog, yelling at and chasing it.  Ecovacs told the outlet in a statement that it had “identified a credential stuffing event” and blocked the IP address it originated from. The company said it “found no evidence” that usernames and passwords were collected by the attacker. Researchers demonstrated a flaw last year that let them bypass the Deebot X2’s PIN entry to gain access to the vacuum. Ecovacs says in its statement that it has resolved that, and that it also plans to “further enhance security” with an update in November. It’s not clear whether that would correct a Bluetooth vulnerability that ABC News exploited for a report earlier this month. Cloud-connected smart home devices have led to stories like this for years. Sometimes it’s the result of hacks, others simply compromised credentials. Sometimes, it’s bad software showing you another owner’s camera feed, as a little treat. Issues like these can feel inevitable when so many smart home devices require a persistent internet connection to function, especially for those companies that don’t offer easy ways to report security vulnerabilities.   / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 12
            },
            "author": "Wes Davis",
            "title": "RedCap, the 5G for wearables and IoT, will get its first devices soon",
            "description": "AT&T and T-Mobile are preparing to release their first products for RedCap 5G, a new version of 5G that’s engineered for wearables and IoT devices.",
            "url": "https://www.theverge.com/2024/10/13/24269370/at-t-t-mobile-redcap-5g-explained-iot-devices-coming-soon",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/KWhU_P6iGx_RXYWnoqRRDCkKcQM=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24341282/STK142_5G.jpg",
            "publishedAt": "2024-10-13T22:23:51Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Both T-Mobile and AT&T have plans to release their first devices soon that run on RedCap, a 5G specification that is tooled for Internet of Things devices, according to Fierce Wireless.  What is RedCap? Great question! Also called “reduced capability” or NR-Light, RedCap is a low-bandwidth version of 5G that’s expected to make certain devices, like wearables, sensors, or surveillance cameras simpler and more power efficient, according to an Oracle document. That could mean cheaper cellular-connected smartwatches, XR glasses, or other portable products that don’t need high-powered antennas and fast throughput last longer on a charge.  AT&T, which began testing the spec on its own network early this year, reportedly plans to release its first NR-Light devices in 2025, Fierce Wireless writes. T-Mobile will launch one of its own before this year is out.  It’s not clear what those devices will be, but AT&T AVP of device architecture Jason Sikes has hinted at what early NR-Light products could look like, telling Fierce in June that the first RedCap devices will probably be cheap mobile hotspots and dongles. Indeed, TCL announced a 5G USB dongle last week, catchily named the TCL Linkport IK511. Early products could use a modem chipset Qualcomm launched last year called the Snapdragon X35. It listed several companies in its announcement, including T-Mobile and AT&T, that plan to use the modem in future products. Perhaps we’ll hear more during CES early next year. Let the (slow) race to 5G begin. Correction October 14th: An earlier version of this article misspelled the name of an AT&T executive. It is Jason Sikes, not Jason Silkes.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 13
            },
            "author": "Wes Davis",
            "title": "Dodge Chargers with semi-solid-state batteries may hit the road in 2026",
            "description": "Stellantis plans to demonstrate a fleet of Dodge Charger Daytonas equipped with semi-solid-state batteries in 2026, using tech that Mercedes will also deploy in the future.",
            "url": "https://www.theverge.com/2024/10/23/24277832/dodge-charger-ev-semi-solid-state-mercedes-stellantis-demo-2026",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/lPNHAbNnSghQhGQ6HqtXU1cEi-Q=/0x0:3000x2400/1200x628/filters:focal(1500x1200:1501x1201)/cdn.vox-cdn.com/uploads/chorus_asset/file/25315929/DG024_030CH.jpg",
            "publishedAt": "2024-10-23T20:35:26Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Stellantis says it will put a “demonstration fleet” of Dodge Charger Daytonas on the road by 2026, equipped with solid-state battery technology that’s lighter, more energy-dense, and could eventually make for cheaper EVs. The company calls the demo fleet a “key next step” toward making solid-state EVs that you can actually buy. The cars will be built on its STLA Large EV platform, which is meant to underpin more than just the Chargers it’s demoing next year. If its demo is successful, there’s a chance that cars from brands like Maserati and Jeep will get the new battery tech, too. There’s probably a reason Stellantis says “solid-state battery technology” rather than simply solid-state batteries. That’s because these Chargers will use semi-solid-state batteries, which means they’re still made with liquid electrolytes too. That hybrid approach carries benefits like lighter weight and more range, but doesn’t totally obviate the fire risk of traditional lithium batteries. Factorial, which makes the batteries Stellantis will use, claims its semi-solid-state tech could push EV range up by as much as 50 percent versus today’s electric cars, and that the batteries have “drop-in compatibility with existing lithium-ion battery manufacturing infrastructure,” making them cheaper and easier to produce than switching to full solid-state tech would be.  Solid-state batteries have been hard to develop and not every company has been able to hack it. Nissan had promised it would be producing “all-solid-state” EVs by 2028, but seemed to walk that back this year. Fisker totally abandoned its own efforts to make solid-state batteries in 2021. But Volkswagen, which was to provide Fisker’s platform, recently announced that its batteries had passed an endurance test. Stellantis’ announcement is a sign of progress, and it’s not the only company making some. Hyundai is a Factorial investor, and so is Mercedes, which said it would have Factorial’s semi-solid-state batteries “in EVs on the road in 2026,” according to Reuters. Honda plans to introduce solid-state EVs in the latter half of the decade, while Toyota’s roadmap includes mass-producing solid-state batteries that enable more than 621 miles of range by 2028.  In China, IM Motor launched the L6, a semi-solid-state battery-driven EV, in April, while its sister brand, MG, announced it will unveil one in Europe next year.   / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 14
            },
            "author": "Sheena Vasani",
            "title": "The OnePlus Pad is cheaper than ever and comes with a free magnetic keyboard",
            "description": "OnePlus is selling the OnePlus Pad for $359.99 with a free magnetic keyboard. Amazon’s Smart Thermostat and the USB-C Apple Pencil are also on sale.",
            "url": "https://www.theverge.com/2024/10/16/24270849/oneplus-pad-amazon-smart-thermostat-deal-sale",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/q6NYMVwsOkSC_9UJcuxsqIsnFhs=/0x0:3000x2000/1200x628/filters:focal(1500x1000:1501x1001)/cdn.vox-cdn.com/uploads/chorus_asset/file/24616039/oneplus_pad_6.jpg",
            "publishedAt": "2024-10-16T15:38:21Z",
            "content": "By  Sheena Vasani, a writer covering commerce, e-readers, and tech news. She previously wrote about everything from web development to AI at Inside. If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement. Apple’s new iPad Mini might be hogging the spotlight, but it’s not the only great tablet on the market. If you’re looking for a slate outside of Apple’s ecosystem, the original OnePlus Pad is a terrific Android tablet that OnePlus is selling for $359.99 ($120 off) — a new all-time low — until October 20th at 11:59PM ET. To make the deal even sweeter, OnePlus is also throwing in a free OnePlus Magnetic Keyboard worth $149.99. Note that to get the discount, you’ll have to apply the on-page coupon, which you can find when you click on the “Claim now” button under ”Check out all offers.” The last-gen tablet still offers excellent value for your money. Its MediaTek Dimensity 9000 processor is snappy enough, while the OnePlus Pad’s sharp 11.6-inch LCD offers a speedy 144Hz refresh rate that’s rare to find at this price point. What’s more, it also comes equipped with an impressive quad-speaker system that supports Dolby Atmos, rendering it a particularly terrific device for watching movies. The Android tablet app ecosystem is limited, and the OnePlus Pad offers few useful multitasking features, so I wouldn’t recommend this as a work device. But if you just need a tablet for light productivity work and entertainment purposes, few tablets in this price range can rival the OnePlus Pad. OnePlus’ first tablet punches above its weight thanks to excellent performance, great build quality, and a terrific 11.6-inch LCD display that offers up to 144Hz refresh rates. Join more than 50,000 followers and keep up with the best daily tech deals with @vergedeals  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 15
            },
            "author": "Chris Welch",
            "title": "A closer look at Nintendo’s adorable Alarmo clock",
            "description": "The $99 Nintendo Alarmo is a motion-sensing alarm clock that can wake you up with the gaming company’s beloved characters and signature sound effects.",
            "url": "https://www.theverge.com/24266272/nintendo-alarmo-sound-clock-hands-on",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/mYZcyNbiMomU_lIIDgb3Leo1Q64=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/25666820/DSC_0974.jpg",
            "publishedAt": "2024-10-09T19:15:12Z",
            "content": "By  Chris Welch, a reviewer specializing in personal audio and home theater. Since 2011, he has published nearly 6,000 articles, from breaking news and reviews to useful how-tos. Look, I’m a sucker for instant gratification. It’s often one of my favorite things about living in New York City. This morning, Nintendo announced its $99 Alarmo clock, and when the company’s store in Rockefeller Center opened a couple hours later, I walked in and picked one up. Did I feel a little iffy about paying $108.91 after tax for a plastic alarm clock? You bet. But fortunately, in my field, this counts as a work expense. (Technically, this product is called Nintendo Sound Clock: Alarmo — but no one is ever going to refer to it that way. It’s Alarmo.) The Verge’s senior entertainment editor Andrew Webster will have a full review of Alarmo coming up, but I wanted to check it out for myself. Mostly, I was curious about the audio quality. If the speaker in this relatively tiny clock sounds tinny or shrill, that would ruin the whole concept for me. Turns out, you don’t need to worry about that. I haven’t tried all of Alarmo’s various sounds, but even the Super Mario Bros. theme that plays during the setup process eliminated my worries that it would sound like crap. That setup routine is actually quite lengthy and might prove to be a bit much for a child. You choose the date and time, of course, but you’re also led through configuring the clock’s motion-detection features, which takes a bit of time, and I didn’t see any way of skipping it. Alarmo’s millimeter-wave presence sensor works with bed sizes ranging from twin to king, and the screen is meant to face the middle of your bed. The display is not a touchscreen, nor is it round. (And I feel like Nintendo’s promotional video exaggerates its size a little.) It does automatically adjust brightness based on ambient lighting. One fun little detail is that the clock screen and typeface will change depending on the alarm you’ve chosen. Whenever the regular clock is showing, the character onscreen will also move from left to right based on your own movements if you’re within range of the motion sensors.  You control Alarmo with the buttons up top. The large dial can be turned to navigate menus and pressed to make selections. There’s a back button to the left and a notifications button to the right. I’ve barely used the clock, but presumably, this is where you might get notified about your sleep metrics. (There’s no serious health monitoring or anything like that; don’t expect Mario to warn you about snoring or potential sleep apnea.) The top dial lights up in a range of colors; you’ll see quite a few within the first few minutes of using Alarmo. Aside from the core alarm functionality, Alarmo also has sleep sounds that you can doze off to. Nintendo plans to offer new sounds that can be downloaded to the clock once you've linked a Nintendo account. (When you access this menu, a prompt advises younger users to seek out a parent or guardian.) Is this thing absurdly expensive for what it is? Certainly. But for its demographic, it’s very cute, and there are small, thoughtful Nintendo touches throughout the experience — and I’ve barely dug in. Here are some more photos of the $99 Nintendo clock. Update, October 9th: The article has been updated to clarify that a Nintendo Switch Online subscription won't be needed to install future Alarmo scenes.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 16
            },
            "author": "Wes Davis",
            "title": "From AOL Time Warner to DirecTV and Dish: 20 years of media mergers",
            "description": "DirecTV’s Dish Network deal is the latest twist in decades of other mergers, spin-offs, and acquisitions involving the biggest telecom and media firms in the world.",
            "url": "https://www.theverge.com/2024/10/4/24259360/directv-dish-merger-timeline-aol-timewarner",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/WhNDSC3iWfc-SDJaHwG4D9FF-Po=/251x263:1830x1257/1200x628/filters:focal(1025x833:1026x834)/cdn.vox-cdn.com/uploads/chorus_asset/file/25658358/247300_ONE_DOLLAR_MERGER_CVirginia.jpg",
            "publishedAt": "2024-10-04T19:45:43Z",
            "content": "By  Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. This week, DirecTV announced it intends to buy Dish, Sling TV, and the rest of EchoStar’s television business for a dollar (while also taking on all of Dish’s debt), combining almost 20 million satellite TV subscribers from two companies that have been circling one another for decades. But it’s not just DirecTV and Dish. AT&T, Comcast, Verizon, General Electric, GM, News Corp, Tumblr, and the various incarnations of Time Warner have also gotten mixed up or split up while trying to bridge the gap between communications and media over the years. Here’s a partial timeline of the events that might end with these two companies joining together at last. At the turn of the 21st century, it was obvious that the internet was the future. Instant communication between anyone in the world and the idea of digital distribution was irresistible, and AOL seemed on top of the world.  What better way for Time Warner to get in on the ground floor than to join forces with the company that rode to the top, one 60-hours-of-free-internet CD at a time? By 2009, it was all over. Comcast, Verizon, and AT&T’s acquisitions were an attempt to take over the media landscape built on their networks, with varying degrees of success, delivering brands like Oath, WarnerMedia, and Peacock as well as the entirely forgettable Go90. Over the next few years, AT&T executives float bad ideas for Game of Thrones, like shooting “snackable” vertical video versions. The company eventually introduced HBO Max before demoting HBO from its streaming brand, renaming the service Max. You know what happened next: Netflix never looked back on its path to 270 million global subscribers, and Disney reintroduced the bundle for streaming. At the same time, both Quibi and CNN Plus evaporated too quickly to make an impact. Ultimately, Verizon sold what was left of Oath to Apollo Global Management, and then AT&T shipped WarnerMedia off into a partnership with Discovery. Now, AT&T is selling all of DirecTV to TPG. That’s the private equity firm behind this new $1 attempt to merge with Dish Network again, while EchoStar can continue on its quest to build a nationwide Open RAN 5G network.  We’ll see everyone back here in another 20 years to find out how it all worked out, okay? Disclosure: Comcast is an investor in Vox Media, The Verge’s parent company.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 17
            },
            "author": "Andrew Webster",
            "title": "The stunning indie game Gris now has a beautiful follow-up about love and loss",
            "description": "Neva, the follow-up to indie game hit Gris, launches on October 15th for the Nintendo Switch, PS5, Xbox, and PC.",
            "url": "https://www.theverge.com/24267805/neva-nomada-studio-interview-gris-devolver",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/m26MewqNeqmUzk1lZym1r35K1L0=/0x0:3840x2160/1200x628/filters:focal(1903x1320:1904x1321)/cdn.vox-cdn.com/uploads/chorus_asset/file/25671089/Neva_13.png",
            "publishedAt": "2024-10-14T16:00:00Z",
            "content": "By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. After the launch of Gris, a beautiful game exploring grief, the team at Nomada Studio in Barcelona needed a long break. They spent around half a year not even thinking about what was next, avoiding words like “Unity” or “sequel.” Eventually, director Conrad Roset, who became a parent during that time, came up with the idea of a similar experience that would introduce a new companion, allowing players to connect with and care for another character. “I told him, no problem, as long as it’s not a four-legged animal, you can do whatever you want,” says lead producer Roger Mendoza, noting that animating critters with lots of legs can be “quite painful.” But the director was able to make the case for a game called Neva about a young woman who goes on an emotional journey with a magical fox creature. “I think it was worth it,” Mendoza admits. Neva launches on October 15th (it’s coming to PC, Switch, Xbox, and PS5), and like Gris, it’s a stunningly animated 2D adventure. Players take on the role of a young woman caring for a young fox pup named Neva, trying to usher it to safety in a world filled with dark forces that look ripped out of Spirited Away. It only takes around five hours to finish, but the game spans a long period of time; each chapter is a different season, and you see the fox grow over time. At first, it’s a relatively helpless pup, but by the end, it becomes your protector. Neva and Gris share a lot in common: the short length, approachable gameplay, incredible art and animation, and narrative that’s told almost entirely without words. (Neva does have some voice acting, but it’s multiple variations of the heroine calling out Neva’s name. “I think we recorded 500 different ways of saying Neva,” jokes Mendoza.) But the new game also introduces two major features: not only a second character but also combat. “When she’s not with you, you really feel it.” According to Mendoza, the latter was inspired by the former. “[The addition of Neva] was in a way where the combat came from — we thought it would be a good mechanic to bring together the fact that there’s a companion now,” he explains. Early on, you have to fight to protect the fox, but as she grows up and changes, so, too, does that dynamic. “Now she’s the one who is taking care of you,” Mendoza says. “When she’s not with you, you really feel it. Combat felt like a good way to tie everything together.” This presented a number of design challenges, most notably in terms of accessibility. One of Gris’ biggest strengths was how easy it was to pick up and play; it even worked well on a smartphone touchscreen. But the added layer of complexity that comes from combat and a companion meant that Neva “isn’t as approachable as Gris,” according to Mendoza. “That’s something that we knew early on; the moment you add more controls, it becomes more difficult.” To account for this, the developers designed the game from the beginning with a story mode, where you can’t die in battle. “That was a way to try to find the right balance,” he says. The success of Gris — the game sold more than 3 million copies to date — gave the studio the confidence to both push in these more ambitious directions but also continue to pursue its strengths. One of the major learnings from that game, according to Mendoza, was that “you can do a strong narrative without the need for words. It’s something that we had no idea if it would work on Gris.” Neva takes things a step further, with a more direct storyline that covers a number of topics simultaneously — not only the evolving nature of a parental relationship but also overt themes about environmental destruction. Again, this story is conveyed almost entirely through art, sound, and animation. The other major learning from Gris was more practical. One of the main reasons that game’s development was so stressful and required such a long post-launch vacation was that the team was relatively small. In fact, only two programmers worked on Gris at all, forcing lots of late nights and long hours. Now that many members of Nomada are a little older, with families of their own, work-life balance is a much bigger priority. And so one of the most important changes between Gris and Neva was a seemingly simple one: “we hired more programmers.”  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 18
            },
            "author": "Andrew Webster",
            "title": "Classic survival horror is still alive and scaring",
            "description": "Recent games like Fear the Spotlight and the Silent Hill 2 remake show that the classic genre of survival horror, which started with Resident Evil, still has plenty of life in it.",
            "url": "https://www.theverge.com/2024/10/26/24279276/survival-horror-silent-hill-2-fear-the-spotlight",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/3QBY3Qgiw2WmUeL-_kl0S542K6A=/0x0:3840x2160/1200x628/filters:focal(2146x1012:2147x1013)/cdn.vox-cdn.com/uploads/chorus_asset/file/25698175/ss_a8afc7dba40ee94babdf88118bb8db7fe28ea47f.jpg",
            "publishedAt": "2024-10-26T15:00:00Z",
            "content": "By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. More than most genres, survival horror feels rooted in time. It started with the methodical Resident Evil on the original PlayStation and is defined in part by limitation — a slow pace, grimy visuals, and scant resources to help amplify the scares. Many of those elements stemmed from the early, awkward days of 3D gaming, whether it was Resident Evil’s clunky controls, which made zombie chases more terrifying, or Silent Hill’s fog, which lent an iconic atmosphere while also letting the developers get around technical limitations of the time. And a few decades later, developers are still finding ways to bring the most important elements of those games — namely, the mood and scares — to modern horror without feeling dated. The most obvious way to do this is keeping the style and tone of classic survival horror while updating the gameplay to make it more approachable. The most recent example of this is Fear the Spotlight, the first release from horror movie studio Blumhouse’s new gaming label. Much like Crow Country and Signalis, it’s a game that looks like it was ripped right out of 1998; the visuals are blocky, the textures low-res. It gives the experience a grimy feel, which is just the right note for horror. Fear the Spotlight — developed by the two-person team at Cozy Game Pals — starts out simple enough, with two friends breaking into their high school to perform a seance in the library. But, of course, things go bad, and they get pulled into a nightmare realm that connects both to their own pasts and a dark mystery the school has been hiding for decades. It’s part coming-of-age story, part romance, and part true crime. But it’s all rendered in the crunchy style of PlayStation-era horror, which lends it an uneasy edge. The game also lets you really focus on the story by streamlining the gameplay. There’s a lot of puzzle-solving; much like in early Resident Evil games, you’ll be fixing all kinds of complex mechanical problems and dealing with arcane statues and locks. But there’s almost no actual combat. Instead, you have little choice but to run and hide when the terrifying monsters appear. Some of the scariest moments of the game have you huddled under a desk, waiting for the creatures — which have deadly spotlights for faces — to pass. In some ways, removing combat makes the game even scarier since you have no way to fight back. These moments in Fear the Spotlight reminded me a bit of stowing away in a locker in Alien: Isolation, hoping the xenomorph couldn’t see me. The hazy, dirty visuals only amplify this feeling, as it’s often difficult to get a clear view of what’s ahead of you. On the other side of the spectrum is the recent remake of Silent Hill 2. Instead of creating a brand-new survival horror experience with modern sensibilities, it’s an attempt to take one of the genre’s most influential titles — a particularly idiosyncratic one at that — and reimagine it as a big-budget release in 2024. That has pros and cons. Like the remakes of classic Resident Evil games and the original Dead Space, Silent Hill 2 looks and plays like a modern release. The visuals are crisp and detailed, instead of hazy and disorienting. And it controls like a well-tuned third-person action game. It’s immensely satisfying to swing a bat, whether you’re smashing in windows or fending off a living mannequin. There’s a shift in tone. The modern Silent Hill 2 is still scary. The level of realism makes the squirming enemies and cramped hotel hallways feel incredibly unsettling, and there’s a level of immersion that can be panic-inducing. But now it plays and feels like a lot of other games and is, for lack of a better word, a lot cleaner than the original. It’s no longer as weird and distinct. It reminds me a bit of the 2018 remake of Shadow of the Colossus: a cover song that doesn’t replace the original but provides a different way of looking at it, one that’s welcoming for newcomers. (If only Konami made the original Silent Hill 2 more accessible.) The point is, these games show there is still plenty of room to do interesting things with survival horror. And they do it in a way that both connected to the genre’s history without being stifled by it. More importantly: they find new ways to scare. Fear the Spotlight and Silent Hill 2 are both available now.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "The Verge",
                "article_id": 19
            },
            "author": "Andrew Webster",
            "title": "Starfield’s big Shattered Space expansion isn’t weird enough",
            "description": "Bethesda has expanded the sci-fi universe of Starfield with its first major expansion, called Shattered Space, available on Xbox and PC.",
            "url": "https://www.theverge.com/24262053/starfield-shattered-space-expansion-review",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/cQj_vc7pA9WjPPcTtBWJs7Jpzuo=/0x0:3840x2160/1200x628/filters:focal(2762x1221:2763x1222)/cdn.vox-cdn.com/uploads/chorus_asset/file/25658080/Starfield_Shattered_Space_Screnshot_3.png",
            "publishedAt": "2024-10-05T13:00:00Z",
            "content": "By  Andrew Webster, an entertainment editor covering streaming, virtual worlds, and every single Pokémon video game. Andrew joined The Verge in 2012, writing over 4,000 stories. It’s been a long time coming for Starfield players. Bethesda’s sci-fi take on Skyrim originally launched last summer, and while there have been some updates and improvements since then, it’s taken more than a year for the game to get its first major expansion. This lead-up means there’s a lot riding on Shattered Space — which is a perfectly fine addition to the game that also feels incredibly underwhelming. After a promising setup, it ends up mostly being more of the same. Things start, as they so often do in expansions, with a distress call. This one leads you to a derelict space station that is brimming with ghostly apparitions and which eventually whisks you away to the home planet of the House Va’ruun, a religious sect that worships a giant serpent. There, you learn the Va’ruun have been beset by a calamity that has caused some members to disappear, others to turn into violent wraiths, and a number of other strange and disastrous happenings in and around their main city. After a ceremony that actually converts you to the church, your job becomes solving the mystery of the calamity and helping the House put things back in order. (Note: you can technically access Shattered Space at any point after Starfield’s opening mission, but Bethesda recommends being level 35 or higher to get through it. I played on a New Game Plus save at level 32 and didn’t really have any problems.) It’s a great premise that promises all kinds of cosmic horror. The planet you’ll explore is rendered in a garish red and purple, filled with strange glowing growths, bubbles where gravity doesn’t exist, and oddball creatures that would look right at home in No Man’s Sky. The main city — which looks like a cross between a frontier town and an ancient temple — is filled with people struggling through the turmoil, whether it’s lost loved ones, food shortages, or a crisis of faith. Shattered Space is also notable for being incredibly focused. While much of Starfield’s appeal has been the sheer scale of its universe, here, you’re limited to a single planet that’s dense with things to do and see. It’s reminiscent of the largely standalone Far Harbor expansion for Fallout 4. This results in some great storylines, particularly in the sidequests, which have you doing everything from investigating a haunted orphanage to hunting down a livestock thief. At first, the religious sect seemed standoffish and difficult to understand. But eventually, it became clear that despite their complete isolation and belief in a big snake, they were all just people struggling to get by. Even the simple missions give you some new insight into the human side of this group, which, in the main Starfield campaign, is largely branded as a sect of violent zealots. But how you do that is typical Starfield (and Bethesda) stuff. Quests have you fighting through dungeons, collecting or delivering items, and occasionally talking your way out of problems. There’s a new backdrop, but nothing much has changed in terms of the structure or moment-to-moment experience of Starfield. Those alien monstrosities are just more enemies to fight; the ghostly wraiths are just more soldiers shooting at you. At the very least, the fetch quests are a good chance to try out the new dune buggy. There’s nothing particularly bad about Shattered Space. And if you’re just looking for more Starfield, that’s exactly what this is, only in one of the more visually and narratively interesting locations in the game. But after so much time, I can’t help but want a little more than just more. Shattered Space had the potential to be weird and creepy and different, but it looks like players will have to keep waiting for something that feels truly new.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox weekly. The Verge is a vox media network © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 20
            },
            "author": "Brittany Vincent",
            "title": "Get Amazon’s Newest Fire 7 Tablet at Its Lowest Price Before It’s Gone for Good",
            "description": "Take this compact tablet with you for just $50 in your purse or bag and enjoy a world of entertainment at your fingertips.",
            "url": "https://gizmodo.com/get-amazons-newest-fire-7-tablet-at-its-lowest-price-before-its-gone-for-good-2000512982",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/amazon-fire-7-tablet.jpg",
            "publishedAt": "2024-10-17T15:51:20Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Love staying productive (or relaxing) on the go? A great tablet is all you need. Specifically, the Amazon Fire 7 Tablet is the perfect companion for all your portable entertainment needs. Whether you love to read, watch your favorite shows or movies, or you like to game while on that long train ride every morning, this tablet has you covered. See at Amazon Currently, you can get the Amazon Fire 7 Tablet for just $50, which is an insane deal. That’s 38% off its original price of $80, which saves you $30 on a device that can do just about anything you want it to, all in a pocket, compact size that you can take anywhere. Whether this is your first or fifth tablet, you can’t go wrong with the Amazon Fire 7. With its vibrant 7″ touchscreen display, 2 GB RAM, and quad-core processor, you’re set no matter what you choose to do with it while on the go or at home. Store all your favorite songs and books or browse Amazon’s Appstore to try a slew of favorite games, apps, and more. While Google Play isn’t supported, you can still download and enjoy apps like Kindle, Netflix, and Spotify, so you always have something to keep you entertained (normal subscription fees may apply). Plus, with up to 10 hours of battery life, you can get into reading, browsing the web, watching videos, and listening to music without worrying about running out of power. And if you need even more storage space, you can easily expand it up to 1 TB using a micro-SD card if you want to purchase one. Want to go hands-free? The Fire 7 tablet supports Alexa, too. With Alexa, you can make video calls to friends and family using Zoom, check your social media feeds on Instagram or TikTok, find recipes, get weather updates, and much more all by directing your tablet with your voice. That’s especially useful if you find you have your hands too full to tap around. It also enables you to use your tablet as a smart hub. Need your own tablet so you can do all these things? Or maybe you just want to grab one and put it away for a great gift this holiday season? Either way, you won’t want to miss out on this absolutely fantastic deal. Don’t miss out this lowest price deal, because there’s no telling how long this tablet price will stick around. The early bird gets the worm, after all. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 21
            },
            "author": "Matthew Gault",
            "title": "Elon Musk Is Trying to Be the MrBeast of Politics",
            "description": "The billionaire is giving away $1 million a day to registered voters. The lottery is the next evolution of politics as entertainment in America.",
            "url": "https://gizmodo.com/elon-musk-is-trying-to-be-the-mrbeast-of-politics-2000514361",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/MuskCheck.jpg",
            "publishedAt": "2024-10-21T14:15:17Z",
            "content": "When I imagine the future of American politics I see Elon Musk’s grinning face as he gives away a million bucks on stage before a crowd of clapping people. Musk is approaching politics the way a YouTuber like MrBeast approaches audience engagement. Both men are giving away huge cash prizes to get people to tune in, and they’re ignoring the legality and consequences of their actions. Over the weekend, Musk handed out oversized novelty $1 million checks to two voters in Pennsylvania. During a ceremony filmed and broadcast on X, the billionaire gave away the cash to voters who signed a petition he’s peddling in support of the constitution. John Dreher, the first million-dollar winner, is a self-professed huge Musk fan. “Actually meeting Elon, I kind of forgot about the money for a little bit,” Dreher said in a video on X. “He’s such an influential figure for guys my age who are working hard every day.” “When he came on stage it was so exciting,” Kristine Fishell, the second million-dollar winner, said in her own video on X. “He did the jump like he did at the Butler rally, it was just really fun to see.” The videos are striking because they feel more like entertainment than politics. In America, the two have long gone hand in hand, but Musk giving away cash prizes to registered voters and making them sit down to film testimonials afterward feels like a generational shift. These are the kinds of videos that would fit well on the feed of a YouTuber like MrBeast who gives away huge cash prizes for people who compete in games where they suffer and humiliate themselves. These two Pennsylvania residents received $1 million each from Elon Musk for signing a petition in support of the First and Second Amendments! 🇺🇸 pic.twitter.com/eef2a8C9ht — DogeDesigner (@cb_doge) October 20, 2024  Musk has been heavily involved in the U.S. presidential election since the attempted assassination of Trump in July. He started a pro-Trump super PAC and injected $75 million of his own cash, repeatedly posted his support for Trump online, and appeared with the candidate at a rally in Butler, Pennsylvania. But the billionaire’s latest scheme may violate campaign finance law. He’s giving one lucky voter in a swing state who signs his petition $1 million per day, every day, until the election. What’s the petition? It’s simple. “The First and Second Amendments guarantee freedom of speech and the right to bear arms. By signing below, I am pledging my support for the First and Second Amendments,” it says. Any registered voter who signs on the dotted line gets $47 bucks and is entered for a chance to win the $1 million. The cash is only available to some voters. “This program is exclusively open to registered voters in Pennsylvania, Georgia, Nevada, Arizona, Michigan, Wisconsin, and North Carolina. Expires October 21,” the petition says. If you’re wondering if this is legal, you’re not alone. On Sunday, Pennsylvania Governor Josh Shapiro called out Musk’s scheme on Meet the Press. “Musk obviously has a right to be able to express his views. He’s made it very, very clear that he supports Donald Trump. I don’t. Obviously we have a difference of opinion,” Shapiro said. “I don’t deny him that, right, but when you start flowing this kind of money into politics, I think it raises serious questions.” Rick Hansen, a legal scholar at the UCLA School of Law, called out Musk’s giveaway on his Election Law Blog. Hansen’s view? “This one is clearly illegal,” Hansen said of the $1 million giveaway. Hansen pointed to section 52 U.S.C. 10307(c) of U.S. election law and page 44 of the Justice Department’s Election Crimes Manual. “For an offer or a payment to violate Section 10307(c), it must have been intended to induce or reward the voter for engaging in one or more acts necessary to cast a ballot,” the manual said. The matter isn’t clear-cut. The money and prizes are for signing a petition, but the petition is thinly veiled and covered in language about registered voters. In their videos, both Fishell and Dreher emphasized the importance of voting and voting early. It’s clear to anyone watching that the cash prizes aren’t just rewards for the petition, but monetary incentives to get out the vote. What will come of this? Will Musk be prosecuted? I think that will largely depend on the outcome of the Presidential election. But one thing I know for sure: the future of American politics will have more MrBeast-style stunts. \nDonald Trumpelection 2024Elon Muskmr. beast  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          U.S. politics have always been a muse for popular manga series like Death Note, Baki, and Chainsaw Man, but today we're looking back at one of Trump's most prescient appearances.\n         \n          It feels like everything is on the line for the billionaire playboy.\n         \n          The case is a scary peek at the future of buying votes.\n         \n          Philadelphia District Attorney called the giveaway a \"grift\" and \"one of the great scams of the last 50 years.\"\n         \n          Trump has made it clear that RFK Jr. will get the chance to reshape public health in the U.S. if he's re-elected, which could go as far as pulling some vaccines from the market.\n         \n          New York Times tech workers are protesting for a fair contract the day before the U.S. election.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 22
            },
            "author": "Isaiah Colbert",
            "title": "Toho Animation Acquires Gkids and Aims to Bring More Japanese Media to the U.S.",
            "description": "Godzilla Minus One and The Boy and the Heron's parallel Oscar triumphs apparently made the two want to go steady.",
            "url": "https://gizmodo.com/toho-animation-acquires-gkids-and-aims-to-bring-more-japanese-media-to-the-u-s-2000512287",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Boy_and_Heron.jpg",
            "publishedAt": "2024-10-15T22:00:30Z",
            "content": "In the latest news of surprise business acquisitions and mergers that make sense at first glance, Toho Animation, the self-proclaimed leader in Japanese entertainment, has announced its acquisition of Gkids, a North American animation producer and distributor. Earlier today, Gkids published a press release describing its acquisition by the Los Angeles-based Toho as one where Toho would acquire 100% equity from Gkids. At the same time, the other would maintain its independence (and folks in power as CEOs and whatnot) while utilizing Toho’s connections to bolster its commerce and further its reach in the entertainment world. What does all that mean to the average fan of Japanese entertainment and anime? Two mega powers in the industry are combining forces to compete against other companies that are jockeying for our precious attention, such as Disney. A key motivator behind Toho and Gkids’ partnership is the winning success both companies experienced at the box office this past year with Godzilla Minus One and Hayao Miyazaki’s The Boy and the Heron. As Gkids states in its press release, both films earned significant achievements within a week of each other, with the former earning the highest box office revenue for a Japanese live-action film in the states and the third largest-grossing foreign film in U.S. history, and the latter becoming Studio Ghibli’s highest-grossing film in the U.S. And even beyond that, the two aren’t strangers to one another, having collaborated with the theatrical releases of animated films like Spirited Away: Live on Stage, Makoto Shinkai’s Weathering With You, and animation Studio Trigger’s Promare. Reading between Gkids’ press release lines, the two likely decided to perform a fusion dance of sorts after making their presences felt during the most recent awards season (including the Oscars). To put one’s capitalistic cap on, the two aim to have their combined forces lead to a repeat of their individual successes with the aforementioned award-winning films as a united front. “Gkids will continue to operate as we always have—with the same team, the same passion, and the same mission—but now with the backing of a highly complementary and legendary parent company,” Gkids founder Eric Beckman and president David Jesteadt wrote in a joint statement. “This partnership will empower us to bring even more amazing films to North American and global audiences, while we continue to champion animation as a cinematic artform and push the limits of what the medium is capable of. We could not be more excited about the opportunities in front of us. The best is yet to come.” While Toho has become a household name for many an anime fan thanks to big marquee shonen series like Dragon Ball Z and Jujutsu Kaisen, Gkids has become a bit of a rising star in the cultural zeitgeist. Its North American theatrical distribution and home video releases of Look Back, Dan Da Dan, The First Slam Dunk, and Arcane season one are the most recent money-move examples of Gkids putting itself on the map for fans of Japanese entertainment and animation. Likewise, Toho has been on a future-sighted acquisition spree, recently taking on Scott Pilgrim Takes Off, Dan Da Dan, and Devilman Crybaby animation studio Science Saru. “Through their hard work, vision, and integrity, Gkids has built a unique position in the U.S. market, which dovetails perfectly with Toho’s own strengths and strategic mission,” Toho president and CEO Hiro Matsuoka wrote in the press release. “This partnership accelerates Toho’s goals to prioritize animation, develop international markets, and support IP creation, while bringing exceptional Japanese and animated content to global audiences.” Hopefully, this no-brainer acquisition doesn’t lead to an influx of layoffs across Toho or Gkids, as we’ve seen countless times in the video game industry. In the meantime, the likes of Disney and Netflix can look forward to steep competition at both the box office and during awards season. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nGKidsGodzilla Minus OneThe Boy and The HeronToho Animation  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          io9 spoke to the Oscar-winning director at New York Comic Con, ahead of his return to the world of Godzilla in a new movie.\n         \nGodzilla Minus... Two?\n         \n          The key to being a good Godzilla filmmaker, according to Minus One's Takashi Yamazaki, is a love of cats.\n         \n          The franchise turns 70 years old, which means it's a good time to rewatch Godzilla Minus One on the big screen.\n         \n          Anime has far more to offer than shonen battle anime, and Dan Da Dan is proof of that.\n         \n          Tatsuki Fujimoto's mid-Chainsaw Man one-shot has been transformed into an instant anime classic.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 23
            },
            "author": "Brittany Vincent",
            "title": "This Amazon 32″ Fire HD TV Is Still Live at the Prime Day Price",
            "description": "Save 29% on this smart TV that you can stream, play games, and use Alexa on.",
            "url": "https://gizmodo.com/this-amazon-32″-fire-hd-tv-is-still-live-at-the-prime-day-price-2000511802",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/amazon-fire-tv.jpg",
            "publishedAt": "2024-10-15T14:25:12Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Need to upgrade your home entertainment center? There’s nothing like grabbing a new TV with a bigger, better picture to make some much-needed improvements. And you can do it right now, even if money happens to be tight. The holidays are right around the corner, so who has the cash to splurge right now, anyway? See at Amazon So if you want a significant upgrade to your setup without breaking the bank, the Amazon 32″ Fire HD TV is a fantastic option. At just $100, down from its original price of $140, this smart TV offers a great balance of features and affordability. It’s 29% off right now for a limited time, and you’ll save $40 by snagging yours. But you won’t want to wait long, because it may not be available to grab if you do. This TV brings your favorite movies and shows to life in vibrant HD 720p resolution and supports HDR 10, HLG, and Dolby Digital Audio, so you can rest assured you’ll get a great picture and crisp sound no matter if you’re catching up on your favorite TV shows or kicking back for a movie. Its built-in Fire TV platform is essentially a one-stop-shop for all your entertainment needs. With Fire TV, you can quickly access live TV, video games, and music, as well as stream over a million movies and TV episodes from streaming services like Netflix, Prime Video, Disney+, and more. And if you’re looking to save on subscription costs, you can take advantage of the free streaming options available, such as YouTube, Freevee, Tubi, and Pluto TV. You don’t even have to sign up for them to start watching. Plus, if you have multiple Fire TV devices in your home, you can ewatch your movies and shows from room to room without losing your place by moving from your TV to those units. And Amazon regularly adds new Alexa skills, features, and more so you can use your TV in some unexpected ways. You also get a Fire TV Alexa Voice Remote that makes it easy to navigate your new TV. Use the microphone button to ask Alexa to find shows, check sports scores, control your smart home devices, and more. You get all these features in a TV that’s sized to fit just about any room in your home. Even if you just need an extra TV for the kids’ room or you want to upgrade your kitchen with a screen, you can’t beat this price. But don’t hesitate. This is the kind of deal (29% off) that’ll sell out faster than you know it. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 24
            },
            "author": "Harri Weber",
            "title": "Teen Sets a Mind-Melting NES Tetris Record, Achieves ‘Rebirth’",
            "description": "The live-streamed saga featured several nail-biters, including a color-palette glitch that made the rapidly falling blocks even harder to see",
            "url": "https://gizmodo.com/teen-sets-a-mind-melting-nes-tetris-record-achieves-rebirth-2000508530",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/dogplayingtetris-record.jpg",
            "publishedAt": "2024-10-07T20:10:08Z",
            "content": "Over the weekend, 16-year-old American competitive gamer Michael Artiaga became the first human NES Tetris player to achieve “rebirth” by beating level 255 and rolling the counter back to zero. Artiaga streamed his record-setting, two-hour run on Twitch, and the feat concluded with a second pass at Level 91 after he’d cleared a total 4,216 lines for 29.4 million points, Ars Technica reports. Afterward, Artiaga remarked: “Oh my god, I’m so glad that game is over, bro. I never want to play this game again.” The achievement only took about 35 years; classic Tetris debuted on the Nintendo Entertainment System in 1989, and the game was long considered unbeatable as play hits mind-melting speeds in the upper levels, pushing the limits of human performance. Yet, the development of new techniques, rolling and hyper tapping, cleared the way for new milestones. Known as “dogplayingtetris” or simply “dog,” Artiaga also became the youngest winner of the Classic Tetris World Championships in 2020. He’s one of two teens to land in the spotlight over the past year for eviscerating earlier classic Tetris records. In December 2023, a 13-year-old streamer known as Blue Scuti effectively beat the game by reaching its kill screen, crashing the software after clearing 1,511 lines. Artiaga was able to avoid the kill screen by using a version of the game that was updated to mitigate crashes. The live-streamed saga still featured several nail-biters, including a counter bug at level 235 and a color-palette glitch that made the rapidly falling blocks even harder to see. \nNESTwitch  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          The Doc's streaming career looks like it could be over.\n         \n          The Doc said on Monday he's going to take a break and \"start something new.\"\n         \n          Streamer Adin Ross has trolled kids into breaking TVs and throwing PS4s out of the window\n         \n          The video game streaming platform can't make up its mind on boobs and butts.\n         \n          Uber has defeated Yo and it rides into the next round.\n         \n          The platform will eliminate caps on the premiere 70/30 revenue split, but streamers depending on the Prime Gaming sub payouts can expect to make less.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 25
            },
            "author": "Gizmodo Deals",
            "title": "The OnePlus Open, The Biggest Rival to The Galaxy Z Fold 6, is $400 Off on Amazon For Prime Day.",
            "description": "According to many experts, it's the best foldable smartphone of 2024.",
            "url": "https://gizmodo.com/the-oneplus-open-the-biggest-rival-to-the-galaxy-z-fold-6-is-400-off-on-amazon-for-prime-day-2000508308",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/oneplus-fold.jpg",
            "publishedAt": "2024-10-07T15:50:34Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     The OnePlus Open is a great rival to Samsung’s Galaxy Z Fold 6 and it is currently available at a 33% discount on Amazon. Originally priced at $1699, this foldable device can now be yours for just $1139 which is a substantial saving of $560. This exceptional offer is part of the Prime Day event but unlike many Prime Day deals, it’s accessible to all customers, not just Prime members. See at Amazon The OnePlus Open boasts a generous 16GB of RAM and 512GB of storage, and it is designed to handle even the most demanding multitasking scenarios with ease. The dual-SIM capability adds flexibility for users who juggle between personal and professional lines or frequently travel internationally. The device’s 120Hz Fluid Display guarantees smooth scrolling and responsive touch interactions and enhances the user experience whether you’re browsing the web, gaming or working on productivity tasks. This high refresh rate display is particularly beneficial on a foldable device, where the larger screen real estate can be fully utilized for immersive content consumption and multitasking. Photography enthusiasts will appreciate the Hasselblad camera system integrated into the OnePlus Open. This collaboration brings Hasselblad’s renowned color science and imaging expertise to a foldable smartphone. On all its previous premium phones, OnePlus has already been working with Hasselblad to offer good camera systems. One of the features we like on the OnePlus Open is its impressive 4805 mAh battery which promises extended usage times. Coupled with the 67W fast charging technology, users can quickly top up their device and get back to their tasks or entertainment without long waits. At $1139 instead of $1699 during Prime Day, the OnePlus Open represents exceptional value for money especially considering its high-end specifications and unique foldable design. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 26
            },
            "author": "James Whitbrook",
            "title": "Six Years On, Our First Look at The Mandalorian Still Haunts Me (for One Stupid Reason)",
            "description": "Everywhere I go, I see his face. Well, helmet.",
            "url": "https://gizmodo.com/the-mandalorian-first-look-anniversary-star-wars-lucasfilm-2000507722",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/star-wars-the-mandalorian-first-look-image.jpg",
            "publishedAt": "2024-10-04T20:51:54Z",
            "content": "Six years ago today, Lucasfilm revealed our very first look at The Mandalorian. How time flies! So much has happened in those last six years, and how little did we know that the series would go on to spur a boom-and-bust Star Wars TV show endurance run over the last half-decade that has given us giddy highs and dizzying lows. How little did we know that this image basically told us nothing about what the show was really going to be about! But after fellow writer and friend of the site Jordan Maison reminded me about this peculiar Star Wars anniversary on social media today, I could only remember one thing about it. It wasn’t the nerdy joy about, oh my, is that an Amban phase-pulse rifle on his back (it was, and perhaps a sign of things to come with the show’s eventual Easter egg and cameo obsession). It wasn’t even wondering why this Mandalorian armor we were seeing looked so weirdly low key and scruffy (nobody’s perfect, as we’d come to learn about the man we’d eventually know as Din Djarin). It was that I had to stare at this image from that fateful October day for weeks, and months, figuring out ways to re-use it over and over on this very website. This is, of course, a very inside-baseball complaint to have. A Star Wars fan just got to look at the first ever look at the first ever live-action Star Wars TV show and go ‘whoa, cool!’ and move on with their lives. But reader, Lucasfilm would not release another official look at The Mandalorian for another six months, when the first footage from the series debuted at Star Wars Celebration in 2019. And if you’re familiar with the website you’re reading right now, you can safely assume that, many times over that six-month period, we had to write about The Mandalorian quite a lot. And when all you have to do that with is a single image of a character that you know absolutely nothing about, that starts to drive you insane. We tend to have a policy at io9 of trying not using the same image over and over on our stories, so we would try anything we could to mix it up: a super tight crop here, a wider one there. One that would push this mysterious Mando closer to the left of the frame, or to the right. But there are only so many times you can do that when all you have is one press image from the series, and six months is practically an eternity in the world of entertainment journalism. The reason that this incredibly silly detail is what comes to my mind immediately about this image of The Mandalorian, rather than the long, strange six years we’ve had in the galaxy far, far away since then, is because this is not a particularly unique problem to the show. In my 10 years writing as a pop culture critic, I’ve experienced this particularly inane issue over and over. There was a time when Rogue One was coming out that, before any trailers, there was only one official image of Jyn and the crew in the Yavin IV base that we could use—but at least that had multiple characters you could focus on for variety’s sake. We’re going through it right now again with James Gunn’s Superman movie, with the singular shot of David Corenswet suiting up as the Man of Tomorrow all we have to illustrate any story about the film until something, anything else comes out. The arcane world of press images will always create situations like this, especially in an entertainment industry that loves to trickle out material to drip feed fans and control the flow of hype. I don’t know why The Mandalorian‘s first image is the one that sticks with me the most of them all, but as we prepare ourselves for a long, long wait to see the series’ seemingly final evolution in The Mandalorian & Grogu movie next year—which itself currently has just a single released image to its name, in the form of concept art—it’s a funny thing to look back on all these years later. At least now, six years later, we have enough images of the Mandalorian and Grogu to last us a good while yet. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \ninside baseballLUCASFILMStar WarsThe Mandalorian  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Alongside his late brother Tim, Greg Hildebrandt was responsible for some of the most iconic images in fantasy illustration.\n         \n          Get ready for synths, giant creatures, pirates, and a whole lot of kids adventures on December 3.\n         \n          In a new interview, it's revealed the Star Wars creator originally considered flipping Qui-Gon Jinn and Obi-Wan Kenobi.\n         \n          New Star Wars star Jude Law spoke about his upcoming Disney+ series.\n         \n          After the events of The Last Jedi, Kylo's going back to what he's best at: looking to his grandpappy for evil guidance.\n         \n          Steven Knight is the latest to exit Lucasfilm's attempts to return to the Star Wars timeline after the events of The Rise of Skywalker.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 27
            },
            "author": "Gizmodo Deals",
            "title": "Post Prime Day, MagellanTV Lifetime Subscription is Available For $159 Instead of $1,000",
            "description": "MagellanTV is offering a lifetime subscription featuring over 3,000 documentaries for just $159.",
            "url": "https://gizmodo.com/post-prime-day-magellantv-lifetime-subscription-is-available-for-159-instead-of-1000-2000511081",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/magellantv-offre.jpg",
            "publishedAt": "2024-10-13T12:15:14Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     In the wake of Prime Day, StackSocial offers an exclusive deal that will for sure captivate documentary enthusiasts worldwide : the premier streaming service dedicated to high-quality documentaries MagellanTV got a lot cheaper for the week-end. Viewers can secure a lifetime subscription to MagellanTV’s vast library of over 3,000 documentaries for just $159, which is an astounding 83% discount from the original price of nearly $1,000. See at StackSocial This Prime Day special is a terrific opportunity for those who may have missed out on similar deals during recent shopping events. The lifetime subscription grants unlimited and ad-free access to MagellanTV’s extensive collection which covers a wide range of topics including history, science, nature, culture and more. With new content added every week, subscribers can continually expand their knowledge and explore diverse subjects. What sets MagellanTV apart from other popular streaming platforms is its unwavering commitment to quality over quantity: unlike services that may flood their libraries with subpar content, MagellanTV meticulously curates its selection to ensure every documentary is worth watching (4K content at no extra charge). This focus on substance over sensationalism makes it an ideal choice for those seeking meaningful and educational entertainment. MagellanTV’s library boasts an impressive array of award-winning documentaries including exclusive originals and content from renowned producers worldwide. From deep dives into ancient civilizations to cutting-edge scientific discoveries, the platform offers something for every curious mind. The service’s user-friendly interface (mobile, desktop and tablet) and personalized recommendations make it easy to discover new favorites and expand your horizons. The value of this offer becomes even more apparent when compared to other streaming services. While platforms like Netflix charge $15.49 monthly for their basic plan (amounting to over $185 annually), MagellanTV’s lifetime subscription pays for itself in less than a year. This makes it an incredibly cost-effective choice for documentary lovers who are in it for the long haul. For those who might be hesitant to commit, MagellanTV typically offers a 7-day free trial for monthly plans and an extended 14-day trial for annual subscriptions. However, given the exceptional value of this lifetime deal, it’s hard to imagine a better time to dive into the world of documentary streaming. See at StackSocial \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 28
            },
            "author": "Joe Tilleli",
            "title": "My Favorite Sonos Sub Mini Speaker is a Best Seller on Amazon at Its Lowest Price, Thanks to Prime Week",
            "description": "Save almost $100 on a compact wireless subwoofer from Sonos in this extended Prime Day deal.",
            "url": "https://gizmodo.com/my-favorite-sonos-sub-mini-speaker-is-a-best-seller-on-amazon-at-its-lowest-price-thanks-to-amazon-prime-week-2000511238",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/SonosMiniSub.jpg",
            "publishedAt": "2024-10-11T19:25:51Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     The sun has set on Prime Day. This past Tuesday and Wednesday were Amazon’s big Fall savings event where products across every category be it consumer tech, home goods, and more see huge sales to kick off the end-of-year holiday shopping. If you weren’t paying attention and missed your shot at savings a buck or two, it’s not the end of the world. There are still a handful of deals on great items that have extended past the final hour of Prime Day. If you’ve been on the hunt for home electronics to enhance your TV and movie viewing experience, then look no further than the Sonos Sub Mini — currently 20% off and going for just $343. This compact wireless subwoofer from Sonos can help you immerse yourself in every scene with clear, and balanced low-end sound. Pairing with a Sonos Beam or Ray and add exponentially better depth to the audio of what your watch compared to using your TV’s built-in speakers, making for a more enjoyable and richer viewing and listening experience. See at Amazon The dual custom woofers face inward at each other which creates a force-canceling effect, neutralizing distortion. What this means in you should hear no buzz or rattle when watching your favorite shows, movies, or sporting events. Inside the acoustically-sealed cabinet, full-toned low frequencies are generated at the same level of a much larger subwoofer and though enhanced algorithmic processing, the bass can be made to sound even better. The bass adapts on the fly to your room’s natural acoustics, which can work to make your Sub Mini sound the best it possibly can, even if you are to place it near a wall. Setup is super easy as the whole system is just plug and play. Once your Sub Mini is connected to power, the Sonos app on your phone can instantly detect it, so it can be added to the rest of your audio entertainment system. Once set up, the audio levels will automatically adjust along with the volume controls of your paired speaker or soundbar, and the Sonos app can further customize the EQ and bass levels to best match your preferences. The Sub Mini can be mixed and matched with an array of Sonos soundbars and speakers, so you can find the best speaker setup for your home and budget level. Right now, the Sonos Sub Mini is going for 20% off even though Prime Day ended days ago. Get it for just $343 today. Bring booming sound to your living room with the Sonos Sub Mini. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 29
            },
            "author": "Gizmodo Deals",
            "title": "Why Overpay for a VPN? Get 73% Off NordVPN Plus 3 Free Months",
            "description": "Black Friday isn't here yet, but NordVPN is already offering a promo deal you won't want to miss. You can get a significant discount and several free months.",
            "url": "https://gizmodo.com/why-overpay-for-a-vpn-get-73-off-nordvpn-plus-3-free-months-2000506714",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/NordVPN-Good-Deal-Featured-Image.jpeg",
            "publishedAt": "2024-10-08T21:15:04Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Don’t be fooled into thinking you can’t get a great VPN at a competitive price. NordVPN has slashed its prices like a samurai, with 73% off discounts for its splendid 2-year plans. At the moment, you can pay as low as $3.09/mo for the world’s #1 VPN – pay attention. Try NordVPN Risk-Free At $3.09/mo When you get NordVPN, you know what you’re getting yourself into. This VPN boasts over 6,400 servers in 111 countries, with a huge focus on speed and performance. Security is top-notch, with AES-256-bit encryption, RAM-based servers, and Double VPN connections. We said it’s the #1 VPN overall also because of privacy. Its no-log policy ensures everything you do online is a secret. Moreover, NordVPN is fully streaming-friendly and allows for P2P, giving you endless entertainment at an all-time low price. Best of all? It’s risk-free! NordVPN has a 30-day money-back guarantee for ALL plans. It works on all devices and supports 10 simultaneous connections, so you can protect all devices you have. We challenge you to find a superior VPN at $3.09/mo. Enough hype – or is it?! NordVPN’s 2-year deal can be accessed directly through the link below. Click it and once on the site, press “Get the Deal.” Now, you’ll see the 2-year plan staring at you and beckoning you to take it. By this deal, we think about the Basic one. It’s 73% off in 2024, costing $3.09/mo or around $84 upfront for 27 months. If you want more than just its fast VPN, our team advises the Plus plan at $3.99/mo with 3 extra months as well, at around $107 for 27 months. You’ll get malware protection and a VPN ad blocker. NordVPN’s Complete plan is a total bargain as well. At $4.99/mo and $134.73 for 27 months, newcomers can enjoy 1 TB of NordLocker and the NordPass password manager. Rest assured, NordVPN’s 1-year plans are competitively discounted for more massive savings. Now that you know this, it’s hard not to hesitate. Be mindful and hurry. Don’t hesitate long because NordVPN’s discounts usually don’t last very long. $3.09/mo sounds like an insanely low price and we don’t think it’ll be active anytime soon again. See at NordVPN \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 30
            },
            "author": "Brittany Vincent",
            "title": "Amazon Offers Samsung Galaxy Tab S9 FE at Lowest Price for Early Black Friday",
            "description": "Save over $100 and go anywhere and do anything with this Samsung tablet, which can handle work, play, and more no matter where you roam.",
            "url": "https://gizmodo.com/amazon-offers-samsung-galaxy-tab-s9-fe-at-lowest-price-for-early-black-friday-2000517262",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/samsung-galaxy-tab-s9.jpg",
            "publishedAt": "2024-10-28T14:15:06Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     If you’re the type of person who’s always on the go, you know the importance of having a portable workstation or entertainment center to keep you moving and ready to do what you need to do at any given time. If you’re looking for something that fits the bill that can also save you some cash, you should consider the Samsung Galaxy Tab S9 FE, a tablet that can keep up with your lifestyle while offering a variety of can’t-miss features. See at Amazon You can get your hands on the Samsung Galaxy Tab S9 FE for right now at Amazon at a 27% discount. Normally $450, you can snag yours for just $326, which saves you $124. This is one portable device that can actually act as your on-the-go companion when you need it, just like Apple’s iPad series. The Galaxy Tab series is one that has your back when you need it. The Galaxy Tab S9 FE tablet has a bright and crisp 10.9″ screen that immerses you in your favorite content, whether you’re getting some work done, gaming, or watching movies and TV. It has dual speakers for better sound quality as well as a new Circle to Search feature powered by Google that lets you literally draw a circle around something you see on the screen to do a search. It’s also rated IP68 rated, which means it’s both water- and dust-resistant. You don’t have to worry about getting it wet or having it roll around in the dirt (or letting the kids get to it.) It’ll be there for you on the long haul, too. You get 18 hours of use on a single charge. When you do need to juice it back up, its fast charging feature ensures you’ll be back to full power in less than 90 minutes. To top it all off, its internal Exynos chipset is powerful enough to handle anything you throw at it, and if you multitask like the rest of us, that could me many things at one given time. One of the coolest additions to the package is the included S Pen that lets you write notes by hand, draw, or mark up documents in a way that mimics writing on actual paper. That makes it the perfect “digital notebook” or a great way to doodle if you’re in a creative field and want to share ideas – or just make some art. If you’re ready to snag a great little tablet, don’t pass up on this deal (27% off). It won’t be on sale for long, and the holidays are right around the corner. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 31
            },
            "author": "Lucas Ropek",
            "title": "Nobody Can Rent Twister, the Last DVD Trapped in Redbox’s Dead Video Business",
            "description": "Hardware nerds just want to see Bill Paxton and Helen Hunt outrun a tornado. Why isn't that possible?",
            "url": "https://gizmodo.com/nobody-can-rent-twister-the-last-dvd-trapped-in-redboxs-dead-video-business-2000516681",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/A-person-renting-a-movie-at-a-Redbox-dispenser.jpg",
            "publishedAt": "2024-10-25T20:30:22Z",
            "content": "Though Redbox, the DVD vending machine company, is officially dead, the company’s disc-dispensing kiosks are still strewn all over America. The machines still work and there are still hundreds of DVDs inside of them. Lately, those machines have been getting sold off to various hardware enthusiasts who have, in turn, been reverse-engineering them to figure out how they work, and to dispense the movies trapped inside. Well, with one exception: Twister. 404 Media reports that, for some weird reason, the army of amateur hardware enthusiasts who have been futzing with the company’s machines cannot figure out how to get the 1996 disaster flick out of them. To illuminate this bizarre conundrum, 404 cites a series of Reddit threads and Discord communities where the hardware pros have been posting about the issue. “Sorry, there was a problem with the purchased items in your cart. Please remove these items from your cart in order to continue,” an alert from the kiosk reads, whenever someone tries to rent Twister. This issue impacts “seemingly every Redbox kiosk and is not happening with any other movie,” the outlet writes. 404 Media writes that the machine’s refusal to dispense Twister “appears to be either a licensing dispute or software bug.” The outlet further states that one of the prevailing theories is that “Redbox’s licensing agreement for Twister ran out ahead of the release of its sequel, Twisters, and there is a hard-coded date where checking out with Twister in your cart was disabled.” That said, 404 notes nobody has been able to confirm this. Redbox swept onto the video rental scene in the early aughts, not long before the industry’s mom-and-pop store paradigm would be disrupted by the advent of Netflix and video streaming. Originally an offshoot of McDonald’s, the company expanded aggressively in the years after its founding. At one point, Redbox surpassed Blockbuster as the largest video rental retailer in the country. Now, of course, that’s all over, thanks to the dominance of streaming. Two years ago, a subsidiary of the company that publishes the Chicken Soup for the Soul self-help book series bought Redbox. Chicken Soup for the Soul Entertainment took on $325 million in debt when it acquired the company, with the plan of reinventing the ailing business. Instead, the company wracked up an enormous amounts of debt and was forced to file for bankruptcy this past August. As part of the bankruptcy deal, Redbox had to be liquidated. The Verge reports that when Chicken Soup filed for bankruptcy this summer, it had been “sued over a dozen times over unpaid bills.” \nRedboxtwister  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Hackers reveal the old Redbox kiosks can be easily hacked for users' names and some financial info. The data may go back close to a decade.\n         \n          Some people are taking the iconic red kiosks home as collector's items. But be warned: the energy costs are steep.\n         \n          Say so long to those red kiosks outside of the convenience store.\n         \n          As Netflix officially ends its DVD-by-mail service, Scarecrow Video is stepping in to fill the void and defend history.\n         \n          The Seattle-based Scarecrow store has a massive library of movies, and ‘most’ of their DVD’s and Blu-rays can be ordered up to six discs at a time.\n         \n          Bravo, Hulu, Redbox, and Blockbuster all delighted in poking fun at the once-mighty Netflix, which has struggled with declining subscriber numbers.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 32
            },
            "author": "Gizmodo Deals",
            "title": "Premium Sound for Under $100: This 24-Inch Soundbar Easily Connects to Your TV or Smartphone",
            "description": "The value for money of this Fire TV Soundbar is incredible.",
            "url": "https://gizmodo.com/premium-sound-for-under-100-this-24-inch-soundbar-easily-connects-to-your-tv-or-smartphone-2000508118",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/fire-tv-soundbar.jpg",
            "publishedAt": "2024-10-07T12:10:57Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     As Amazon’s Prime Day kicks off, one very popular deal is catching the attention of audio enthusiasts: the Amazon Fire TV Soundbar originally priced at $119.99 is now available for just $94.99. This exceptional offer is not exclusive to Prime members: it’s accessible to everyone. See at Amazon The Fire TV Soundbar has quickly established itself as one of the best value-for-money options in the soundbar market. At its new price point of under $100, it outperforms many budget competitors and offers features and sound quality typically found in more expensive models. One of the key features of this soundbar is its support for DTS Virtual:X, Dolby Audio and Bluetooth (you can link it to your smartphone as well). These technologies enable a surround sound experience that significantly outperforms standard TV speakers and create a more immersive viewing experience. The enhanced bass output adds depth to movie soundtracks and music, bringing your content to life in a way that built-in TV speakers simply can’t match. Ease of setup is another major selling point of the Fire TV Soundbar: Its compact size – measuring just 24 inches long and 2.5 inches tall – makes it an ideal fit for most entertainment systems and regardless of space constraints. Installation is a breeze: simply plug it into a power source and connect it to your TV via HDMI. This plug-and-play functionality means you can upgrade your audio setup in minutes. While the Fire TV Soundbar is designed to pair seamlessly with Amazon’s Fire TV devices, it’s important to note that it works well with any TV. This versatility adds to its value proposition, making it a great choice for a wide range of setups. The build quality of the Fire TV Soundbar is impressive for its price range. As Prime Day is here, this deal on the Amazon Fire TV Soundbar represents an excellent opportunity to upgrade your home audio setup. Its combination of affordability, ease of use and quality sound output makes it one of the best value propositions in the current soundbar market. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 33
            },
            "author": "Justin Carter",
            "title": "Ready or Not’s Sequel is Officially in Play",
            "description": "After months of teases and hopes, Radio Silence and Samara Weaving are back to play another murderous game.",
            "url": "https://gizmodo.com/ready-or-not-2-confirmed-2000511553",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/readyornot-weaving.jpg",
            "publishedAt": "2024-10-13T14:30:37Z",
            "content": "Over five years ago, Samara Weaving and directors Tyler Gillett and Matt Bettinelli-Olpin (aka Radio Silence) delivered Ready or Not, a horror-comedy film a lot of people liked. While all three of them have been busy since then, Weaving’s said she’s more than happy for another go, and there’s been rumblings (and hopes) throughout this year of a potential sequel. According to the Hollywood Reporter, it’s time to get excited, because Ready or Not 2 is now fully a-go. Samara will be back in the lead role, and Radio Silence will once again direct, working off a script by returning writers Guy Busick and R. Christopher Murray. What’s the sequel gonna be about? Not a clue, and it’s not even clear if Weaving will play her character from the original film. But hey, it’s just good to know it’ll actually be happening, right? If you haven’t seen it yet, Ready or Not centered on Weaving’s Grace, who opens the film just married to the son of a wealthy family. On the night of their wedding, Grace and her new in-laws play Hide n Seek, but it turns out to be much more than what it sounds: if anyone finds her before the night is over, they will legitimately kill her as part of a ritual believed to be the continued source of the family’s wealth. With her new family trying to off her or turn on each other, Grace starts picking up skills to live through the night and eventually go on the offensive. This was a big money maker for Searchlight at the time; it made $57.6 million worldwide on a $6 million budget, and it had a pretty good life in the home entertainment scene. It also gave a big profile boost to its three central players: Radio Silence’s continued horror presence with the Scream sequels and most recently Abigail, while Weaving’s become a big star in her own right. If things have finally aligned for them to do another of these, then let’s goooooooooo. Expect more coverage on Ready or Not 2 as we learn it. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nHorrorRadio SilenceReady or NotReady or Not 2Samara WeavingSearchlight  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.\n         \n          A creator of the hit Showtime show starring Christina Ricci, Sophie Thatcher, and Melanie Lynskey teases 2025's new season.\n         \n          Creepy character posters for the December release urge viewers to reflect on where evil truly resides.\n         \n          To celebrate Halloween, HBO has revealed new images and info for Stephen King prequel It: Welcome to Derry, coming in 2025.\n         \n          Art the Clown is the murder machine of the moment, so we're taking a look at our personal favorite death scenes across the series so far.\n         \n          Get in the spooky season spirit and revisit Len Wein and Bernie Wrightson's very own Treehouse of Horror comic.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 34
            },
            "author": "Gizmodo Deals",
            "title": "This Rival to the iPad Pro is Now 43% Off on Amazon and Costs Only $159 During Prime Day",
            "description": "Amazon offers an incredible 43% discount on this impressive iPad Pro rival.",
            "url": "https://gizmodo.com/this-rival-to-the-ipad-pro-is-now-43-off-on-amazon-and-costs-only-159-during-prime-day-2000508655",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/fire-tv-11.jpg",
            "publishedAt": "2024-10-07T20:36:54Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Amazon’s Prime Day is bringing a terrific deal on the 128GB Fire Max 11 tablet which is currently available for just $159 down from its regular price of $279. This is a massive 43% discount on the original price, and the best deal ever seen for this iPad competitor. See at Amazon The Fire Max 11 has an impressive 11-inch display with 2.4 million pixels (2000 x 1200 resolution) and provides a vivid and immersive viewing experience for movies, TV shows and games. Certified for low blue light, it ensures comfortable extended use for anyone. This screen quality puts it in direct competition with more expensive tablets, including some iPad models. Under the hood, the Fire Max 11 packs a punch with its octa-core processor and 4GB of RAM coupled with Wi-Fi 6 capabilities. This combination guarantees fast streaming, responsive gaming and efficient multitasking which makes it a versatile device for both entertainment and productivity. Of course, the tablet also integrates seamlessly with Alexa for easy voice control. One of the main features of the Fire Max 11 is its sleek aluminum design, which not only looks premium but also offers durability. Amazon claims it’s three times as durable as the iPad 10.9-inch (10th generation) in tumble tests and ads an extra layer of value for users concerned about longevity. With an impressive 14-hour battery life, the Fire Max 11 is perfect for all-day use whether you’re reading, browsing the web, watching videos, or listening to music. The 128GB storage option is expandable up to 1TB with a micro-SD card and will provide ample space for all your content. For those looking to use the Fire Max 11 for work, the tablet is compatible with an optional keyboard case and stylus pen (sold separately) which can transform it into a productive workstation. Additionally, it comes with a 3-month trial of Microsoft 365 Personal. At $159 instead of à279 for the 256GB version, the Fire Max 11 offers exceptional value and rivals more expensive tablets in terms of features and performance. This Prime Day deal is a (very( rare opportunity to own a high-quality tablet at a fraction of the cost of comparable devices. It belongs to the most sold products in its category. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 35
            },
            "author": "Mike Fazioli",
            "title": "All Time Lowest Price of the Newest Google Pixel Tablet for AI in the Palm of Your Hand Ends Tonight!",
            "description": "This Prime Big Deal slashes $100 off the price of this amazingly smart Android tablet, all the way down to a lowest-ever $300",
            "url": "https://gizmodo.com/all-time-lowest-price-of-the-newest-google-pixel-tablet-for-ai-in-the-palm-of-your-hand-ends-tonight-2000509858",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Google-Pixel-11.jpg",
            "publishedAt": "2024-10-09T16:44:47Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     The Google Pixel may be the smartest tablet you’ll ever use. It’s an AI-powered creative and productivity superstar that optimizes all of Google’s vast suite of apps. Best of all? It’s on the Amazon Prime Big Deal list, at its lowest-ever price of just $300. The Pixel Tablet is powered by the AI-enabled Tensor G2 chip, which turns the tablet into a smooth-streaming portable entertainment device and allows high-quality lag-free video calls and conferencing on its sharp 11-inch screen. Google’s newest best tablet usually sells for $400, but it’s an Amazon Prime Big Deal Days must-have at just $300. See at Amazon You probably use more Google apps than you realize, and far more often. It’s the world’s default search engine, but it’s also Gmail, Photos, and the vast suite of Google Drive productivity apps like Docs and Slides. Did we mention YouTube? Yeah, Google owns that too. There’s no better device for fully utilizing this huge arsenal of Android apps than the Google Pixel Tablet. They all run seamlessly since it’s a native device designed for them. That includes Google Home, which turns your Pixel Tablet into the ultimate remote control for everything in your home from lights and locks to security cameras. The AI capabilities are there for you when it’s time to write, plan, or otherwise be productive. Google Gemini (formerly Bard) is the AI chatbot that makes intuitive and helpful suggestions to get your email or work project rolling, and Google AI can also search for anything from whatever app you’re using when you draw a circle on the touchscreen around an image, video, or block of text. We’re all guilty of multitasking, especially when on a boring Zoom call for work. If you’re enduring that call on a Google Pixel Tablet, you can engage the Split Screen feature that lets you view two apps side by side. (Your boss will be none the wiser!) And when you use the Pixel Tablet for gaming or streaming, the sound from its 4 speakers is every bit as impressive as the crystal-clear 11-inch image on the screen, and the Tensor G2 chip is powerful enough to kill lag. The Google Pixel 11 is a “what-can’t-it-do” tablet that put advanced AI and the substantial power of Google’s many apps in the palm of your hand, and does all this despite weighing barely 1 pound. And at its lowest-ever price of $300, it’s one of the top Prime Day deals. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 36
            },
            "author": "Brittany Vincent",
            "title": "Wrap Up Prime Days with 30% off the LEGO Brick Box to Enjoy The Upcoming Holidays",
            "description": "Everyone loves playing with Lego, so take advantage of Prime Day to buy some for yourself at a steep discount, or consider giving some to a friend.",
            "url": "https://gizmodo.com/wrap-up-prime-days-with-30-off-the-lego-brick-box-to-enjoy-the-upcoming-holidays-2000509844",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Untitled-design-6.jpg",
            "publishedAt": "2024-10-09T17:15:38Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Lego has been a beloved toy for generations. The colorful little blocks have captured the imaginations of children and adults alike for as long as you can probably remember. In a world that often feels too dark and serious, Lego can be a fun escape. Building your own creations is exciting, whether you’re a little kid or a grandparent watching your family put together rainbow rocket ships and colorful dinosaurs. Whether you’re looking for a fun way to destress after a long day or you need the perfect gift for someone creative in your life, the Lego Classic Vibrant Creative Brick Box is a great place to start. See at Amazon Right now, you can get your hands on this expansive set for just $42, down from its original price of $60. That’s a 30% discount, and it saves you $18 on a toy that will provide hours of entertainment and endless possibilities. Seriously. Have you ever actually sat down and tinkered with Lego sets before? The Lego Classic Vibrant Creative Brick Box is designed for anyone ages 4 and up. It comes with a huge assortment of colorful bricks that you or anyone you give it to will love building with. With 850 Lego pieces included, the possibilities are endless, too. But if you aren’t so good with figuring out what to build, that’s fine too. This kit comes with ideas for you: a unicorn, skateboard, guitar, plane, and more. For example, it comes with a buildable horse toy that stands over 3 inches tall, as well as a carrot van that measures over 3 inches high, 3.5 inches long, and 1.5 inches wide. And if you want to expand the fun even further, you can combine this creative building set with others in the Lego Classic collection so there are even more fun things to build. You can mix and match the bricks and swap out various pieces like doors, windows, wheels, plants, eyes, and see-through elements too, so you certainly aren’t relegated to what’s in the box already. Just go wild and make what speaks to you. Lego can be expensive, and this set is a great place to start building a collection of bricks that might even be able to stay with you for a lifetime, with your kids or your kids’ kids passing it down. It’ll put a smile on anyone’s face, and you’ll be especially glad you took the plunge at this price, 30% off. Just snatch it up fast before it’s gone. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 37
            },
            "author": "Gizmodo Deals",
            "title": "iPad 9: Amazon Slashes Price Again, Now 5 Times Cheaper Than iPad Pro for Prime Day",
            "description": "Amazon is slashing prices across all Apple products for Prime Day.",
            "url": "https://gizmodo.com/ipad-9-amazon-slashes-price-again-now-5x-cheaper-than-ipad-pro-prime-day-2000507980",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/ipad-9th.jpg",
            "publishedAt": "2024-10-07T17:29:25Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     This Saturday, Amazon is offering a great deal on the 9th generation iPad (64GB, Wi-Fi model), slashing the price from $329 to just $199. This 40% discount marks the lowest price ever for this good Apple tablet and the record-low briefly seen during Prime Day sales earlier this week. But unlike Prime Day, this deal is available to everyone, not just Prime members. See at Amazon While not the latest model, the 9th generation iPad remains a highly capable device. It features a 10.2-inch Retina display that offers bright colors for all your viewing needs and it is powered by the A13 Bionic chip to ensures smooth performance for everyday tasks. With 64GB of storage, it provides ample space for apps, photos, videos and documents. One of the most significant upgrades from its predecessor is the 12MP Ultra Wide front camera which supports Center Stage. This feature automatically pans and zooms to keep subjects centered in the frame during video calls and makes it ideal for remote work or online learning. The iPad 9 is compatible with the first-generation Apple Pencil and enhances its usability for digital art and note-taking. Its Smart Connector allows for easy attachment of keyboards and boosts productivity for tasks like writing emails or working on documents. With up to 10 hours of battery life, the iPad 9 can easily last through a full day of use. Whether you’re streaming videos, browsing the web or working on projects, you won’t need to worry about frequent charging. It’s perfectly suitable for students, professionals and casual users alike; it can serve as an e-reader, a portable entertainment device, a digital canvas or even a secondary display for your Mac. This deal presents an rare and great opportunity for anyone in need of a reliable tablet to enter or upgrade within the Apple ecosystem at a fraction of the usual cost (40% is insane!). Deals of this magnitude on Apple products are exceedingly rare; Apple is known for maintaining strict control over its pricing and rarely offers discounts in its own stores. At $199, this iPad offers incredible value and versatility. If you’ve been considering an iPad purchase, now is the time to act. This deal is likely part of Amazon’s efforts to clear out inventory after Prime Day and is not expected to last long (it should expire latest on Sunday). Once this weekend passes, it’s unlikely we’ll see prices this low again until Black Friday. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 38
            },
            "author": "Gizmodo Deals",
            "title": "On Prime Day, This Popular iPad is 10x Cheaper Than a Good MacBook Pro",
            "description": "You can therefore buy 10 iPads for the price of one MacBook Pro.",
            "url": "https://gizmodo.com/on-prime-day-this-popular-ipad-is-10x-cheaper-than-a-good-macbook-pro-2000508749",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/ipad-9th.jpg",
            "publishedAt": "2024-10-08T11:40:00Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     This Saturday, Amazon is offering a great deal on the 9th generation iPad (64GB, Wi-Fi model), slashing the price from $329 to just $199. This 40% discount marks the lowest price ever for this good Apple tablet and the record-low briefly seen during Prime Day sales earlier this week. But unlike Prime Day, this deal is available to everyone, not just Prime members. See at Amazon While not the latest model, the 9th generation iPad remains a highly capable device. It features a 10.2-inch Retina display that offers bright colors for all your viewing needs and it is powered by the A13 Bionic chip to ensures smooth performance for everyday tasks. With 64GB of storage, it provides ample space for apps, photos, videos and documents. One of the most significant upgrades from its predecessor is the 12MP Ultra Wide front camera which supports Center Stage. This feature automatically pans and zooms to keep subjects centered in the frame during video calls and makes it ideal for remote work or online learning. The iPad 9 is compatible with the first-generation Apple Pencil and enhances its usability for digital art and note-taking. Its Smart Connector allows for easy attachment of keyboards and boosts productivity for tasks like writing emails or working on documents. With up to 10 hours of battery life, the iPad 9 can easily last through a full day of use. Whether you’re streaming videos, browsing the web or working on projects, you won’t need to worry about frequent charging. It’s perfectly suitable for students, professionals and casual users alike; it can serve as an e-reader, a portable entertainment device, a digital canvas or even a secondary display for your Mac. This deal presents an rare and great opportunity for anyone in need of a reliable tablet to enter or upgrade within the Apple ecosystem at a fraction of the usual cost (40% is insane!). Deals of this magnitude on Apple products are exceedingly rare; Apple is known for maintaining strict control over its pricing and rarely offers discounts in its own stores. At $199, this iPad offers incredible value and versatility. If you’ve been considering an iPad purchase, now is the time to act. This deal is likely part of Amazon’s efforts to clear out inventory after Prime Day and is not expected to last long (it should expire latest on Sunday). Once this weekend passes, it’s unlikely we’ll see prices this low again until Black Friday. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 39
            },
            "author": "Joe Tilleli",
            "title": "Secure the Sony S100F Soundbar for Just Under $100 Before the Black Friday Rush",
            "description": "Save 25% on a Sony compact 2.0 channel soundbar at Amazon right now.",
            "url": "https://gizmodo.com/secure-the-sony-s100f-soundbar-for-just-under-100-before-the-black-friday-rush-2000515750",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/SonySoundbar.jpg",
            "publishedAt": "2024-10-23T20:13:04Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Upset that Amazon’s Prime Big Deals Days have already come to pass? If you were hoping to upgrade your home entertainment situation be it in your living room, bedroom, basement, or home theater, but missed out on the great deals we saw at the beginning of the month, you are thankfully no out of luck. Black Friday is still some ways away, but there are great deals active right now if you know where to look. Right now, Sony has a 2.0 channel soundbar on sale for 25% off. Normally going for $130, that discount is enough to bring this television audio accessory down under $100 at just $98. See at Amazon Sound is 50% off the movie-watching experience. You can have the best picture in the world available, but it won’t leave it’s full impact if the audio is coming out of the TV’s built-in speakers. The best way to improve your home audio for watching movies, football games, and big budget TV shows without breaking your own budget is with a soundbar. This 2.0 channel soundbar has a built-in tweeter and a deep, powerful bass. The slim design makes it perfect for smaller living spaces like those apartment-living in the city. It rests easily on top of your TV stand or can be mounted to the wall, whichever you prefer. Ever complain about how audio is mixed these days? Do you ever find yourself constantly shifting the volume because the action is too loud but as soon as someone is speaking, it feels like a quiet whisper? Great news. This soundbar has a voice enhancement feature specifically designed to combat hushed dialogue. Keep the remote down and just focus on what you watching and hearing. The soundbar connects to your TV easily using HDMI ARC and then fills your room with spectacular sound thanks to the S-Force Pro Front Surround sound. This emulates cinema quality sound and makes it so you have a great listening experience no matter where you are sitting in relation to the soundbar. You can even connect to your phone or other devices to listen to music, podcasts, audiobooks, and more using either USB or Bluetooth. So if you’re ready to turn your back on the low-quality audio you TV’s built-in speakers are providing you, you can upgrade to the Sony compact 2.0 channel soundbar for the low price of $98 over at Amazon. That’s a 25% discount from its standard price of $130. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 40
            },
            "author": "Gizmodo Deals",
            "title": "In an Early Black Friday Deal, Amazon is Offering $1,200 Off on This Stunning LG 65″ C4 TV",
            "description": "That's a massive 45% discount on this LG OLED TV.",
            "url": "https://gizmodo.com/in-an-early-black-friday-deal-amazon-is-offering-1200-off-on-this-stunning-lg-65-c4-tv-2000519988",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/tv-lg-oled.jpg",
            "publishedAt": "2024-11-03T15:17:32Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Amazon is currently offering an incredible early Black Friday deal on LG’s OLED evo C4 Series 4K TVs which makes it an excellent opportunity for those looking to upgrade their home entertainment system. This deal features significant discounts across all screen sizes with prices matching those seen during Prime Day (except that you don’t have to be a Prime member here to secure the discount). The most notable offer is the 65-inch LG C4 OLED TV which is now available for just $1,496 down from its original price of $2,699. This represents a staggering $1,200 discount, or 45% off. See 65″ LG TV at Amazon See 65″ LG TV at Amazon What sets this deal apart is its accessibility: unlike many deals that are exclusive to Prime members, this offer is available to all customers. This means that anyone can take advantage of these substantial savings without needing a subscription. Given the high demand for LG’s OLED technology and the competitive pricing, these TVs are likely to sell out quickly even ahead of Black Friday. The entire C4 series lineup is seeing impressive price cuts as well. For example, the 48-inch model is priced at $996 down from $1,599, while the 55-inch version is now available for $1,296 instead of $1,999. Even the larger 75-inch model has dropped to $2,596 from $3,699. These prices rival and exceed what consumers typically expect during Black Friday sales events. The LG C4 series is renowned for its exceptional picture quality and features over 8 million self-lit pixels that provide stunning vibrant colors. For gamers, this TV offers a refresh rate of 144Hz and a response time of just 0.1ms to ensure a smooth gaming experience without screen tearing or stuttering. The inclusion of NVIDIA G-Sync and AMD FreeSync Premium compatibility allows for seamless gameplay across various gaming consoles. In addition to its impressive visual capabilities, the C4 series also excels in audio performance: with support for Dolby Vision and Dolby Atmos, you can enjoy a cinematic sound experience right in your living rooms. The Filmmaker Mode feature allows you to watch films as directors intended by preserving original aspect ratios and colors. This early Black Friday deal on the LG OLED evo C4 Series TVs is one of the best value propositions in the television market today. Whether you are a movie enthusiast seeking breathtaking visuals or a serious gamer looking for top-tier technology to elevate your gaming setup, this offer is hard to resist. See 65″ LG TV at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 41
            },
            "author": "Joe Tilleli",
            "title": "Rare Price for 8BitDo Mechanical Keyboard and Super Buttons, Lowest Price Ever for Last Prime Day of the Year",
            "description": "Save up to 32% on these retro-inspired mechanical keyboards designed after old gaming consoles from the early era of gaming.",
            "url": "https://gizmodo.com/rare-price-for-8bitdo-mechanical-keyboard-and-super-buttons-lowest-price-ever-for-last-prime-day-of-the-year-2000509811",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/8BitDoMechnanicalKeyboard.jpg",
            "publishedAt": "2024-10-09T16:26:34Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Prime Big Deals Days are here. If you totally forgot and already missed yesterday, don’t worry. You still have the rest of the day to save on some cool stuff all across Amazon as the sales event ends later tonight — October 9. For any PC gamers out there or just those nostalgic about the video games of yesteryear, 8BitDo is a gaming accessory manufacturer that bases its designs off retro hardware. Mostly known for controllers, the company also has a really sick set of mechanical keyboards that look right out of the late 80s, early 90s — and you can get yourself one for as low as $75. See at Amazon These are an 87 key design (sorry, no number pad!)The keyboards are compatible with Windows 10 and about as well as Android 9 and above, so you can even hook it up to play games on your phone. I can connect either wired, over 2.4G wireless, or via Bluetooth. One of the coolest little details are the knobs for volume and Bluetooth in the top left corner, which emulate how knobs like that looked and felt back in the day. The keys are programmable via the 8BitDo Ultimate Software V2 on PC. You can use it to assign buttons functionality to your liking or even set macros to complete specific tasks under varying scenarios. The keyboards even come with these big A and B buttons as well as a joystick. This is such an excellent way to emulate NES games (so long as you already own them *wink wink*) or retro-inspired games such as the newly released UFO 50 (which is awesome as heck and everyone should get it). There are four unique colorway — all retro-inspired. The faded gray with the dark keys and rainbow border surrounding the logo is meant to be reminiscent of the Commodore 64. The red and white is reminiscent of the original Famicom. Those in North America are probably more nostalgic about the red, black, and gray found on the Nintendo Entertainment System version. And lastly we have a light and dark gray styled after the original Macintosh computer. The big buttons and joystick also vary in color to match depending on which edition you select. All colors are part of the Prime Big Deals day sales event, but with varying levels of savings. The N Edition (NES-inspired) is sitting at $90. The M Edition (Macintosh-inspired) is down to $80. The Fami Edition (Famicom-inspired) has gone to $77. And finally the C64 Edition (Commodore 64-inspired) is the lowest at just $75 and amounts to a discount of 32% off. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 42
            },
            "author": "Gizmodo Deals",
            "title": "After Prime Day, Amazon is Giving You One Last Chance to Buy an iPad 9 at 40% Off",
            "description": "You dream of buying an iPad but don't want to break the bank?",
            "url": "https://gizmodo.com/after-prime-day-amazon-is-giving-you-one-last-chance-to-buy-an-ipad-9-at-40-off-2000511435",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/ipad-9th.jpg",
            "publishedAt": "2024-10-12T12:30:56Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     This Saturday, Amazon is offering a great deal on the 9th generation iPad (64GB, Wi-Fi model), slashing the price from $329 to just $199. This 40% discount marks the lowest price ever for this good Apple tablet and the record-low briefly seen during Prime Day sales earlier this week. But unlike Prime Day, this deal is available to everyone, not just Prime members. See at Amazon While not the latest model, the 9th generation iPad remains a highly capable device. It features a 10.2-inch Retina display that offers bright colors for all your viewing needs and it is powered by the A13 Bionic chip to ensures smooth performance for everyday tasks. With 64GB of storage, it provides ample space for apps, photos, videos and documents. One of the most significant upgrades from its predecessor is the 12MP Ultra Wide front camera which supports Center Stage. This feature automatically pans and zooms to keep subjects centered in the frame during video calls and makes it ideal for remote work or online learning. The iPad 9 is compatible with the first-generation Apple Pencil and enhances its usability for digital art and note-taking. Its Smart Connector allows for easy attachment of keyboards and boosts productivity for tasks like writing emails or working on documents. With up to 10 hours of battery life, the iPad 9 can easily last through a full day of use. Whether you’re streaming videos, browsing the web or working on projects, you won’t need to worry about frequent charging. It’s perfectly suitable for students, professionals and casual users alike; it can serve as an e-reader, a portable entertainment device, a digital canvas or even a secondary display for your Mac. This deal presents an rare and great opportunity for anyone in need of a reliable tablet to enter or upgrade within the Apple ecosystem at a fraction of the usual cost (40% is insane!). Deals of this magnitude on Apple products are exceedingly rare; Apple is known for maintaining strict control over its pricing and rarely offers discounts in its own stores. At $199, this iPad offers incredible value and versatility. If you’ve been considering an iPad purchase, now is the time to act. This deal is likely part of Amazon’s efforts to clear out inventory after Prime Day and is not expected to last long (it should expire latest on Sunday). Once this weekend passes, it’s unlikely we’ll see prices this low again until Black Friday. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 43
            },
            "author": "Gizmodo Deals",
            "title": "This 15-Inch Screen is Portable Enough to Take Anywhere, And it’s Sold on Amazon For $59",
            "description": "Amazon is offering the Arzopa 15.6\" portable monitor at an incredible price of $59, down from $129, just in time for Prime Day.",
            "url": "https://gizmodo.com/this-15-inch-screen-is-portable-enough-to-take-anywhere-and-its-sold-on-amazon-for-59-2000508909",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/portable-monitor-15-inch.jpg",
            "publishedAt": "2024-10-08T11:35:35Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     The Arzopa 15.6″ portable monitor has just become an irresistible bargain as Amazon’s Prime Day kicks off. This versatile device which serves as the perfect companion for professionals, gamers and multitaskers has seen significant price fluctuations in recent days. Yesterday, it was priced at $84, but today, on the first day of Prime Day, it has plummeted to an astonishing $59. It belongs to our Top 10 deals for Tuesday. See at Amazon At this price point, the 15-inch portable monitor is expected to fly off the virtual shelves: the dramatic price drop from its original $129 makes it an absolute steal especially considering it comes with a smart cover included. This deal is part of Amazon’s Prime Day offerings and it’s available to all customers, regardless of Prime membership status. This monitor is a great monitor you can take everywhere with you: it’s a 15.6-inch Full HD IPS display delivering crisp 1080P resolution and vibrant colors to enjoy movies and games. With HDR technology and an anti-glare coating, it ensures comfortable viewing even during extended use. The 60Hz refresh rate provides smooth visuals and it’s not always the case on this kind of products. Weighing a mere 1.7 pounds and measuring just 0.3 inches in thickness, this 15-inch monitor is designed with mobility in mind. It easily slips into a laptop bag or backpack, ready to transform any space into a productive workstation or entertainment hub. The included smart cover not only protects the screen during transport but also doubles as a convenient stand. What’s more, this monitor is its plug-and-play: a single USB-C cable is all you need to connect it to a wide range of devices including laptops (both Mac and PC), smartphones and gaming consoles like Xbox and PlayStation. It makes it an ideal companion for various scenarios – whether as a second screen for your workstation, a portable display for your Nintendo Switch during travel or an extended screen for your smartphone. Given the current low price and the monitor’s impressive features, it’s no surprise that demand will surge. If you’re considering enhancing your productivity or elevating your gaming experience with this portable monitor, now is the time to act. Amazon’s standard 30-day return policy applies and allows you to test the monitor risk-free and determine if it fits seamlessly into your digital lifestyle. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 44
            },
            "author": "Gizmodo Deals",
            "title": "iPad 9: Amazon Slashes Price Again, Now 5x Cheaper Than iPad Pro for Prime Day",
            "description": "Amazon is slashing prices across all Apple products for Prime Day.",
            "url": "https://gizmodo.com/ipad-9-amazon-slashes-price-again-now-5x-cheaper-than-ipad-pro-for-prime-day-2000507980",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/ipad-9th.jpg",
            "publishedAt": "2024-10-06T16:31:25Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     This Saturday, Amazon is offering a great deal on the 9th generation iPad (64GB, Wi-Fi model), slashing the price from $329 to just $199. This 40% discount marks the lowest price ever for this good Apple tablet and the record-low briefly seen during Prime Day sales earlier this week. But unlike Prime Day, this deal is available to everyone, not just Prime members. See at Amazon While not the latest model, the 9th generation iPad remains a highly capable device. It features a 10.2-inch Retina display that offers bright colors for all your viewing needs and it is powered by the A13 Bionic chip to ensures smooth performance for everyday tasks. With 64GB of storage, it provides ample space for apps, photos, videos and documents. One of the most significant upgrades from its predecessor is the 12MP Ultra Wide front camera which supports Center Stage. This feature automatically pans and zooms to keep subjects centered in the frame during video calls and makes it ideal for remote work or online learning. The iPad 9 is compatible with the first-generation Apple Pencil and enhances its usability for digital art and note-taking. Its Smart Connector allows for easy attachment of keyboards and boosts productivity for tasks like writing emails or working on documents. With up to 10 hours of battery life, the iPad 9 can easily last through a full day of use. Whether you’re streaming videos, browsing the web or working on projects, you won’t need to worry about frequent charging. It’s perfectly suitable for students, professionals and casual users alike; it can serve as an e-reader, a portable entertainment device, a digital canvas or even a secondary display for your Mac. This deal presents an rare and great opportunity for anyone in need of a reliable tablet to enter or upgrade within the Apple ecosystem at a fraction of the usual cost (40% is insane!). Deals of this magnitude on Apple products are exceedingly rare; Apple is known for maintaining strict control over its pricing and rarely offers discounts in its own stores. At $199, this iPad offers incredible value and versatility. If you’ve been considering an iPad purchase, now is the time to act. This deal is likely part of Amazon’s efforts to clear out inventory after Prime Day and is not expected to last long (it should expire latest on Sunday). Once this weekend passes, it’s unlikely we’ll see prices this low again until Black Friday. See at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 45
            },
            "author": "Gordon Jackson",
            "title": "Disney May Have Found an Incredibly Obvious Choice for Its Live-Action Prince Charming",
            "description": "It's Chris Hemsworth, of course.",
            "url": "https://gizmodo.com/disney-may-have-found-an-incredibly-obvious-choice-for-its-live-action-prince-charming-2000515673",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Chris.jpg",
            "publishedAt": "2024-10-23T18:10:07Z",
            "content": "Deadline reports Chris Hemsworth is in talks to star in Prince Charming, a new project at Disney from Paddington and Wonka director Paul King. Prince Charming is based on a script co-written by King with Simon Farnaby and Jon Croker; the exact nature and details of the story are currently under wraps, but unless it reveals itself to be a simple rom-com utilizing the name like The Perfect Man or The Idea of You, the story likely concerns some variation of the stock character seen in Snow White, Sleeping Beauty, Rapunzel, and other Disney fairy tales. As the outlet notes, “insiders do add that the film will not specifically be linked to Cinderella,” and so will likely not be a retelling of the Disney movie from the perspective of its royal shoe-obsessed love interest.   Entertainment insider Jeff Sneider broke news of the project and Hemsworth’s involvement in his newsletter last week, so the Deadline report is further confirmation that this movie is real and moving forward. Which begs the question: if it’s not specifically about Cinderella’s himbo, what’s it about? And why is Disney interested? Perhaps Prince Charming really will be some sort of essay on the stock character, in a similar vein to Greta Gerwig’s Barbie, with Hemsworth as some sort of bumbling incarnation of the trope—similar to Ryan Gosling’s evergreen portrayal of Ken. Perhaps it’ll be a sort of modern retelling of The Stepford Husbands, the 1996 made-for-TV sequel to The Stepford Wives with Mr. Hemsworth standing in for Michael Ontkean. How are ideal storybook men made, and for what purpose? Will Hemsworth’s Charming become self-aware and lead a revolution of his colleagues as they question why they’re cursed to play second fiddle to their princess counterparts? We’ll find out soon enough. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nChris HemsworthdisneyFantasyPaul KingPrince Charming  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Westeros on the big screen? A new report says Warner Bros. might make it happen.\n         \n          The former Disney employee is accused of committing a variety of computer crimes.\n         \nLove Hurts is coming next year, but now the Oscar-winning Indiana Jones star has a Christmas action movie too.\n         \n          The adaptation of the hit Broadway musical starring Cynthia Erivo and Ariana Grande opens November 22.\n         \n          Thankfully, the new Lord of the Rings movie will see Christopher Lee posthumously return to his beloved role *without* the terrible powers of AI.\n         \n          Embattled creator Neil Gaiman has officially departed the Amazon Prime Video fantasy series starring Michael Sheen and David Tennant.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 46
            },
            "author": "Gizmodo Deals",
            "title": "At -45% on Amazon Prime Day, This LG C4 Series TV Will Sell Like Hotcakes",
            "description": "Amazon surprises us with this unprecedented offer.",
            "url": "https://gizmodo.com/at-45-on-amazon-prime-day-this-lg-c4-series-tv-will-sell-like-hotcakes-2000508799",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/tv-lg-oled.jpg",
            "publishedAt": "2024-10-08T12:10:27Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Today is the first day of Prime Day at Amazon, and you can enjoy a stunning deal on LG’s OLED evo C4 Series 4K TVs. The current deal offers a massive discount across multiple screen sizes and what’s exciting is that it’s accessible to all customers, not just Prime members. With this level of accessibility, these TVs are likely to sell out at lightning speed, so quick make sure you snag this deal before it runs out of stock. The star of the Prime Day show is undoubtedly the 65-inch LG C4 OLED TV which is now priced at a jaw-dropping $1,496 down from its original $2,699. This whopping $1,200 discount is a massive 45% discount and makes it one of the most compelling offers of this Prime Day event. But the deals don’t stop there – the entire C4 series lineup is seeing significant price cuts. See 65″ LG TV at Amazon See 65″ LG TV at Amazon These prices rival and in some cases surpass the best deals typically seen during Black Friday and offer consumers a rare opportunity to make substantial savings on top-tier TV technology. Remember LG is one of the best players for OLED technology and this C4 model features over 8 million self-lit pixels that deliver an unparalleled viewing experience. For gaming enthusiasts, the C4 series is nothing else than a dream come true. This LG OLED TV boasts a 144Hz refresh rate and a lightning-fast 0.1ms response time that guarantees ultra-smooth gameplay free from screen tearing and stuttering. The inclusion of the powerful NVIDIA G-Sync and AMD FreeSync Premium compatibility ensures that gamers can enjoy their favorite titles without interruptions. With four HDMI 2.1 inputs available, connecting multiple gaming consoles is a breeze. The audio capabilities of the C4 series are equally impressive: support for Dolby Vision and Dolby Atmos brings a cinematic sound experience right into your living room. The Filmmaker Mode is another standout feature from this LG OLED TV available at Prime Day and allows users to watch films exactly as directors intended by preserving original aspect ratios, colors and frame rates. Given the current massive discounts and the impressive feature set of the C4 series, this Prime Day deal is probably the best value propositions in the TV market today. Whether you’re a movie enthusiast looking for stunning visuals, a serious gamer or simply in the market for a premium TV to elevate your home entertainment system, the LG OLED evo C4 Series (at this price) is a no-brainer. It’s worth noting that deals of this magnitude on such high-quality TVs are rare outside of major shopping events. With prices matching or beating typical Black Friday offers, this Prime Day is a great chance to upgrade your viewing experience without waiting for the holiday season. However, as with all Prime Day deals, especially those open to all shoppers, stock is likely to deplete rapidly. The combination of record-low prices, top-tier technology and universal accessibility means these TVs could sell out in record time. If you’ve been considering upgrading your TV or entering the world of OLED technology, now is the time to act. See 65″ LG TV at Amazon See 55″ LG TV at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 47
            },
            "author": "Isaiah Colbert",
            "title": "Yeah, Mattel Really Is Trying to Make a View-Master Movie",
            "description": "\"Seeing will be believing in a theater near you!\" - Some Mattel marketing exec (probably).",
            "url": "https://gizmodo.com/yeah-mattel-really-is-trying-to-make-a-view-master-movie-2000512774",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Mattel-view-master-movie.jpg",
            "publishedAt": "2024-10-16T20:56:53Z",
            "content": "It’s no secret that Mattel laughed all the way to the bank last year thanks to the humongous box office success of director Greta Gerwig and actor Margot Robbie’s Barbie movie. While some of its success could be credited to the cinematic phenomenon known as Barbenheimer, Mattel—like any self-respecting company that sees no ceiling to the potential financial success of repeating a past idea—was soon back at work trying to decide which toy to turn into a movie next. Lo and behold, the bigwigs have finally arrived at their answer: the View-Master. No, we’re not kidding. According to Variety, Mattel is officially working on a live-action film about its 1940s-era 3D stereoscopic toy in collaboration with Sony Pictures and Escape Artists (the folks behind The Equalizer 3 and Mattel’s long-delayed live-action Masters of the Universe Amazon film). This next sentence would typically be the place were we’d write about noteworthy directors, writers, and actors tasked with breathing life into this expensive advertisement of a film, but there’s are none as of time of publication. It’s just View-Master. Same as it ever was. Be that as it may, the View-Master movie’s current lack of enticing names attached to it hasn’t hampered Mattel Films president Robbie Brenner and Escape Artist producer Todd Black’s excitement. “View-Master has inspired generations to embark on boundless adventures, offering a treasure trove of storytelling possibilities for this film,” Brenner said. “We’re thrilled to work with Sony Pictures Entertainment and Escape Artists’ Todd Black to bring this Mattel franchise to life. Their creative and filmmaking expertise sets the stage to introduce a modern take on this beloved toy to audiences everywhere.” “View-Master has long been a window to the wonders of the world, sparking imagination in kids and adults alike,” Black echoed. “Teaming up with Robbie Brenner and Mattel Films gives us the chance to honor that legacy while creating an entirely new adventure for today’s audience. We can’t wait to bring this treasured toy’s sense of exploration to the big screen.” While the View-Master movie isn’t the most enticing title to announce ahead of New York Comic Con, Mattel does have other projects down the pipeline that are more exciting and have names attached to them. Key among them include a Hot Wheels movie with director J.J. Abrams attached; a live-action Barney movie starring Nope and Get Out‘s Daniel Kaluuya; a Rock ‘Em Sock ‘Em Robots movie with Vin Diesel; and an Uno-inspired “action heist movie” involving rapper Lil Yachty. For Mattel’s sake, here’s hoping any combination of these disparate projects bring in beaucoup bucks like Barbie did. Who do you think should star in the View-Master movie? Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nMattelView-Master  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          There's no Dark Knight to be found here, just Gotham's greatest love story: Harley Quinn and Poison Ivy.\n         \n          San Diego Comic-Con is nearly here—and here's some of our favorites of the awesome exclusive collectibles and merchandise you can get on the show floor.\n         \n          These include Uno, Dos, Blokus, Phase 10, Skip-Bo, and Ker Plunk.\n         \n          The late, great musician's Margaritaville dino escape cameo is immortalized down to his lost shaker of salt.\n         \n          The animation studio plans to tackle Clarke's 2020 fantasy novel, it'll just probably be a minute before we see what it looks like.\n         \n          Get those carts and store pick-ups ready: Father's Day is June 16.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 48
            },
            "author": "Mike Fazioli",
            "title": "The Latest Fire HD Tablet Has Never Been Priced Lower Than It Is Right Now, Up to 53% Off for Prime Day Eve",
            "description": "Amazon's top-rated full-HD tablet is a Prime Day Eve steal at just $75.",
            "url": "https://gizmodo.com/the-latest-fire-hd-tablet-has-never-been-priced-lower-than-it-is-right-now-up-to-53-off-for-prime-day-eve-2000508338",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Amazon-Fire-Tablet-10.jpg",
            "publishedAt": "2024-10-07T17:27:26Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     It looks like Prime Day Eve is shaping up to be a blowout sales event for Amazon’s best devices, like the Fire HD 10 tablet. Rather than simply slap on a decent-sized discount, Amazon’s gone all the way and dropped the price of the Fire 10 HD tablet to $75 — the lowest price ever for this great tablet. If you have an Amazon device to trade in, you can knock that price down even lower, by as much as 20%. This is the latest and best model of the Fire tablet, rocking a 10.1-inch Full HD screen, a super-fast octa-core processor that moves 25% faster than the previous model of the Fire tablet, and 3GB of RAM. The 46%-off deal happening right now at Amazon is the biggest and best sale ever for the Fire HD 10 tablet. See 32GB at Amazon See 64GB at Amazon Prime Video and Kindle books are obvious fits for the Fire HD 10 tablet — syncing across Amazon devices is completely seamless. Don’t forget Amazon Music and Audible for music and podcasts, which you can also enjoy on the Fire HD 10 tablet. And because it’s an Amazon device, the Fire HD 10 has Alexa built in so you can control the tablet with voice commands and even control your connected smart home devices with the Fire HD 10. But the Fire HD 10 works just as well with other streaming services like Netflix and Hulu, so the selection of movies and TV shows you can enjoy on the 10.1-inch Full HD display with crisp 1920 x 1200 resolution is virtually limitless. Amazon is also making sure the Fire HD 10 actually improves with time — upcoming new features include Writing Assist to proofread your emails and notes, Webpage Summaries on the Silk browser, and an AI-powered Wallpaper Creator that comes up with awesome images based on your prompts. The sleek Fire HD 10 weighs just under 10 ounces for grab-and-go portability, and the rechargeable battery of the Fire HD 10 can go for up to 13 hours on a single charge, so you can be entertained on even the longest road trips or plane flights. When it does need more juice, the Fire HD 10 recharges quickly and easily with a USB-C 2.0 connection. You can make the Fire HD 10 tablet even more powerful and versatile than when you first unbox it. The Amazon Keyboard Case and Amazon Stylus Pen are perfect complementary devices for the Fire HD 10 tablet, and there’s a micro-SD slot for added storage of up to 1 TB. The front- and rear-facing 5MP cameras for capturing your own images and videos are already built in. This amazing up-to-date Amazon tablet has never been available at a lower price than now. It’s just $75 for 32GB and $85 for 64GB — and you can drop that price even lower if you have an Amazon device to trade in. Head to Amazon now before this pre-Prime Day 53%-off sale disappears. See 32GB at Amazon See 64GB at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 49
            },
            "author": "Gizmodo Deals",
            "title": "A Galaxy S24 Ultra For Nearly Free? Samsung is Offering 60% Off on Its Official Website For Prime Day",
            "description": "Samsung is very generous for Prime Day on all its new smartphone models.",
            "url": "https://gizmodo.com/a-galaxy-s24-ultra-for-nearly-free-samsung-is-offering-60-off-on-its-official-website-for-prime-day-2000508711",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/galaxy-s24-ultra-1.jpg",
            "publishedAt": "2024-10-08T10:45:00Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Samsung is making waves with an exclusive offer on its flagship smartphone – the Galaxy S24 Ultra – which is available only through the official Samsung website. This limited-time deal is a great opportunity to acquire one of the most advanced Android smartphones on the market at a massively reduced price. The promotion offers two enticing options for potential buyers. The first is a straightforward discount of $250 to $300 off the retail price, applicable to all models and storage capacities of the Galaxy S24 Ultra. This reduction makes the cutting-edge device more accessible to those who’ve been eyeing it but were hesitant due to its premium price tag. See Galaxy S24 Ultra at Samsung.com However, the real showstopper is the trade-in option which can slash the price by more than half for eligible customers. For instance, the 256GB Galaxy S24 Ultra, typically priced at $1,299 can be yours for an astonishing $549 when you trade in a qualifying smartphone. The exact trade-in value varies depending on the model and condition of your old device but the potential savings are substantial. For those not looking to part with their current phone, the $250 instant discount still represents a considerable saving on this top-of-the-line device. Additionally, Samsung is sweetening the deal with 1.5% cashback in Samsung Rewards which provides even more value for your purchase. The Galaxy S24 Ultra itself is a piece of technology: boasting a large and vibrant display, it offers an immersive visual experience that’s perfect for both productivity and entertainment. The device’s advanced camera system features multiple lenses and cutting-edge AI enhancements so that every photo and video you capture is of the highest quality. Under the hood, the S24 Ultra packs a powerful Qualcomm Snapdragon 8 Gen 3 processor that handles even the most demanding applications with ease. Its 5G capabilities ensure you’re always connected at the fastest speeds available while the long-lasting battery keeps you powered throughout the day and beyond. One of the very popular features of the S24 Ultra is its integration of AI technology: from intelligent photo editing to real-time language translation, the AI capabilities of this device set it apart from its competitors. The included S Pen stylus adds another dimension to the user experience and allows for precise input and creative expression. Keep in mind that this deal is exclusively available as part of Prime Day and can only be found on Samsung’s official website. The limited-time nature of this offer adds urgency for those considering an upgrade to their mobile device. Whether opting for the trade-in deal or the instant discount, you should act quickly to take advantage of this Prime Day promotion from Samsung. See Galaxy S24 Ultra at Samsung.com \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 50
            },
            "author": "Gizmodo Deals",
            "title": "Amazon’s Black Friday Comes Early: 45% Off Most Fire TV Sticks With 4K included",
            "description": "Transform your TV into a streaming powerhouse.",
            "url": "https://gizmodo.com/amazons-black-friday-comes-early-45-off-most-fire-tv-sticks-with-4k-included-2000519806",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/amazon-fire-tv-stick.jpg",
            "publishedAt": "2024-11-02T12:25:34Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Amazon is currently offering massive discounts on its popular Fire TV Stick lineup and matches the deals seen during last year’s Black Friday and Prime Day events. These streaming devices have become a staple in many households and offer a convenient way to transform any TV into a smart entertainment hub. The Fire TV Stick family consists of three main models: the Fire TV Stick HD, the Fire TV Stick 4K, and the Fire TV Stick 4K Max. Each device caters to different needs and budgets, but all share the core functionality of bringing streaming services, apps, and Alexa voice control to your television. Starting with the most affordable option, the latest Fire TV Stick HD (launched in October) is now available for just $19 down from its regular price of $34, which is a massive 43% discount. This model is perfect for those with HD TVs or who don’t require 4K resolution. It offers smooth streaming of popular services like Netflix, Prime Video, Disney+, and Hulu in 1080p Full HD. The device comes with an Alexa Voice Remote. See Fire TV Stick HD For those looking to future-proof their setup or who already own 4K TVs, the Fire TV Stick 4K is an excellent choice. Currently priced at $27, down from $49, this 44% discount makes it an incredibly attractive option. The 4K model supports Ultra HD streaming, HDR, HDR10+ and Dolby Vision, providing a superior viewing experience with compatible content and displays. It also offers improved performance over the HD model with faster app launches and more fluid navigation. See Fire TV Stick 4K At the top of the range is the Fire TV Stick 4K Max which is now available for $39 reduced from its original price of $59. This premium model is designed for those who demand the best streaming experience. It boasts the most powerful processor in the Fire TV Stick lineup which results in even faster app starts and more responsive navigation. The 4K Max also supports Wi-Fi 6, ensuring smoother streaming in homes with multiple Wi-Fi-connected devices. Like its 4K counterpart, it supports all major HDR formats and Dolby Atmos for immersive audio. See Fire TV Stick 4K Max All Fire TV Stick models offer access to thousands of channels, apps, and Alexa skills. They’re incredibly easy to set up: simply plug the device into your TV’s HDMI port, connect to Wi-Fi and you’re ready to start streaming. The included Alexa Voice Remote works across all models and allows for easy content discovery and control of compatible smart home devices. One of the key advantages of the Fire TV Stick ecosystem is its integration with Amazon’s broader services. Prime members can enjoy seamless access to Prime Video content, while the interface prominently features Amazon’s channels and rental services. However, the platform remains open, hosting apps from competing services like Netflix, Hulu, and Disney+. For cord-cutters or those looking to enhance their TV viewing experience, these early Black Friday deals on Fire TV Sticks are an excellent opportunity. Whether you’re upgrading an older TV in a guest room with the HD model, enhancing your main living room TV with the 4K version or opting for the top-of-the-line 4K Max for the ultimate streaming experience, there’s a Fire TV Stick to suit every need and budget. See Fire TV Stick 4K \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 51
            },
            "author": "Kyle Barr",
            "title": "Microsoft Is One Step Closer to Opening an Actual Xbox App Store on Android",
            "description": "Xbox is currently one of the few companies that doesn't let you buy games on its app, but the recent Epic v. Google decision is giving its plans for a mobile store a shot in the arm.",
            "url": "https://gizmodo.com/microsoft-is-one-step-closer-to-opening-an-actual-xbox-app-store-on-android-2000510988",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Samsung-Galaxy-S24-Xbox-App.jpg",
            "publishedAt": "2024-10-11T14:45:59Z",
            "content": "After Epic Games, Xbox plans to be the next big app seller to break free of Google’s shackles. Microsoft’s gaming arm announced on Twitter that it would allow Android users to purchase games for their Xbox account through the Android Xbox app. Sure, you’re still unable to play your favorite Game Pass games on mobile unless you’re streaming, but it could prove to be Microsoft’s first step into opening its own true app store on Android phones. In a Twitter post, Xbox President Sarah Bond said that players can purchase Xbox games through the Xbox App starting sometime in November. She explicitly referred to California federal Judge James Donato’s recent ruling in the Epic v. Google legal battle that “open[ed] up Google’s mobile store in the U.S.” “Our mission is to allow more players to play on more devices,” she said, adding, “Starting in November, Players will be able to play and purchase Xbox Games” from the Xbox app. That may be a vague promise for now, but we know that the company’s long had dreams of operating its own mobile app store. Microsoft’s $69 billion acquisition of Activision Blizzard also gave Xbox access to King Digital Entertainment titles, home of the still-popular Candy Crush Saga. The court's ruling to open up Google´s mobile store in the US will allow more choice and flexibility. Our mission is to allow more players to play on more devices so we are thrilled to share that starting in November, players will be able to play and purchase Xbox games directly… — BondSarahBond (@BondSarah_Bond) October 10, 2024  According to a statement to The Verge in August, the company was working on a browser-based mobile store that was “progressing” as late as August. It’s unclear if Microsoft plans to scrap the store in exchange for its revitalized app. Currently, you have to go through the company’s web store page to purchase games or a Game Pass subscription. The Xbox app on Android doesn’t let you download or play any games you own through Game Pass or otherwise, but you can still access Game Pass Ultimate’s game streaming. Currently, fellow game shops, such as Steam and PlayStation Store, allow users to buy games directly through their mobile apps, and neither app requires users to go through Play Store billing. On Monday, Donato’s final ruling in Epic v. Google that the Mountain View tech giant could no longer force third-party app stores to use Google Play Billing. Google has already appealed the decision, and it is asking the court for a pause on the requested changes to Android’s ecosystem while that appeal is ongoing. Otherwise, Google has until Nov. 3 to make the necessary changes to Play Store and Android. Late last year, a jury already declared Google’s Play Store an illegal monopoly, setting up the dominos for what could become the biggest shakeup in the search giant’s software empire. The court restricted Google from putting up any roadblocks or throwing money at competing third-party app stores for the next three years. With part of Google’s business officially declared a monopoly, the feds are already imagining ways to break the Search giant into smaller, more manageable pieces. The Department of Justice proposed a plan on Tuesday that would end Google Search dominance on Android, essentially splitting off Google’s Chrome and Android businesses. In response, Google said the proposal would hurt user privacy if they’re forced to share search queries, clicks, and results with competitors. That’s ignoring how it already concerns Google, which has all that data in the first place. \nEpic GamesGoogleGoogle PlayMicrosoftXbox  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          One person can win the million dollar jackpot and ten additional winners will receive $10,000 for just using Bing.\n         \n          Thousand of Dublin residents were misled by an AI chum website promoting events that aren't real.\n         \n          The new features promise to allow users to use the chatbot more like a search engine.\n         \n          It'll also (finally) inform you about lane merges in advance when you're out driving on the highway.\n         \n          The handmade Xbox handheld includes the console’s original motherboard, and soon it may even connect to Xbox Live.\n         \n          What is the best place to grab a steak in London?\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 52
            },
            "author": "Lucas Ropek",
            "title": "Netflix’s New Plan Is to Make Movies That Suck Less",
            "description": "The streaming platform is looking to make fewer movies that are higher quality, a radical strategy borne from disruption.",
            "url": "https://gizmodo.com/netflixs-new-plan-is-to-make-movies-that-suck-less-2000514553",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/The-Netflix-building-in-Los-Angeles.jpg",
            "publishedAt": "2024-10-21T20:35:25Z",
            "content": "On the whole, Netflix’s movies are not very good. Sure, it has released a number of films by prestige filmmakers over the years (flicks by Martin Scorsese, David Fincher, the Coen brothers and Richard Linklater all spring to mind) but, when it comes to the platform’s median viewing experience, those movies tend to be outliers. More often than not, the movies that the streaming juggernaut produces are low-budget, poorly written, barely entertaining pieces of crap that function better as ambient background noise for household chores than engrossing cinematic experiences you actually want to watch. However, according to a new report from Bloomberg, the streaming platform has a new plan to turn all that around. The new strategy is this: make fewer movies so that the ones that do get made aren’t shitty. Dan Lin, Netflix’s film chairman, is trying to ditch the platform’s content mill model, and plans to cut the streamer’s annual output down to 25 to 30 movies per year (the company’s current output is around 50 flicks a year). The streaming service still plans to release what it calls a “tentpole” (read: big budget) feature once every quarter, though, overall, the goal is to bring “costs under control” at the company. Bloomberg writes that, to execute this vision, Lin has “restructured Netflix’s film division,” cutting some staff positions while refocusing others. Under this new system, individual executives are now in charge of certain genres, allowing for tighter focus on particular types of content: “Ori Marmur oversees action and sci-fi, while Niija Kuykendall handles faith-based projects, as well as holiday and young-adult fare. Kira Goldberg handles dramas and thrillers. Lin also hired a couple of veteran studio executives in Doug Belgrad and Hannah Minghella, both formerly of Sony, to help run the show.” This is certainly a change. Previous to Lin, Netflix’s film division was run by an executive named Scott Stuber who, as Variety puts it, had one clear mandate: “quantity, not quality.” In the six years that Stuber ran Netflix’s film strategy, the streamer pumped out a veritable tsunami of movies, some of which were good but many of which were deeply, deeply terrible. Stuber left Netflix in March to pursue a career in film producing, clearing the way for Lin to take the reins and begin pivoting the company’s overall content strategy. Does this mean that Netflix will stop greenlighting stuff like Tall Girl 2 and Hubie Halloween and begin producing fare that better resembles the Hollywood hits of yesteryear? It’s unclear. I’d personally prefer it if Netflix didn’t exist at all, as that would allow all the attention, investment, and talent currently being hoarded by the streamer to be channeled back into the traditional film industry. That said, as long as Netflix does exist and continues to dominate the entertainment industry, it sure would be great if the majority of the movies that it produced were watchable instead of unwatchable. \nNetflix  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          For fans eager for more Scavengers Reign, we have good news and bad news...\n         \n          The company also recently shuttered a studio developing a AAA multiplatform game.\n         \n          Turns out Japanese rap duo Creepy Nuts didn't have any Pikmin in the booth for \"Otonoke.\"\n         \n          The game is far from over for Seong Gi-hun in Squid Game Season 2.\n         \n          Powerhouse Animation's David Howe, Samuel Deats, and Adam Deats reveal what's going under the hood of your favorite animated shows.\n         \n          David Fincher now has his tentacles on the popular Netflix franchise.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 53
            },
            "author": "Gizmodo Deals",
            "title": "Prime Day: Amazon Crushes The Price Of LG OLED C4 TVs By 40% But Can’t Officially Display It",
            "description": "Due to an agreement with the manufacturer, Amazon is not allowed to officially display such low prices.",
            "url": "https://gizmodo.com/prime-day-amazon-crushes-the-price-of-lg-oled-c4-tvs-by-40-but-cant-officially-display-it-2000508034",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/tv-lg-oled.jpg",
            "publishedAt": "2024-10-06T20:39:42Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     Today is the first day of Prime Day at Amazon, and you can enjoy a stunning deal on LG’s OLED evo C4 Series 4K TVs. The current deal offers a massive discount across multiple screen sizes and what’s exciting is that it’s accessible to all customers, not just Prime members. With this level of accessibility, these TVs are likely to sell out at lightning speed, so quick make sure you snag this deal before it runs out of stock. The star of the Prime Day show is undoubtedly the 65-inch LG C4 OLED TV which is now priced at a jaw-dropping $1,496 down from its original $2,699. This whopping $1,200 discount is a massive 45% discount and makes it one of the most compelling offers of this Prime Day event. But the deals don’t stop there – the entire C4 series lineup is seeing significant price cuts. See 65″ LG TV at Amazon See 65″ LG TV at Amazon These prices rival and in some cases surpass the best deals typically seen during Black Friday and offer consumers a rare opportunity to make substantial savings on top-tier TV technology. Remember LG is one of the best players for OLED technology and this C4 model features over 8 million self-lit pixels that deliver an unparalleled viewing experience. For gaming enthusiasts, the C4 series is nothing else than a dream come true. This LG OLED TV boasts a 144Hz refresh rate and a lightning-fast 0.1ms response time that guarantees ultra-smooth gameplay free from screen tearing and stuttering. The inclusion of the powerful NVIDIA G-Sync and AMD FreeSync Premium compatibility ensures that gamers can enjoy their favorite titles without interruptions. With four HDMI 2.1 inputs available, connecting multiple gaming consoles is a breeze. The audio capabilities of the C4 series are equally impressive: support for Dolby Vision and Dolby Atmos brings a cinematic sound experience right into your living room. The Filmmaker Mode is another standout feature from this LG OLED TV available at Prime Day and allows users to watch films exactly as directors intended by preserving original aspect ratios, colors and frame rates. Given the current massive discounts and the impressive feature set of the C4 series, this Prime Day deal is probably the best value propositions in the TV market today. Whether you’re a movie enthusiast looking for stunning visuals, a serious gamer or simply in the market for a premium TV to elevate your home entertainment system, the LG OLED evo C4 Series (at this price) is a no-brainer. It’s worth noting that deals of this magnitude on such high-quality TVs are rare outside of major shopping events. With prices matching or beating typical Black Friday offers, this Prime Day is a great chance to upgrade your viewing experience without waiting for the holiday season. However, as with all Prime Day deals, especially those open to all shoppers, stock is likely to deplete rapidly. The combination of record-low prices, top-tier technology and universal accessibility means these TVs could sell out in record time. If you’ve been considering upgrading your TV or entering the world of OLED technology, now is the time to act. See 65″ LG TV at Amazon See 55″ LG TV at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 54
            },
            "author": "Gizmodo Deals",
            "title": "To Help You Save This Black Friday, Costco is Offering Its Gold Membership For $20",
            "description": "The Costco Gold Star membership will cost you just $20 after factoring in the $45 digital gift card.",
            "url": "https://gizmodo.com/to-help-you-save-this-black-friday-costco-is-offering-its-gold-membership-for-20-2000519432",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/11/costco-wholesale.jpg",
            "publishedAt": "2024-11-02T13:40:07Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     As the holiday season approaches, savvy shoppers are already strategizing how to make the most of their Black Friday budgets. This year, there’s an opportunity to get ahead of the game and set yourself up for significant savings with a Costco Gold Star membership: StackSocial is currently offering a deal that’s hard to resist: a one-year Costco Gold Star membership for just $65, sweetened with a $45 digital gift card. It’s like getting your membership for a mere $20. See at StackSocial This offer is a substantial upgrade from StackSocial’s summer promotion which only included a $20 gift card. The current deal more than doubles that bonus and gives you $45 to spend on anything from Costco’s vast inventory – perhaps even 30 of their famous $1.50 hot dogs, a price point that’s become legendary for its immutability. A Costco Gold Star membership is your key to unlocking savings at over 600 locations across the United States and more than 900 worldwide. This card grants you access to Costco’s treasure trove of deals including their business centers, travel services, gas stations, hearing aid centers, optical departments, pharmacies and their extensive online store. The membership extends its benefits to your household and allows you to share the savings with family members. For those looking to maximize their Costco experience, the Executive membership is available at $130 on StackSocial and offers additional perks and greater discounts on select Costco services. Executive members enjoy benefits like lower prices on check printing and complimentary roadside assistance through the auto insurance program. Perhaps most enticing is the annual 2% reward on qualified Costco purchases up to $1,250. Both membership tiers come with the $45 digital Costco shop card which will be emailed within two weeks of successful redemption. This digital credit isn’t restricted to a single use and you’ll be able to spread your savings across multiple purchases. It’s important to note that this offer is exclusive to new members or those whose memberships have lapsed for more than 18 months. With access to Costco’s competitive pricing on everything from electronics to groceries, members are poised to make substantial savings during the biggest shopping event of the year. The warehouse giant is known for its Black Friday deals often beating out competitors like Amazon or Walmart on popular items like TVs, laptops, and home appliances. Moreover, Costco’s year-round low prices mean that even outside of major sales events, members can consistently save on everyday purchases. From bulk groceries to discounted gift cards for restaurants and entertainment, the potential for savings extends far beyond the holiday season. For those concerned about the upfront cost, it’s worth considering the long-term savings potential. Regular Costco shoppers often find that their membership pays for itself through accumulated savings over the year. With the added $45 gift card in this offer, the break-even point comes even sooner. See at StackSocial \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 55
            },
            "author": "Gizmodo Deals",
            "title": "Prime Day: Here Are 17 Offers Up to 80% Off for This Sunday on Amazon",
            "description": "Almost all Prime Day offers are still available this Sunday. Here’s a list of the deals you shouldn’t miss, which will expire tonight.",
            "url": "https://gizmodo.com/prime-day-here-are-17-offers-up-to-80-off-for-this-sunday-on-amazon-2000511560",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/primeday-amazon-2024.jpg",
            "publishedAt": "2024-10-13T10:13:23Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     A week after the official conclusion of Amazon’s Prime Day event, the e-commerce giant seems reluctant to pull the plug on its promotional offerings. What’s more, these deals are now accessible to everyone, including non-Prime members, which makes it an ideal time for everyone to take advantage of significant savings. See all deals at Amazon US See all deals at Amazon UK Top deals for Tuesday: See all deals at Amazon Despite the official end of Prime Day (Oct. 8-9), Amazon keeps on offering massive discounts across a wide range of products. You’ll be pleased to find that popular Apple items are still available at reduced prices: the AirPods Pro 2 remain priced at $199 ($50 reduction from their original $249 price tag). Similarly, the 9th generation iPad is still 32% off and a 4-pack of AirTags can still be snagged for $79. Amazon’s own lineup of devices continues to see price cuts. Echo speakers and Ring security cameras are still available with discounts ranging from 40% to 70%. This extended sale period also encompasses a variety of other product categories, including audio equipment from premium brands like Sony and Bose. Home appliances and gaming consoles such as the PS5 Standard and Digital Edition remain part of the deal roster. Additionally, a range of beauty products and toys are still available at discounted rates on this Tuesday, one week after Prime Day. See all deals at Amazon Lego enthusiasts have not been left out of this extended promotional period of Prime Day: the Lego Star Wars Advent Calendar continues to be available at a 20% discount (top seller on the platform) which makes it an attractive option for those looking to add a touch of galactic fun to their holiday countdown. The Lego Harry Potter Castle is now priced at $135 down from its original $169 and it is also very popular. While Amazon extends its promotional period, other retailers are not sitting idle. Samsung is offering significant discounts on its latest technology through its official store. This includes special deals and trade-in offers on new Galaxy S24 smartphones and the Z Fold 6 and Z Flip 6 foldable models, with potential savings exceeding $1,000 for trade-ins. As this extension of Prime Day deals continues, stock levels for very popular items are becoming a concern. High-demand products like the MacBook Pro, AirPods Max and certain headphone models from Beats and Bose have already sold out. You should act quickly as some more might run out of stock by the end of the day. In a departure from the typical Prime Day format, these extended deals are now accessible to all shoppers regardless of Prime membership status. This democratization of discounts provides an good opportunity for non-Prime members to enjoy savings reserved for subscribers. While this extended Prime Day sale period offers substantial savings, Black Friday is on the horizon. Savvy shoppers might consider this an opportunity to get a head start on holiday shopping and potentially avoid the rush and stock issues often associated with Black Friday sales. See all deals at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 56
            },
            "author": "Cheryl Eddy",
            "title": "10 Freaky Flicks to Stream on Peacock Tonight",
            "description": "Halloween is next week—have you watched your seasonal quota of horror movies yet? If not, here's 10 more for the list.",
            "url": "https://gizmodo.com/10-freaky-flicks-to-stream-on-peacock-tonight-2000515133",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Abigail.jpg",
            "publishedAt": "2024-10-22T19:30:41Z",
            "content": "While Peacock has been branching into horror series lately, with Hysteria! and Teacup two recent additions, the streamer also has a big library of movies perfect for Halloween viewing—encompassing classics, franchise staples, obscure titles (Bermuda Tentacles, anyone?), and seasonal favorites. Here are 10 to set the right frightful mood for your next spooky movie night. Matt Bettinelli-Olpin and Tyler Gillett (Ready or Not, Scream, Scream VI) created their own spin on a Universal Monster with this tale of a tiny ballerina who turns out to be a bloodthirsty vampire—to the gruesome chagrin of the ragtag gang of crooks (including Dan Stevens, Kathryn Newton, and Melissa Barrera) who kidnap her, not realizing that instead of reaping a huge ransom they’ll become her multi-course meal. It’s mid-October—have you had your annual re-watch of The Exorcist III yet? No? Well, lucky for you, Peacock is here to refresh all your nightmares involving garden shears and hospital corridors. Not all film fans have the spirit of Silver Shamrock running through their veins, but for those who appreciate the weird pivot John Carpenter’s blockbuster franchise took in its third installment—no Michael Myers kills, just a diabolical plot involving a toymaker, cursed Halloween masks, and… Stonehenge?—it’s an essential part of spooky season. Are you ready for the big giveaway? Speaking of John Carpenter, one of his most underrated releases is this 1987 oddity that contains an all-star array of actors from other Carpenter projects, and imagines what would happen if Satan’s essence—which looks like the goo inside of a lava lamp—was discovered buried under an aging church in downtown Los Angeles. Nothing good happens to any of the characters, or the world in which Prince of Darkness takes place, but even with some gaping plot holes the movie is screamingly entertaining. When you watch a lot of horror movies, you inevitably start to notice similarities, tropes, and details that hover between homage and blatant rip-off. And then there’s Don Coscarelli’s 1979 Phantasm, a movie that is truly one of a kind, with only its own sequels coming close to replicating its bizarre story and unsettling mood. Two brothers and their pal realize something not right is going down at the local mortuary, and things somehow only get weirder from there. With Terrifier 3 one of horror’s biggest headlines at the moment, there’s no better time to watch writer-director Damien Leone’s favorite movie: the original Black Christmas. So what if it’s early on the calendar? This movie is scary as hell any time of year, with one of the most chilling final scenes of all time. These days we’re used to made-for-TV entertainment in the context of streamers, where nothing is too salacious for audiences. But it’s still stunning to consider Dark Night of the Scarecrow aired on CBS back in 1981, no doubt terrifying viewers with its tale of mob violence in a small town that goes unpunished… until the vengeful spirit of an innocent victim starts getting payback his own way: disguised as a terrifying scarecrow, and using an array of farm-ready implements, including a wood chipper. Deliciously filthy, often offensive, consistently nonsensical, and gory as can be: that’s Pieces, a 1982 murder mystery that also involves an undercover cop posing as a college tennis coach. It’s by Juan Piquer Simón, who also made the inimitable Slugs: The Movie. If you recently watched and enjoyed The Substance, why not chase it with Robert Zemeckis’ diabolically hilarious tale of anti-aging miracles framed by a love triangle gone very wrong? Meryl Streep, Goldie Hawn, Bruce Willis, and Isabella Rossellini all give endearingly campy performances, and while the 1992 special effects may look a little dated now, they’re still impressive for the time. Remember back in 2016, when you were on edge worrying about the upcoming presidential election, and The Purge series dropped this anxiety-jabbing satire that dared to use the tag line “Keep America Great”? Well, here we are in 2024—and The Purge: Election Year is still lurking, this time summoning a sense of dreadful déjà vu. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nHalloweenHorrorPeacock  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.\n         \n          A creator of the hit Showtime show starring Christina Ricci, Sophie Thatcher, and Melanie Lynskey teases 2025's new season.\n         \n          Creepy character posters for the December release urge viewers to reflect on where evil truly resides.\n         \n          To celebrate Halloween, HBO has revealed new images and info for Stephen King prequel It: Welcome to Derry, coming in 2025.\n         \n          Art the Clown is the murder machine of the moment, so we're taking a look at our personal favorite death scenes across the series so far.\n         \n          The recently discovered comet dared to fly too close to our star.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 57
            },
            "author": "Cheryl Eddy",
            "title": "Count Down to Halloween With These 10 Scary Hulu and Disney+ Movies",
            "description": "You still have a few days left to binge-watch horror before Christmas starts invading your watch list. Take advantage while you can!",
            "url": "https://gizmodo.com/halloween-best-streaming-horror-hulu-disney-plus-2000517558",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Barbarian.jpg",
            "publishedAt": "2024-10-28T22:44:26Z",
            "content": "Did you spend all weekend celebrating Halloween, and find it a bit startling that the actual holiday isn’t until… Thursday? Spend the remaining days of spooky season eating trick-or-treat candy and streaming horror movies, including these 10 spooky picks from Hulu via Disney+. Lupita Nyong’o is currently charming audiences in The Wild Robot—but her powerful horror filmography cannot be overstated. While this year’s A Quiet Place: Day One unfortunately didn’t make much impact, her dual performance in Jordan Peele’s unnerving tale of secret doppelgängers is just as impressive (and terrifying) as it was back in 2019. Horrific, haunting imagery and a possession plot that sets its own rules elevate this 2023 release from Argentine writer-director Demián Rugna. Whatever he’s working on next (he also made 2017’s Terrified, and had a segment in 2022 anthology Satanic Hispanics) is already at the top of our must-see list. You know how horror movies are always telling you not to go in the basement? Never was that warning more true than in writer-director Zach Cregger’s 2022 slice of Airbnb horror—which despite using one of the genre’s oldest tropes as a leaping-off point, never goes the direction you think it will. Georgina Campbell is great as the tenacious lead, but extra points also go to Bill Skarsgård and Justin Long for their left-turn supporting performances. David Cronenberg’s 1986 ode to gooey body horror, eccentric genius, the chemistry between Jeff Goldblum and Geena Davis, and cheeseburgers is sci-fi horror at its finest, adapting and updating the 1950s classic in all the right ways. Lists of “best Stephen King adaptations” sometimes overlook this 2007 release from writer-director Frank Darabont, which changes the ending of King’s original story with absolutely devastating results. (Unlike, say, Stanley Kubrick’s The Shining, King actually approved of the alteration.) Thomas Jane leads an ensemble cast in this harrowing survival tale set in (where else?) a small Maine town that’s suddenly encased in a fog filled with malevolent creatures. The Antichrist is having a banner 2024, with The First Omen proving that horror prequels can feel original and shocking—even when leading into one of the genre’s most-watched classics. Go back to the beginning with the 1976 original Omen, then learn what happened just before in The First Omen. For additional devilish entertainment, Hulu also has the very best Omen sequel (two words: military school) as part of its library too. Now that lo-fi nightmare-weaver Kyle Edward Ball has announced his second film (no details yet, other than it’ll be with A24 and is titled The Land of Nod), it’s a good moment to revisit his 2023 ultra low-budget debut, which may have polarized audiences (some were freaked out, others fell asleep), but absolutely signaled the arrival of an intriguing new creator. The author of Let the Right One In provides the source material for this somber zombie movie, which is set in Norway and follows different people whose grief over losing a loved one becomes complicated when, well, the dead start waking up. With Smile 2 currently raking it in at the box office, will Smile 3 be far behind? Parker Finn’s 2022 original kicks off a series that could perhaps go on forever, spreading grinning ghouls across movie theaters and viral social media posts until the end of time. In this new-to-Hulu 2024 release set in oppressively dusty 1930s Oklahoma, Sarah Paulson plays an emotionally fragile mother who starts to believe a drifter (Ebon Moss-Bachrach) may actually be a malevolent supernatural entity—in a film that convincingly walks the line between “is it real?” and “wait… is she losing her mind?” Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nDisney PlusHalloweenHorrorHulu  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Turns out Japanese rap duo Creepy Nuts didn't have any Pikmin in the booth for \"Otonoke.\"\n         \n          Get ready for synths, giant creatures, pirates, and a whole lot of kids adventures on December 3.\n         \n          Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.\n         \n          A creator of the hit Showtime show starring Christina Ricci, Sophie Thatcher, and Melanie Lynskey teases 2025's new season.\n         \n          Creepy character posters for the December release urge viewers to reflect on where evil truly resides.\n         \n          To celebrate Halloween, HBO has revealed new images and info for Stephen King prequel It: Welcome to Derry, coming in 2025.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 58
            },
            "author": "Ed Cara",
            "title": "Peanut Panic on Planes Is Overblown, Researchers Say",
            "description": "In a new review of the evidence, scientists have found little evidence to support the fear that peanut and tree nut allergens can be spread through the air of a plane cabin.",
            "url": "https://gizmodo.com/peanut-panic-on-planes-is-overblown-researchers-say-2000512680",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Airplane-ventilation.jpg",
            "publishedAt": "2024-10-17T13:15:57Z",
            "content": "Air travel can be a nerve-wracking experience for passengers with severe nut allergies. But as new research suggests, the actual risk of airborne exposure during a flight may not be as bad as people think. A widely speculated fear about flying may not have much scientific backing to it. In a new review of the evidence, researchers have concluded that nut allergens can’t spread easily, if at all, through an airplane’s ventilation system. While allergic passengers can still mitigate the risk of contamination by wiping down surfaces where nutty foods could touch, other policies such as total “nut bans” during flights are unlikely to be useful and could even be counter-productive, the researchers say. The worry that traces of peanuts and tree nuts—both common sources of food allergy—can go airborne while flying and cause someone to have a life-threatening allergic attack in a confined space is certainly common. As recently as this May, there have been reports of people claiming to have experienced severe anaphylaxis from simply being near the serving of nuts on a flight, and there is an ongoing Change.org petition to institute an industry-wide ban on nuts during flying. Some airlines, upon request, will now refrain from serving peanut and peanut products during a flight; others have gone as far as to ban their sale entirely. But the researchers behind this new research, published Wednesday in the journal Archives of Disease in Childhood, argue that this worry is substantially overblown. The authors of the paper, Paul Turner and Nigel Dowdall, are specialists in allergy and aviation medicine, respectively. To make their case, they cite dozens of studies, including an earlier review commissioned and released by the UK’s Civil Aviation Authority last year that was authored by Turner. For one, the reported incidence of any food allergies while flying appears to be significantly lower (anywhere from 10 to 100 times lower) than on the ground, though the researchers note this lowered risk could be influenced by people’s heightened level of caution before boarding planes. That said, studies have found that peanuts simply don’t aerosolize well (i.e., when particles become airborne), even when being deshelled and broken open. At worst, deshelling seems to kick up very low levels of peanut dust into the air, but only at a close range and for a brief time. Other studies have had allergic people inhale or stay close to peanuts and peanut products, like peanut butter, in conditions mimicking an airplane cabin. These studies found that such exposures typically cause no symptoms in most people, and only mild, fleeting symptoms in a few. The other major stumbling block is the anatomy of a plane’s ventilation system itself, which is designed to circulate air across the aircraft, not along a cabin, further mitigating the risk of spreading any airborne dangers, whether they be germs or hypothetical nut dust. Passengers aboard a plane also breathe in a mix of recirculated but filtered air and air from the outside of the plane. As a result, and as noted in the new paper, the air in a cabin is typically replaced completely every three minutes, which is even better than the exchange rate seen in hospitals (about 10 minutes). All in all, the evidence points to little potential harm from airborne nuts, the researchers say. “Research studies (including aircraft simulations) show no evidence to support airborne transmission of nut allergens as a likely phenomenon,” they wrote. “Announcements requesting ‘nut bans’ are not therefore supported, and may install a false sense of security.” The pair’s findings are in line with other expert advice. In its most recently reviewed statement on the topic (February 2020), the American Academy of Allergy, Asthma, & Immunology states that “there is no evidence to support peanut vapor as a cause of reactions or that peanut dust itself circulates and causes reactions.” That’s not to say peanuts or other allergic foods can’t be a danger on flights. The researchers note that food proteins tend to be “sticky,” meaning the potential threat from allergic foods comes from lingering on surfaces that other foods or people’s hands might touch. And since airlines, especially budget ones, tend only to minimally clean their cabins between flights, allergy-prone passengers could benefit from being proactive with their own wet wipes, the researchers say. “In addition to dietary avoidance of trigger allergens, cleaning the seat area (including the tray table and the seat-back entertainment system) is likely to be the most effective measure food-allergic passengers can take to mitigate against the risk of unintended allergic reactions,” they wrote. Airlines can help allergic passengers out with this measure by allowing them to pre-board first and clean their area, though this is already a commonly provided practice. The researchers further recommend that people who are at risk of severe allergy carry at least two adrenaline autoinjector devices (Epi-pens are the popular brand name version) at all times, including while flying. And airlines should also have clear policies related to managing food allergies that are easily accessible through their websites or on request, which can then help reassure passengers. \nairplanesfood allergiesPeanutstree nuts  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          This applies to laptops, chargers, e-cigarettes, or anything with a rechargeable battery inside.\n         \n          If you're not subscribed to the streamer, the festive  Peanuts  classic will be available to all on AppleTV+ for two days in December.\n         \n          You'll have to get your annual dose of Charlie Brown's football and Snoopy's feasts this weekend if you're not an Apple TV+ subscriber.\n         \n          It's the Great Pumpkin, Charlie Brown  helped popularize the idea of Halloween specials, and it still holds up 57 years later.\n         \n          Starting today, you can add more of the SuperSize figures to your toy collection.\n         \n          Part of Apple TV+'s festive array of  Peanuts -centric programming,  For Auld Lang Syne  premieres on December 10.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 59
            },
            "author": "Gizmodo Deals",
            "title": "Amazon Prime Day: Here Are 20 Amazing Deals to Save up to 80% This Tuesday Night",
            "description": "Here is our selection of the best deals from the first day of Prime Day.",
            "url": "https://gizmodo.com/amazon-prime-day-here-are-20-amazing-deals-to-save-up-to-80-this-tuesday-night-2000509235",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/prime-day-amazon.jpg",
            "publishedAt": "2024-10-08T23:15:35Z",
            "content": "\nThis article is part of Gizmodo Deals, produced separately from the editorial team.\n      We may earn a commission when you buy through links on the site.\n     A week after the official conclusion of Amazon’s Prime Day event, the e-commerce giant seems reluctant to pull the plug on its promotional offerings. What’s more, these deals are now accessible to everyone, including non-Prime members, which makes it an ideal time for everyone to take advantage of significant savings. See all deals at Amazon US See all deals at Amazon UK Top deals for Tuesday: See all deals at Amazon Despite the official end of Prime Day (Oct. 8-9), Amazon keeps on offering massive discounts across a wide range of products. You’ll be pleased to find that popular Apple items are still available at reduced prices: the AirPods Pro 2 remain priced at $199 ($50 reduction from their original $249 price tag). Similarly, the 9th generation iPad is still 32% off and a 4-pack of AirTags can still be snagged for $79. Amazon’s own lineup of devices continues to see price cuts. Echo speakers and Ring security cameras are still available with discounts ranging from 40% to 70%. This extended sale period also encompasses a variety of other product categories, including audio equipment from premium brands like Sony and Bose. Home appliances and gaming consoles such as the PS5 Standard and Digital Edition remain part of the deal roster. Additionally, a range of beauty products and toys are still available at discounted rates on this Tuesday, one week after Prime Day. See all deals at Amazon Lego enthusiasts have not been left out of this extended promotional period of Prime Day: the Lego Star Wars Advent Calendar continues to be available at a 20% discount (top seller on the platform) which makes it an attractive option for those looking to add a touch of galactic fun to their holiday countdown. The Lego Harry Potter Castle is now priced at $135 down from its original $169 and it is also very popular. While Amazon extends its promotional period, other retailers are not sitting idle. Samsung is offering significant discounts on its latest technology through its official store. This includes special deals and trade-in offers on new Galaxy S24 smartphones and the Z Fold 6 and Z Flip 6 foldable models, with potential savings exceeding $1,000 for trade-ins. As this extension of Prime Day deals continues, stock levels for very popular items are becoming a concern. High-demand products like the MacBook Pro, AirPods Max and certain headphone models from Beats and Bose have already sold out. You should act quickly as some more might run out of stock by the end of the day. In a departure from the typical Prime Day format, these extended deals are now accessible to all shoppers regardless of Prime membership status. This democratization of discounts provides an good opportunity for non-Prime members to enjoy savings reserved for subscribers. While this extended Prime Day sale period offers substantial savings, Black Friday is on the horizon. Savvy shoppers might consider this an opportunity to get a head start on holiday shopping and potentially avoid the rush and stock issues often associated with Black Friday sales. See all deals at Amazon \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n      Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "Gizmodo.com",
                "article_id": 60
            },
            "author": "Cheryl Eddy",
            "title": "You Can Now Own Kurt Russell’s Iconic Hat From The Thing (For a Price)",
            "description": "MacReady's signature accessory is up for auction—along with more amazing horror memorabilia. Here are our 10 most-wanted items.",
            "url": "https://gizmodo.com/rare-horror-props-auction-the-thing-chucky-halloween-2000518404",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/10/MacReady_hat.jpg",
            "publishedAt": "2024-10-30T18:20:30Z",
            "content": "When toiling for months at a time in frozen Antarctica, there’s not a lot of opportunity for personal style—a big reason why the hat worn by helicopter pilot MacReady (Kurt Russell) in John Carpenter‘s 1982 sci-fi horror classic The Thing is so memorable. It instantly signals the character’s offbeat personality, and hints that maybe a guy unafraid to wear such giant, floppy headgear will also prove formidable while fighting, say, an alien that unexpectedly emerges from the ice. MacReady’s hat is the showpiece item in Propstore’s latest sale of entertainment memorabilia. But if you’re a horror fan with a lot of extra cash lying around, there are several more items to tempt your wallet. (Here’s where to go to register and bid.) Here are the 10 we’d most like to own—or at least admire from a distance. The starting bid on this bad boy is £20,000 (around $26,000); the Propstore catalogue says it “originated from a credited crew member to whom it was gifted by Russell following production.” It comes with “both brown leather and yellow and grey woven cord hat bands, a brown leather sweatband with a size tag reading “7 1/8,” and a brown leather chin strap.” It has some wear, but that’s to be expected: it survived a fierce alien brawl over 40 years ago! Ok, these are technically from different films: the hat is from 2003’s Freddy vs. Jason, and the sweater is from 1994’s Wes Craven’s New Nightmare. But both were worn by Robert Englund as one of horror’s most notorious villains. The items are being sold separately, so to complete the outfit you’ll need an estimated £10,000 to £20,000 ($13,000 to $26,000) for the hat—as well as that amount for the sweater, which is estimated to go for the same price. “You’ve got red on you!” Unfortunately, Shaun’s Foree Electric name tag is missing here, but you could whip up your own recreation to go with this screen-matched treasure from the Simon Pegg character’s wardrobe. The estimated price is £6,000-£12,000 ($7,800-$15,600), which means you might not have enough left over to buy a bouquet of flowers for your mom (which you then decide to give to your girlfriend instead… without swapping the card first, of course). Christopher Lee wore this distinctive checked jacket with suede elbow patches in several of his scenes in 1973 folk-horror classic The Wicker Man; including, according to Propstore, at the film’s fiery climax. As a bonus, “this garment was one of Lee’s favourite jackets. He wore it in several other films, including The Skull (1965), as well as for publicity photos and interviews from the 1960s until his death in 2015.” Few will ever be as dapper as Lee was, but for £10,000-£20,000 (estimated) you can give it a try. Of all the items in the auction, this is the one we’d be the most nervous to bring home—much less leave it sitting around for any random passer-by to fiddle with. Instantly recognizable to fans of Clive Barker’s 1987 film, this is the key if you want to invite a bunch of suffering-obsessed Cenobites into your dimension. So be careful! According to Propstore, this is prop was “one of eight crafted for use in Hellraiser; it’s “made of solid oak and has ornate brass-etched panels adhered to each side. A layer of varnish is applied all over to produce a slight shine. There are some signs of light scratching and the brass etchings have broken in some places.” All joking aside, this would be cool as hell to own—and is estimated to fetch £7,000-£14,000 ($9,100-$18,000). Infused with the dark magic of Stonehenge, and able to make the wearer’s head explode with creepy-crawlies when properly activated, this grinning jack o’ lantern is one of three designs proffered by Silver Shamrock Novelties in the cult-beloved 1982 threequel. It’s estimated to go for £3,000-£6,000 ($3,900-$9,600), which is a lot of tricks and treats. Sure, he has resting cute face here. But we all know the evil that lurks within! This prop was used in the 2017 seventh installment in the Child’s Play series, the last from original creator Don Mancini before Chucky took to the small screen for his TV show. While we wait for Chucky part eight (and maybe weave a few black magic spells to speed things along), you can get your mitts on this screen-matched Good Guy doll for an estimated £15,000-£30,000 ($19,500-$39,000). We all know a William Shatner mask, painted white, served as the expressionless visage of Michael Myers—first put to use when he set out on his Haddonfield murder spree in John Carpenter’s 1978 Halloween. But have you ever seen the mask pre-transformation? A 1975 Don Post Studios Captain Kirk mask would be a cool thing to own under any circumstance, but its association with Halloween makes it even more special. Propstore notes “Carpenter used a Captain Kirk mask for both Halloween and Halloween II, altering the design by painting it white, adding faux hair at the back of the scalp, and cutting out larger eye holes in the face …This specific mask was not used on the film and as such it maintains all of its Captain Kirk features, as it has not undergone the alteration process to become a Michael Myers mask.” It’s been foam-filled to make it easier to display, which unfortunately means you can’t actually try it on and spook your neighbors. The estimate for this rarity is £15,000-£30,000. You’ll need a groovy £8,000-£16,000 ($10,400-$21,000 estimated) to tame this full outfit and chainsaw rocked by Bruce Campbell in the first season of Ash’s small-screen adventures. The chainsaw, alas, is not functional; it’s “made of resin and metal pieces with a cotton twine pull cord and a moveable flipswitch on the outside.” It also has “a foam insert for where the chainsaw attached to Ash’s prosthesis.” Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who. \nHorrorKurt Russell  \r\n          Get the best tech, science, and culture news in your inbox daily.\r\n         \r\n          News from the future, delivered to your present.\r\n         \r\n      Please select your desired newsletters and submit your email to upgrade your inbox.\r\n     \n          Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.\n         \n          A creator of the hit Showtime show starring Christina Ricci, Sophie Thatcher, and Melanie Lynskey teases 2025's new season.\n         \n          Creepy character posters for the December release urge viewers to reflect on where evil truly resides.\n         \n          To celebrate Halloween, HBO has revealed new images and info for Stephen King prequel It: Welcome to Derry, coming in 2025.\n         \n          Art the Clown is the murder machine of the moment, so we're taking a look at our personal favorite death scenes across the series so far.\n         \n          Get in the spooky season spirit and revisit Len Wein and Bernie Wrightson's very own Treehouse of Horror comic.\n          Gizmodo’s Best of 2024 Awards ➜ We may earn a commission when you buy through links on our sites.\n©2024 GIZMODO USA LLC. All rights reserved. Mode \n                Follow us\n               Mode \n                Follow us\n              "
        },
        {
            "source": {
                "name": "BBC News",
                "article_id": 61
            },
            "author": "BBC Sport",
            "title": "Nadal 'emotionally ready' for Davis Cup farewell",
            "description": "Rafael Nadal says he feels emotionally prepared for ending his career at next month's Davis Cup Finals but the Spaniard will only contest the singles if he is \"ready to win\".",
            "url": "https://www.bbc.com/sport/tennis/articles/cp8mg2y1x3jo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_sport/ae88/live/218ab6e0-8d25-11ef-8618-49566d41575a.jpg",
            "publishedAt": "2024-10-18T08:31:36Z",
            "content": "Only Novak Djokovic has won more Grand Slam men's singles titles than Rafael Nadal Rafael Nadal says he feels emotionally prepared for ending his career at next month's Davis Cup Finals but the Spaniard will only contest the singles if he is \"ready to win\". The 22-time Grand Slam champion announced last week that he will retire from tennis after representing Spain in Malaga, where the Davis Cup will be held from 19-24 November. Nadal, 38, is currently competing at the Six Kings Slam exhibition event in Saudi Arabia and will face long-time rival Novak Djokovic for the final time on Saturday. \"Emotionally, I'm sure I'll be ready. Physically and in terms of tennis level, there remains a month left to prepare,\" Nadal said after losing to Carlos Alcaraz on Thursday. \"I will try to be in good shape to help the team to win. If I don't feel ready for the singles, I'll be the first one to say. \"Be 100% sure, I will not be on court if I don't feel ready to win my match.\" After losing his semi-final 6-3 6-3 to compatriot Alcaraz, whom he partnered in doubles at the Olympics and could do so again at the Davis Cup, Nadal will meet Djokovic in the third-place match. Serb Djokovic, the only man to have won more Slams than Nadal with 24, was beaten 6-2 6-7 (0-7) 6-4 by world number one Jannik Sinner, who will face Alcaraz for the $6m (£4.5m) prize money. \"To have Novak in front [of me], it's like a nostalgic thing,\" said Nadal, who has won 29 of his 60 meetings with Djokovic. \"We've played each other a lot, so it'll be fun to play each other again one more time in this match. Hopefully we can create a good show and good level of entertainment.\" On Alcaraz, who at 21 has already won four majors and looks set to battle 23-year-old Sinner for years to come, Nadal said: \"He's going to do very well with what he's got. He's learning all the time. \"We can see he's developing in every way. But of course I'll be ready whenever he wants to call me.\" Saudi Arabia has invested heavily in sport since 2021, when the country's Crown Prince made it a key part of his strategy to diversify the economy. However, the Gulf kingdom has been criticised for its human rights violations and accused of that investment and the hosting of high-profile events to improve its international reputation - a process known as 'sportswashing'. Live scores, results and order of play Get tennis news sent straight to your phone I'm more grateful for each day - Sir Chris Hoy  England name unchanged XV to face Australia Everything is more difficult now - Guardiola Sir David Attenborough reveals Asia’s wildest places Explore a continent of beauty and intrigue, home to some of the world's most diverse habitats Do mummy's boys still exist? Poppy is joined by content creator and podcaster Wajeeh West to talk all about mummy's boys Bruce Springsteen reflects on his life on the road It’s 60 years since the music icon played his first gig Author Irvine Welsh talks about his path to success He looks back at his childhood, his parents' romance and a first arrest at just eight years old I'm more grateful for each day - Sir Chris Hoy  Why did Hamilton struggle when Russell was competitive? Choose your favourite goal from FA Cup first round Kansas City Chiefs remain unbeaten after overtime win. VideoKansas City Chiefs remain unbeaten after overtime win Why are Forest so good this season - and can it last? Who has made Troy's Premier League team of the week? Which was the greatest F1 wet-weather drive? 'No creation & millions wasted on recruitment - Amorim's mammoth task'  'Him against the world' - how Vinicius Jr's fight goes beyond football 'Norris' hopes crushed by Verstappen performance for the ages' Can 'misinterpreted' Fernandes fit in to Amorim's Man Utd? VideoCan 'misinterpreted' Fernandes fit in to Amorim's Man Utd? 'All eyes on Middle East at pivotal time after Hull’s Saudi win' Ford focus can't obscure England's other shortcomings 'A long way back now' - what is going wrong at Arsenal? When Amorim played with a broken arm to reignite football dream Non-league Tamworth stun Huddersfield in FA Cup. VideoNon-league Tamworth stun Huddersfield in FA Cup 'The second special one' - Amorim by those who know him best. Video'The second special one' - Amorim by those who know him best How FA Cup final hat-trick hero finally got a headstone 'Rangers rudderless as big picture plan threatens to unravel' Scandals, crashes & rivalries - eight dramatic F1 title battles © 2024 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
        },
        {
            "source": {
                "name": "BBC News",
                "article_id": 62
            },
            "author": null,
            "title": "Two new lawsuits accuse Sean 'Diddy' Combs of sexually assaulting boys",
            "description": "The music mogul faces multiple lawsuits and criminal charges alleging sexual abuse, including of minors. He denies any wrongdoing.",
            "url": "https://www.bbc.com/news/articles/czj7dmrd3zjo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9bcf/live/7e085e60-9598-11ef-a05a-dbeacac5ad67.jpg",
            "publishedAt": "2024-10-29T02:32:46Z",
            "content": "Two new lawsuits have been filed against Sean \"Diddy\" Combs accusing the music mogul of sexual assault.  Both lawsuits, which were filed in New York, include accusations by men who were underage at the time of the alleged assaults.  In one, the alleged victim was 10 at the time. The second alleges Mr Combs assaulted a teenage boy who was auditioning for the popular MTV reality show \"Making the Band\", which the rapper produced.  In a statement to the BBC, representatives for Mr Combs said he \"never sexually assaulted or trafficked anyone - man or woman, adult or minor\".  Warning: This story contains details some readers may find disturbing More than two dozen lawsuits have been filed against Mr Combs in recent months with allegations that include rape, people being drugged, underage assaults, intimidation and sexual extortion.  The rapper is also facing federal criminal charges in an alleged sex trafficking and racketeering conspiracy. He has pleaded not guilty to those charges. The two lawsuits filed on Monday were brought by attorney Tony Buzbee, who has said he represents more than 100 alleged victims and plans to file dozens of lawsuits against Mr Combs in the coming weeks.  In the first lawsuit, which was filed anonymously, the plaintiff alleges that Mr Combs assaulted him in 2005 when he was 10 years old and an aspiring actor and rapper.  To support their son's ambitions in entertainment, the boy's parents enlisted the help of an industry consultant who suggested they travel to New York for meetings with music professionals. During the trip, the consultant set up an “audition” with Mr Combs, who requested a private meeting with the boy, the lawsuit says. The lawsuit claims the consultant escorted the boy to Mr Combs’ hotel room, where he was left alone. The boy performed several rap songs for Mr Combs, who told him he had the potential to become a star.  Read more on the allegations against Diddy: According to the complaint, Mr Combs asked the boy how committed he was to pursuing his dream and the boy replied that he would \"do anything\".  During the meeting, a third person gave the boy a soda that made him feel “funny”, but at the time, the plaintiff thought the feelings were from happiness over the meeting, the lawsuit states.  The rapper is then accused of disrobing and ordering the boy to perform a sex act.  When the boy resisted, Mr Combs allegedly assaulted him. The plaintiff says in the complaint that he lost consciousness and woke up in pain with his pants undone.  Mr Combs told him if he told anyone he would hurt his parents, according to the lawsuit.  In the second lawsuit, an unnamed male alleges he was sexually assaulted by Mr Combs in 2008. The plaintiff was 17 when he was auditioning for the MTV reality competition Mr Combs produced.  During various rounds of the audition process, Mr Combs allegedly asked the plaintiff how he would handle situations involving sexual pressure.  He and his bodyguard went on to force the teen into sexual acts, the lawsuit states.  Mr Combs is currently being held at the Metropolitan Detention Center in Brooklyn, New York following his September arrest on federal charges. He was denied bail and will remain in custody until his trial in May.  He has denied all the allegations against him.  \"Mr Combs and his legal team have full confidence in the facts and the integrity of the judicial process,\" his representatives said.  If convicted of racketeering, he could face life in prison.  BBC’s Anna Foster reports from swing state Pennsylvania, explaining its crucial role in the outcome. Trying to understand it for the first time or need a refresher? This guide can help. Voters across the US are casting their in-person ballots - starting with a tiny township in New Hampshire. Once polls close on Tuesday, a winner may not be projected for several hours, days or even weeks. The judiciary contradicts state media reports from 28 October that Jamshid Sharmahd was put to death. Copyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.  "
        },
        {
            "source": {
                "name": "BBC News",
                "article_id": 63
            },
            "author": null,
            "title": "Selena Gomez 'shines' in new Oscar-tipped musical",
            "description": "The singer and actress stars in Emilia Pérez, a new Netflix musical which has been tipped for awards.",
            "url": "https://www.bbc.com/news/articles/c99vm20jk3eo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6e1a/live/e9995760-87f6-11ef-8936-1185f9e7d044.jpg",
            "publishedAt": "2024-10-11T18:25:59Z",
            "content": "US singer and actress Selena Gomez joined her co-stars on the red carpet at the London Film Festival on Friday, for the UK premiere of her Oscar-tipped film Emilia Pérez.  The Spanish-language musical was one of the breakout hits of the Cannes Film Festival earlier this year, where Gomez and three of her co-stars were jointly named best actress. The others - Zoe Saldaña,  Adriana Paz, Karla Sofía Gascón - appeared alongside Gomez in London, where the film hopes to continue its momentum in the awards race.  Emilia Pérez follows a Mexican Cartel leader (played by Gascón), who asks a high-powered lawyer named Rita (Saldaña) to help him fake his own death.  But the reason he wants to retire and disappear from the world of crime isn't what you might expect - the cartel leader wants to change gender and live a new life as a woman. The rest of the film focuses on four women, including the newly-transitioned Emilia Pérez, as they each pursue their own version of happiness in modern-day Mexico.  Pérez is portrayed by Spanish trans actress Gascón, who has been tipped as a possible best actress contender in the forthcoming awards race. Gomez plays the drug lord's wife, who is kept in the dark about her former lover's new identity, while Paz portrays Emilia's new romantic interest after transitioning. All four of the film's stars walked the red carpet ahead of the film's UK premiere at the Royal Festival Hall as part of the London Film Festival on Friday. French director Jacques Audiard came up with the idea for the film after reading a chapter in Boris Razon's 2018 novel Écoute about a drug lord who changes identity.  Audiard went one step further for the film, and made it a story of changing gender. \"I was less interested in a change of identity to evade competitor drug barons, and more interested in the change of identity for the sake of the person she was and is,” the director told BBC News. \"I was more interested in the past and what led to that transition.\" The role required someone very specific – a trans actress, who was a Spanish speaker, who could also sing and dance. Recalling the casting process, Gascón tells BBC News: “I was contacted when I was in Mexico by a production team, and was told 'We need an actress as crazy as you - you're the only one who can do this role, but you need to learn five songs for tomorrow!' “And I was like 'OK, let's record the whole album and we'll go on tour as soon as you want!’\" she joked. “But I did say, ‘this is going to be difficult, I'm not a singer'. But the team in the film, they worked with me incredibly, they really helped me with all the songs and made it so that we could do the best work possible.” Asked about Gascón's casting, Audiard added simply: “Without her there would be no film.” Interestingly, the actress campaigned to play both the male and female roles – in other words, the character both before and after transition.  Audiard had originally intended for a different actor to play the male drug lord Manitas, because, the director explained, he was \"uncomfortable asking [Gascón] to revisit something she was moving away from\". But, Gascón recalled: “I said to Jacques, I want to play this role in the complete arc, because for me it is important to do the full part. It wouldn't be the same film if another actor played [Manitas].\" That meant using effects and make-up such as a fake beard, she explained, so she could play the drug baron in the first section of the musical. \"This film is this film because the same actress played the complete performance,\" Gascón continued. \"It's that kind of role you have once in your life and I didn't want to lose the opportunity to play this.” Reviews of Emilia Pérez, which is released on Netflix next month, have been generally positive so far.  \"It's a wild, gritty, glitter-soaked ride that defies convention and classification,\" said Entertainment Weekly's Maureen Lee Lenker.  She praised the film's performances, commenting: \"Selena Gomez is a welcome surprise, shedding any remaining hints of her Disney Channel origins in her portrayal of a hard-loving wife of a narco.  \"The film's climax in particular allows Gomez to shine as a dramatic actress in new ways. She conveys heartache and anguish through a tortured physicality that propels her into the unpredictable state of a woman on the verge of something dangerous.\" Asked by the BBC's Graham Norton if it was comfortable going back to the world of singing and dancing for the musical, Gomez said: \"No, because this was completely different.  \"It was intricate dance moves I never knew my body could do, and it was also me playing a character so if anything I tried to avoid what I was comfortable with.\" There has also been praise for Gascón, a \"wonderful discovery\" who gives \"a magnificent performance\", according to the Hollywood Reporter's David Rooney. The Telegraph's Tim Robey described the film as \"amazingly confident – it’s clever, earnest, ridiculous, knowing, forceful and absolutely bonkers\", while Hoai-Tran Bui of Inverse said it was \"an emotionally fulfilling triumph\". Not all critics were as enthusiastic about the film, however.  \"Emilia Pérez was originally intended to be an opera, which perhaps partly explains its saccharine sentimentality, repetitive lyrics, and diverging story branches. But that doesn’t excuse its almost random, whiplash-inducing tonal pivots,\" said Slant's Kyle Turner. However, Lauren Bradshaw of Fangirl Freakout said: \"Emilia Pérez is a magnificent, genre-bending thrill ride that transcends the typical movie construct, breathing a fresh burst of excitement into the way we think about film.\" As an actress, Gomez is best known for starring in Only Murders in the Building, but also has a successful singing career with hits including Back To You, Wolves and Love You Like a Love Song. Her co-star Saldaña, meanwhile, has starred in a large number of blockbusters in the last two decades, with roles in the Avatar and Guardians of the Galaxy franchises. It remains to be seen whether Emilia Pérez could be a big awards player, but Academy voters may see an opportunity to recognise Saldaña's box office success via this more critically acclaimed work.  Their co-star Adriana Paz is a Mexican actress whose credits include Not Forgotten, Hilda and La Caridad. But the film's breakout star is arguably Gascón, who already had a successful acting career before transitioning in 2018. Praising her performance in his review, Rooney said: \"The warmth, the joyous self-realisation, the complexity and authenticity... that illuminate [Gascón's] characterisation no doubt owe much to the parallels in the Spanish star’s life - in her own words, she was an actor before becoming an actress, a father before becoming a mother.\" Emilia Pérez has already been selected as France's entry for the best international feature category at the Oscars, which take place in March. Heidi Klum attended her Halloween bash as E.T., while Lizzo's costume referenced a recent episode of South Park. The 32-year-old singer and actor says she is considering adoption or surrogacy.  The celebrity joins the billionaire ranks thanks to her Rare Beauty make-up business. On Sunday, Afrobeats megastar Burna Boy will play Glastonbury's Pyramid Stage. The actress and singer became the most-followed woman on Instagram earlier this year. Copyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.  "
        },
        {
            "source": {
                "name": "BBC News",
                "article_id": 64
            },
            "author": null,
            "title": "Pensioner barred from Butlin's weekday solo visit",
            "description": "Malcolm says he is upset as he and his family have been going to Butlin's for years.",
            "url": "https://www.bbc.com/news/articles/c5yx6pwg503o",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/8735/live/dc225820-96b5-11ef-b9b9-bb3745ff289c.jpg",
            "publishedAt": "2024-10-31T06:17:06Z",
            "content": "An 85-year-old-man said he was \"gobsmacked\" to find out he was barred from visiting his favourite Butlin's resort during the week because he was going alone. Malcom, from Patcham, East Sussex, said he rang the company inquiring about a few nights on his own at its Skegness site, but was told solo travellers were only welcome at weekends. He said he was particularly upset as he and his family had been going there for years. In a statement, Butlin's said: \"We don't allow single travellers on our family breaks unless they are linked to a booking where children are also on the break.\" Malcom wanted to go during the week, which would have cost him £75. He was told he would be allowed to go on his own at a weekend, but this would set him back £300. Malcolm was only planning to go on his own as his wife had had cancer for the last seven years so could not accompany him and his son had used up all his annual leave at work. He said he did offer to pay a supplement but was told that was not possible. He was also told if he did book for two people but the second person could not attend, he would be refused access. Malcolm told BBC Radio Sussex: \"I was amazed when I was told this. I've been to Butlin's before, even the Skegness one. \"I enjoy my trips to Butlin's - the entertainment in the evening is good and a nice play to stay. \"I asked if they can waive the rules for older solo travellers but I was told no.\" A Butlin's spokesperson added: \"Our family breaks are the only ones that run midweek.\" Malcolm said he had now booked an alternative trip on his own. Follow BBC Sussex on Facebook, on X, and on Instagram. Send your story ideas to southeasttoday@bbc.co.uk or WhatsApp us on 08081 002250. He used a pumpkin and boiler suit to fool prison staff into thinking he was asleep when he escaped. The team behind a huge poppy installation in Skegness is planning an even larger event for 2025. Organisers said they were inundated with poppies from as far as Hong Kong, Bermuda and Canada. Tourism on the Lincolnshire coast will suffer if an underground facility is built, opponents claim. People from Hong Kong, Spain, Bermuda and Canada have helped to create the tribute in Skegness. Copyright 2024 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.  "
        },
        {
            "source": {
                "name": "Android Central",
                "article_id": 65
            },
            "author": "patrick.farmer@futurenet.com (Patrick Farmer)",
            "title": "Samsung brings the fight to Prime Day with $700 OFF The Frame TV — plus get a FREE soundbar, because why not?",
            "description": "If you're interested in The Frame series of smart TVs, Samsung is matching Amazon's Prime Day discount AND throwing in a free soundbar for good measure.",
            "url": "https://www.androidcentral.com/streaming-tv/samsung-brings-the-fight-to-prime-day-with-usd700-off-the-frame-tv-plus-get-a-free-soundbar-because-why-not",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/FjH5iMB3i5iu9Wync4YH7Z-1200-80.jpg",
            "publishedAt": "2024-10-09T16:26:14Z",
            "content": "No offers found The sale is wrapping up soon, so act fast.  \nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n Samsung's anti-Prime Day sale ends at midnight tonight, which means you only have a few hours to take advantage of the best 4K TV deals before they're gone for good. From OLEDs and projectors to foldable phones, Samsung is dropping prices on almost all of its best tech during the flash sale, but one deal in particular has caught my eye this morning.  Please direct your attention to this Samsung deal that carves a whopping $700 off the 75-inch The Frame TV, a sleek entertainment powerhouse that doubles as a work of art in your home. As if the savings alone weren't enough to justify your purchase, Samsung is also throwing in a FREE S-Series Dolby Atmos soundbar with the TV, an additional value of $349.99.  Samsung 75\" The Frame 4K QLED TV: $2,999.99 $2,299.99, plus FREE S-Series Dolby Atmos HW-S61D Soundbar at Samsung Amazon's Big Deal Days sale has displayed a bunch of great discounts over the past two days, but if you're interested in The Frame series of smart TVs, Samsung is the one to choose.  Just like Amazon, the iconic tech company is selling the 75-inch model with a $700 discount, but Samsung is also challenging its rival by throwing in a FREE S-Series Dolby Atmos soundbar (a $349.99 value). The deal ends at midnight tonight, so don't wait too long if you're interested! The Frame boasts stunning 4K QLED picture with Samsung's AI-powered Quantum Processor 4K, but the main selling point here is the TV's ability to double as a lovely work of art in your home. The sleek display features an anti-glare matte finish with a slim construction that hangs flush against your wall, plus you get to customize the bezel so The Frame matches the decor of your home. If you want an Android TV that offers peak, cinema-quality entertainment without interfering with the style of your living room, then The Frame is pretty groundbreaking. $700 off the 75-inch set was already a good deal, but with a free soundbar thrown into the mix, it's truly unmissable. Get the latest news from Android Central, your trusted companion in the world of Android After almost a decade of working in the e-commerce space, Patrick Farmer (he/him) began his career at Android Central as a Deals and Commerce Writer before moving into a new role as AC's eCommerce Editor in 2023. When he's not hunting down the best deals and offering shopping advice for our readers, you'll often find him listening to music, camping out at a brewery, or treating his cat like a human child.  Samsung has cut OVER $1,000 off the price of this 65-inch 4K TV ahead of Black Friday Black Friday OLED TV deals 2024 — early discounts and helpful tips for saving big this holiday season I'm trying not to feel underwhelmed by this $1100 watch Android Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
        },
        {
            "source": {
                "name": "Android Central",
                "article_id": 66
            },
            "author": "derrek.lee@futurenet.com (Derrek Lee)",
            "title": "Hurry! Jabra's best and last fitness earbuds are selling out",
            "description": "Jabra's final generation of consumer earbuds are on sale for Prime Day, but some colors are already sold out.",
            "url": "https://www.androidcentral.com/accessories/earbuds/hurry-jabras-best-and-last-fitness-earbuds-are-selling-out",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/zKzk5iiDEbfg5Q98g6fzvb-1200-80.jpg",
            "publishedAt": "2024-10-09T18:46:44Z",
            "content": "No offers found The Jabra Elite 8 Active Gen 2 are some of the best earbuds you can buy. \nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n Jabra may have bowed out of the consumer audio space, but I'm still a fan of its products, and the Jabra Elite 8 Active Gen 2 may well be some of the best fitness earbuds you can buy right now, especially during Prime Day. And before you ask, Jabra intends to support its earbuds through the coming years, so you should have little to no reservations about picking these up, especially now that they're down to their lowest price. The Jabra Elite 8 Active Gen 2 launched earlier this year for $229, so it's surprising that they're already on sale. With Prime Day shaving $50 off, you can snag these excellent earbuds for just $179, which is the lowest price we've seen them thus far. Jabra Elite 8 Active Gen 2: $229.99 $179.99 at Amazon Jabra's latest and last fitness earbuds are among the best you can own, thanks to superb audio and a unique Bluetooth LE case. These earbuds are still only months old, but Prime Day is slashing more than 20% off, bringing these to their lowest price. If the Jabra Elite 8 Active Gen 2 are anything like the first-generation Elite 8 Active earbuds, then these are definitely a must-buy. I love the first-gen earbuds, as they offer great sound quality, easy multi-point pairing, and long battery life, even with ANC on. However, the Gen 2 take things up a notch, adding Bluetooth LE Audio to the case itself. Why, you ask? Because that way, you can connect the case to an audio source that may not support Bluetooth and stream music to your earbuds. If you travel a lot like I do, then this can be incredibly useful, as not every airplane supports Bluetooth connectivity, and I don't own any wired headphones (the ones they give out on planes are absolutely horrible). The earbuds are also great for working out, thanks to the IP68 and MIL-STD-810 ratings. But you should act fast, as it's the final day of Prime Day and some color options are seemingly sold out and your options are dwindling. ✅Recommended if: You want earbuds with great audio quality and durability. Also if you find yourself on airplanes a lot and want to use your own earbuds to enjoy in-flight entertainment. ❌Skip this deal if: You are unsure about long-term support given Jabra's exit from the consumer audio space. As impressive as these are, it's also worth noting that these aren't even Jabra's best earbuds! The Jabra Elite 10 Gen 2 are almost perfect and feature the same impressive audio and connectivity as the 8 Gen 2. While these are more expensive, Prime Day also has them on sale at a whopping $80 off, meaning you can snag them for just $199. Jabra Elite 10 Gen 2: $279.99 $199.99 at Amazon The Elite 10 Gen 2 may be Jabra's last big hurrah in consumer audio, but that doesn't make them any less impressive, with superb audio and great battery life. At $80 off, you shouldn't miss out on these earbuds. Get the latest news from Android Central, your trusted companion in the world of Android Derrek is the managing editor of Android Central, helping to guide the site's editorial content and direction to reach and resonate with readers, old and new, who are just as passionate about tech as we are. He's been obsessed with mobile technology since he was 12, when he discovered the Nokia N90, and his love of flip phones and new form factors continues to this day. As a fitness enthusiast, he has always been curious about the intersection of tech and fitness. When he's not working, he's probably working out. Google Pixel Buds Pro 2 vs. Samsung Galaxy Buds 3 Pro: Which one should YOU buy? Bose QuietComfort Ultra Earbuds review: Setting the noise-canceling tone One UI 7 beta could be just around the corner with an Apple Intelligence-like twist Android Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
        },
        {
            "source": {
                "name": "Android Central",
                "article_id": 67
            },
            "author": "harish.jonnalagadda@futurenet.com (Harish Jonnalagadda)",
            "title": "Ditch your Sonos Amp — the WiiM Amp does a better job, and it costs just a third as much",
            "description": "The WiiM Amp is one of the best network streaming amps you can get today, and it gets an enticing discount.",
            "url": "https://www.androidcentral.com/accessories/smart-home/ditch-your-sonos-amp-the-wiim-amp-does-a-better-job-and-it-costs-just-a-third-as-much",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/jcBR9z2ucab6Rbj25tkM8M-1200-80.jpg",
            "publishedAt": "2024-10-09T10:39:55Z",
            "content": "No offers found This is the ultimate network-connected amp.  \nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n I'm obsessed with multi-room audio; I have a lot of speakers in the house, and instead of buying Bluetooth-enabled products, I decided to add streaming dongles instead. I used Chromecast Audio in the past, but they haven't been available for a while now, and these days, I use WiiM's solutions. Basically, the WiiM Amp is a network streamer that unlocks a suite of use cases. It has a built-in amplifier, making it a decent choice to connect to passive speakers — up to 60W each channel — and you have subwoofer out. With HDMI ARC, USB, optical, and Ethernet, you get everything you need to hook up your audio gear and connect it to your TV. The best part is that it integrates with Spotify Connect, Tidal Connect, DLNA, Chromecast, AirPlay 2, and Alexa Cast, so regardless of what streaming platform you use, you can easily connect to the device. Honestly, the Amp is one of those products that just works, and it is the bedrock of my home entertainment system. It usually costs $299, but for Prime Day, WiiM is slashing the price by 20%, so you can pick it up for just $239. That is an unbelievable value when you consider what the Amp can do. WiiM Amp Streaming Amplifier: $299 $239 at Amazon The WiiM Amp has all the features you'd ever need in a network amp, and it combines standout audio with an elegant design. If you need an easy way to connect speakers to turntables and your TV, this is the way to go. ✅Recommended if: You want a network streaming amp with incredible sound and plenty of connectivity.  ❌Skip this deal if: You need headphone out.  Setting up the Amp is about as easy as it gets, and the mobile interface has a polished design. The design of the Amp itself is great, and it looks minimalist. The built-in ESS Sabre DAC is one of the best in this category, and while the connectivity is decent in its own right, you're buying this device for the sound — it does a magnificent job in this regard. The tight integration with all streaming protocols also gives the Amp a distinct edge. You get Alexa and Google Assistant control as well, and there's a remote that you can use to control the device. If you don't need all the features and want a puck-sized device, the WiiM Mini is a better option, and that is down to $75 right now. The WiiM Pro is a decent middle ground if you want better sound, and it's available for just $119. But if you want a high-quality amp with terrific sound that doubles as a network streamer, the WiiM Amp is the obvious choice — particularly at $239. Get the latest news from Android Central, your trusted companion in the world of Android Harish Jonnalagadda is Android Central's Senior Editor of Asia. In his current role, he oversees the site's coverage of Chinese phone brands, networking products, and AV gear. He has been testing phones for over a decade, and has extensive experience in mobile hardware and the global semiconductor industry. Contact him on Twitter at @chunkynerd. Verizon is offering a FREE YEAR of the Disney Bundle when you sign up for a qualifying Fios home internet plan Ask Jerry: Looking for an automatic smart light solution OnePlus 14: Everything we know (so far) and want to see Android Central is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
        }
    ]
}