{
    "status": "ok",
    "totalResults": 33,
    "articles": [
        {
            "source": {
                "id": null,
                "name": "Fox Business"
            },
            "author": "Suzanne O'Halloran",
            "title": "Trump trade powers Dow 44,000, S&P 6,000 as stocks keep humming - Fox Business",
            "description": "The Dow, S&P 500 and Nasdaq Composite hit a fresh round of new record highs as investor optimism continues following President-elect Donald Trump's historic White House win.",
            "url": "https://www.foxbusiness.com/markets/trump-trade-powers-dow-44000-sp-6000-stocks-keep-humming",
            "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2024/11/0/0/trump-election-win-getty.jpg?ve=1&tl=1",
            "publishedAt": "2024-11-12T01:26:00Z",
            "content": "Investors continued to plow money into U.S. stocks, setting new records following President-elect Donald Trump’s historic White House win.  \r\nThe Dow Jones Industrial Average scored its 43rd record o… [+5123 chars]"
        },
        {
            "source": {
                "id": "reuters",
                "name": "Reuters"
            },
            "author": "Phil Stewart, Steve Holland, Idrees Ali",
            "title": "Trump selects Mike Waltz as national security adviser, sources say - Reuters",
            "description": "President-elect Donald Trump has picked Republican Representative Mike Waltz to be his national security adviser, two sources familiar with the matter told Reuters on Monday, tapping a retired Army Green Beret who has been a leading critic of China.",
            "url": "https://www.reuters.com/world/us/trump-selects-mike-waltz-national-security-adviser-wsj-reports-2024-11-11/",
            "urlToImage": "https://www.reuters.com/resizer/v2/GLDBFQOVMZJ23LLXW4IPF6LGTI.jpg?auth=2ac702d2a7e947399486a3c514df33da959c51c465f4ec18a375919b25468c32&height=1005&width=1920&quality=80&smart=true",
            "publishedAt": "2024-11-12T01:08:00Z",
            "content": null
        },
        {
            "source": {
                "name": "Al Jazeera English"
            },
            "author": "Al Jazeera",
            "title": "At least 40 killed in Gaza as Israeli drone attacks ‘safe zone’ café - Al Jazeera English",
            "description": "Kamal Adwan Hospital in north Gaza calls on international organisations to protect the facility from Israeli attacks.",
            "url": "https://www.aljazeera.com/news/2024/11/11/at-least-30-palestinians-killed-in-gaza-as-israeli-tanks-enter-nuseirat",
            "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/11/AFP__20241111__36M67L2__v1__HighRes__PalestinianIsraelConflictHospital-1731371068.jpg?resize=1920%2C1440",
            "publishedAt": "2024-11-12T00:20:51Z",
            "content": "Kamal Adwan Hospital in northern Gaza calls on international organisations to protect the facility from attacks by Israeli forces. At least 40 Palestinians have been killed across Gaza in Israeli attacks, including a drone strike on people sitting at a café in the al-Mawasi area in the south of the territory which was previously designated a “safe zone” by Israel’s military. Al Jazeera’s correspondent in Gaza said that at least 10 civilians were killed late on Monday in a double missile strike by an Israeli drone on the small tent café, located to the west of Khan Younis in the south of the war-torn enclave.     “This is more proof that the Israeli claims about ‘evacuation zones’ and ‘safe areas’ are nothing more than false narratives,” Al Jazeera’s Hani Mahmoud said, reporting from Deir el-Balah in central Gaza. “People go to this coffee shop to connect to the internet and the outside world or to watch a football game on the big screen. A drone fired at least two missiles at the café while people were inside. A witness said it was packed,” Mahmoud said. “Victims who arrived at Nasser Hospital in Khan Younis for treatment were completely disfigured,” he said, adding that seven people injured in the strike were undergoing surgery.      Earlier, health officials at al-Awda Hospital in Nuseirat, located in central Gaza, said 20 people were killed in a series of air and ground attacks on Monday, including Israeli tanks advancing into the Nuseirat refugee camp from the west and opening fire on residents and displaced families who tried to flee. A witness said the tank attack on the refugee camp caught residents by surprise. “Some people couldn’t leave and remained trapped inside their homes, appealing to be allowed out, while others rushed out with whatever they could carry as they fled,” said Zaik Mohammad, 25, who lives 1km (half a mile) from the area targeted in the camp. In the northern Gaza town of Beit Lahiya, which Israeli forces have besieged since the beginning of October, medics said four people were killed in an Israeli air attack. Several other people were killed in an air attack in Gaza City. An Israeli drone also attacked Kamal Adwan Hospital near Beit Lahiya, injuring three medical staff, health workers report.      Reporting from Deir el-Balah, Al Jazeera’s Tareq Abu Azzoum said the hospital has appealed to international institutions to provide protections in light of the attacks. “Since the early hours of this morning, there has been a wide intensification of attacks in the north of the Gaza Strip, in particular, in the vicinity of Kamal Adwan Hospital and also on the central market in Gaza City,” Azzoum said. “These areas have been witnessing new evacuation orders that have been passed and issued by the Israeli military,” he added. Since the war began last year, at least 43,603 Palestinians have been killed in Gaza due to Israeli attacks, Gaza’s Health Ministry said. Israel’s attacks on the enclave began after the October 7, 2023, Hamas-led attack that killed an estimated 1,139 people in southern Israel. Arab and Muslim countries condemned the “horrific and shocking crimes” committed by Israel during its war in Gaza at a joint Arab League and Organisation of Islamic Cooperation (OIC) summit in Saudi Arabia on Monday. In a statement, the leaders condemned “in the strongest terms” the Israeli army’s actions in the enclave. The statement denounced “the crime of genocide… especially in the northern Gaza Strip during the past weeks”, citing torture, executions, disappearances and “ethnic cleansing”. Saudi Arabia’s Crown Prince Mohammed bin Salman also said during the summit that the kingdom “categorically” rejects the “genocide against the brotherly Palestinian people”. He urged the international community to also stop Israel from attacking Iran to respect its sovereignty.          Follow Al Jazeera English:"
        },
        {
            "source": {
                "name": "CNN"
            },
            "author": "Kristen Holmes, Betsy Klein",
            "title": "Melania Trump expected to skip Wednesday White House meeting with Jill Biden - CNN",
            "description": "Melania Trump is not expected to attend the traditional White House meeting with first lady Jill Biden, sources familiar with her plans said.",
            "url": "https://www.cnn.com/2024/11/11/politics/melania-trump-jill-biden/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2182526163.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-12T00:03:00Z",
            "content": "\n            Melania Trump is not expected to attend the traditional White House meeting with first lady Jill Biden, sources familiar with her plans said.\n     \n            It’s a decision that underscores Melania Trump’s long-held willingness to buck tradition as she prepares to retake the high-profile – but unelected – role of first lady, one with no manual and an automatic global platform.\n     \n            The sources cited a prior scheduling conflict for the former first lady related to her newly released memoir. One source said the decision had not been finalized. The Daily Mail was first to report on the former first lady’s expected absence.\n     \n            Jill Biden extended Melania Trump the customary invitation last week as her husband also invited the president-elect to the Oval Office, a symbolic gesture to show the country and the world that there will be a peaceful transition of power – and an implicit rebuke of Donald Trump, who refused Joe Biden the same meeting in 2020 as he contested that election’s results. The two are set to meet Wednesday at 11 a.m., according to the White House.\n     \n            There was discussion about encouraging Melania Trump to come to Washington for the meeting, as some members of the president-elect’s team felt it was important. But the incoming first lady, who spent her first four years in office redefining the role and what was expected, is laying an early marker indicating she will have even more autonomy the second time around.\n     \nAside from 2020, it has been tradition for the current first lady to host the incoming first lady at the White House. In 2016, then-first lady Michelle Obama hosted Melania Trump for tea in the White House’s Yellow Oval Room and took her on a tour of the private residence.\n     \n            CNN has reached out to the East Wing for comment.\n     \nThis story has been updated with additional information.\n © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
        },
        {
            "source": {
                "name": "Associated Press"
            },
            "author": "WYATTE GRANTHAM-PHILIPS",
            "title": "Bitcoin has topped $87,000 for a new record high. What to know about crypto's post-election rally - The Associated Press",
            "description": "As money continues to pour into crypto following Donald Trump’s election victory, bitcoin has climbed to yet another record high. The world’s largest cryptocurrency topped $87,000 for the first time on Monday. That’s part of a rally seen across cryptocurrenci…",
            "url": "https://apnews.com/article/bitcoin-price-record-trump-election-rally-crypto-9a22f5b5ce24824d7df5a3ab4a58e8a0",
            "urlToImage": "https://dims.apnews.com/dims4/default/3aa3b14/2147483647/strip/true/crop/5439x3059+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F57%2Fc37c128df7a221e2409e2deb49b0%2Fb4cf327f51c0499fad81b28824a6604d",
            "publishedAt": "2024-11-11T23:48:00Z",
            "content": "Copyright 2024 The Associated Press. All Rights Reserved. FILE - Republican presidential candidate former President Donald Trump speaks at the Bitcoin 2024 Conference Saturday, July 27, 2024, in Nashville, Tenn. (AP Photo/Mark Humphrey, File) FILE - Bitcoin logos are displayed at the Inside Bitcoins conference and trade show on April 7, 2014, in New York. (AP Photo/Mark Lennihan, File) FILE - Republican presidential candidate former President Donald Trump arrives to speak at the Bitcoin 2024 conference, Saturday, July 27, 2024, in Nashville, Tenn. (AP Photo/Alex Brandon, File)       NEW YORK (AP) — As money continues to pour into crypto following Donald Trump’s reelection last week, bitcoin has climbed to yet another record high. The world’s largest cryptocurrency topped $89,000 for the first time, briefly peaking at $89,995 early Tuesday, according to CoinDesk. Bitcoin’s price oscillated throughout the day, but is still up more than 27% over the last week — standing at about $88,288 as of 5 p.m. ET. That’s part of a rally across cryptocurrencies and crypto-related investments since Trump won the U.S. presidential election. Analysts credit much of the recent gains to an anticipated “crypto-friendly” nature of the incoming administration, which could translate into more regulatory clarity but also leeway. Still, as with everything in the volatile cryptoverse, the future is hard to predict. And while some are bullish, others continue to warn of investment risks. Here’s what you need to know. Cryptocurrency has been around for a while now, but has come under the spotlight in recent years. In basic terms, cryptocurrency is digital money. This kind of currency is designed to work through an online network without a central authority — meaning it’s typically not backed by any government or banking institution — and transactions get recorded with technology called a blockchain.  Bitcoin is the largest and oldest cryptocurrency, although other assets like Ethereum, Tether and Dogecoin have gained popularity over the years. Some investors see cryptocurrency as a “digital alternative” to traditional money — but it can be very volatile, and reliant on larger market conditions. \n A lot of the recent action has to do with the outcome of last week’s election.  Trump was previously a crypto skeptic, but changed his mind and embraced cryptocurrencies during this year’s presidential race. He has pledged to make the U.S. “the crypto capital of the planet” and create a “strategic reserve” of bitcoin. His campaign accepted donations in cryptocurrency and he courted fans at a bitcoin conference in July. He also launched World Liberty Financial, a new venture with family members to trade cryptocurrencies. Crypto industry players welcomed Trump’s victory, in hopes that he would be able to push through legislative and regulatory changes that they’ve long lobbied for. And Trump had previously promised that, if elected, he would remove the chair of the Securities and Exchange Commission, Gary Gensler, who has been leading the U.S. government’s crackdown on the crypto industry and repeatedly called for more oversight. “Crypto rallied as Election Day progressed into the night and as it became increasingly clear that Trump would emerge victorious,” Citi analysts David Glass and Alex Saunders wrote in a Friday research note, pointing to larger industry sentiment around Trump being “crypto-friendly” and a potential shift in regulatory backing. But even before the post-election rally, assets like bitcoin posted notable gains over the past year or so. Much of the credit goes to early success of a new way to invest in the asset: spot bitcoin ETFs, which were approved by U.S. regulators in January.  Inflows into spot ETFs, or exchange-traded funds, “have been the dominant driver of Bitcoin returns from some time, and we expect this relationship to continue in the near-term,” Glass and Saunders noted. They added that spot crypto ETFs saw some of their largest inflows on record in the days following the election. In April, bitcoin also saw its fourth “halving” — a preprogrammed event that impacts production by cutting the reward for mining, or the creation of new bitcoin, in half. When that reward falls, so does the number of new bitcoins entering the market. And, if demand remains strong, some analysts say this “supply shock” can also help propel the price long term. Crypto assets like bitcoin have a history of drastic swings in value — which can come suddenly and happen over the weekend or overnight in trading that continues at all hours, every day. In short, history shows you can lose money as quickly as you’ve made it. Long-term price behavior relies on larger market conditions. At the start of the COVID-19 pandemic, bitcoin stood at just over $5,000. Its price climbed to nearly $69,000 by November 2021, in a time marked by high demand for technology assets, but later crashed during an aggressive series of Federal Reserve rate hikes aimed at curbing inflation. Then came the 2022 collapse of FTX, which significantly undermined confidence in crypto overall. At the start of last year, a single bitcoin could be had for less than $17,000. Investors, however, began returning in large numbers as inflation started to cool — and gains skyrocketed on the anticipation and then early success of spot ETFs. While some crypto supporters see the potential for more record-breaking days, experts still stress caution, especially for small-pocketed investors.  “Investors should only dabble in crypto with money that they can be prepared to lose,” Susannah Streeter, head of money and markets at Hargreaves Lansdown, said last week. “Because we’ve seen these wild swings in the past.” Assets like bitcoin are produced through a process called “mining,” which consumes a lot of energy. And operations relying on pollutive sources have drawn particular concern over the years. Recent research published by the United Nations University and Earth’s Future journal found that the carbon footprint of 2020-2021 bitcoin mining across 76 nations was equivalent to the emissions from burning 84 billion pounds of coal or running 190 natural gas-fired power plants. Coal satisfied the bulk of bitcoin’s electricity demands (45%), followed by natural gas (21%) and hydropower (16%). In the U.S., the Energy Information Administration notes that crypto mining across the country has “grown very rapidly over the last several years,” adding that grid planners have begun to express concern over increases in related electricity demand. Preliminary estimates released by the EIA in February suggest that annual electricity use from crypto mining probably represents between 0.6% to 2.3% of U.S. electricity consumption. Environmental impacts of bitcoin mining boil largely down to the energy source used. Industry analysts have maintained that clean energy has increased in use in recent years, coinciding with rising calls for climate protections from regulators around the world. AP Business Writer Kelvin Chan contributed to this report from London. Copyright 2024 The Associated Press. All Rights Reserved."
        },
        {
            "source": {
                "name": "CNBC"
            },
            "author": "Kevin Breuninger",
            "title": "Trump's 'border czar' could have more power, fewer hurdles on deportation policy - CNBC",
            "description": "Tom Homan, President-elect Donald Trump's \"border czar,\" has a post that does not need Senate approval and could have less oversight by Congress, experts say.",
            "url": "https://www.cnbc.com/2024/11/11/trump-border-czar-congress-immigration-tom-homan.html",
            "urlToImage": "https://image.cnbcfm.com/api/v1/image/108061002-1731343324732-108061002-1731343216058-gettyimages-935194658-2018203_WAP20180320354.jpeg?v=1731343337&w=1920&h=1080",
            "publishedAt": "2024-11-11T23:02:01Z",
            "content": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  President-elect Donald Trump's pick to carry out his sweeping deportation plans may be able to operate with more power, and less oversight from Congress, than some of his own Cabinet members. That's because the appointee, former U.S. Immigration and Customs Enforcement acting Director Tom Homan, will not be put directly in charge of the Department of Homeland Security or a subagency tasked with addressing immigration issues. Homan will instead be the Trump administration's \"border czar,\" a title that could grant him significant influence over immigration and border policy without the formal authority — and guardrails — that come with being a Cabinet secretary. Trump announced Homan's selection in a Sunday night post on his Truth Social platform, putting the immigration hard-liner \"in charge of our Nation's Borders.\" Homan will also \"be in charge of all Deportation of Illegal Aliens back to their Country of Origin,\" Trump wrote in the post. Unlike Cabinet nominees — or the roughly 1,200 other federal roles that require Senate confirmation — Homan will not need congressional approval to serve under Trump. And he may be insulated from other forms of legislative branch scrutiny, experts told CNBC. \"White House appointees are subject to less oversight than Cabinet and sub-Cabinet officials,\" said Katherine Hawkins, senior legal analyst at the Project on Government Oversight. \"It is much harder for Congress to enforce subpoenas against White House officials, and they are more likely to cite executive privilege and refuse to testify and have that refusal upheld by courts,\" Hawkins said. Those staffers may lack the formal authorization of Congress, but that does not necessarily mean they are subordinate to their Senate-confirmed counterparts. \"Who is actually more powerful in practice depends on things like access to the president, and Cabinet and other agency officials' willingness to refuse White House demands,\" Hawkins said. A spokesperson for the Trump transition declined CNBC's request for comment. Lee Gelernt, an attorney with the American Civil Liberties Union who has helped challenge immigration policies during the Trump and Biden administrations, agreed. Homan's lack of an agency position \"will not decrease his influence and may make it harder to have meaningful checks on his actions,\" he said. Faisal Al-Juburi, chief external affairs officer of the immigrant rights advocacy group RAICES, said czars can make major policy impacts \"while simultaneously obstructing congressional oversight, which is critical to ensuring accountability of those acting on behalf of the U.S. government.\" The posts \"create opaque circumstances that make it difficult, if not impossible, to determine who maintains authority over policies that stand to have a wide-ranging impact on the American people,\" Al-Juburi said. Taken at face value, Trump's post gives Homan a massive amount of power. When the new administration takes control on Jan. 20, 2025, Homan will be in charge of implementing what was a central promise of Trump's presidential campaign: deporting millions of undocumented immigrants. Homan's purview includes, but is \"not limited to, the Southern Border, the Northern Border, all Maritime, and Aviation Security,\" Trump wrote. Carrying out a mass deportation plan would involve unprecedented logistical challenges and require intricate, large-scale cooperation between federal government agencies, local law enforcement sources, host nations and other entities. The process of locating, detaining and removing that many people, including mixed-status families with children, would be fraught, and the costs would be astronomical, NBC News has reported. Homan, 62, has been one of the loudest supporters of the policy. A regular on Fox News and a speaker at the 2024 Republican National Convention, he reportedly vowed earlier this year to \"run the biggest deportation force this country has ever seen.\" Homan has been called the father of the Trump administration's highly controversial \"zero tolerance\" border policy, which resulted in the separation of thousands of immigrant families and was reversed by Trump in 2018. When asked in a recent interview with CBS' \"60 Minutes,\" whether mass deportations could happen without family separation, Homan said: \"Of course there is. Families can be deported together.\" Gelernt said that given Homan's actions during Trump's first administration and his subsequent statements, he expects the appointment will \"have far reaching anti-asylum, anti-immigrant implications.\" How Homan will be able to wield his power is unclear. \"It is extremely doubtful whether anyone on the White House staff, the sort of person sometimes called a czar, could actually exercise legal authority,\" professor John Harrison of the University of Virginia School of Law told Congress in 2009. But \"as a practical matter,\" those staffers can still wield significant influence over policy decisions, Harrison told CNBC in an interview Monday. Hawkins pointed to Trump senior policy aide Stephen Miller, saying he \"was probably the single most influential policy voice on immigration and border issues\" during the Republican's first White House term. \"DHS officials pushed back to some extent,\" she said, \"but Miller lasted the longest and was closest to Trump and usually got his way.\" Miller is expected to be tapped as Trump's deputy chief of staff for policy, NBC reported Monday. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
        },
        {
            "source": {
                "id": "associated-press",
                "name": "Associated Press"
            },
            "author": "MICHELLE L. PRICE, JILL COLVIN, ZEKE MILLER, MATTHEW DALY",
            "title": "Trump names former Rep. Lee Zeldin to lead EPA, adviser Stephen Miller to be deputy chief of policy - The Associated Press",
            "description": "President-elect Donald Trump has named former New York congressman Lee Zeldin to lead the Environmental Protection Agency as he continues to build out his future administration with loyal supporters. Trump says Zeldin, a Republican who mounted a failed bid fo…",
            "url": "https://apnews.com/article/trump-stephen-miller-policy-immigration-9cc6ad3118779b23bff88022ca5e2260",
            "urlToImage": "https://dims.apnews.com/dims4/default/0f57a9d/2147483647/strip/true/crop/5402x3039+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F4b%2Fe7b3b608fd80ccfdfffb5f93b410%2Fa8bedf847b4340dfbcb5578197c7d91a",
            "publishedAt": "2024-11-11T22:14:00Z",
            "content": "NEW YORK (AP) President-elect Donald Trump on Monday named former New York congressman Lee Zeldin to lead the Environmental Protection Agency as he continues to build out his future administration wi… [+4863 chars]"
        },
        {
            "source": {
                "name": "Hollywood Reporter"
            },
            "author": "Kevin Dolak",
            "title": "‘Gladiator II’: Critics Mostly Give Thumbs Up to Ridley Scott’s Epic Blockbuster Sequel - Hollywood Reporter",
            "description": "While many of the reviewers who got an early look at the follow-up to the 2001 best picture winner said it's largely a rehash, most of them were dazzled by its battles and epic scope.",
            "url": "http://www.hollywoodreporter.com/movies/movie-news/gladiator-2-reviews-roundup-what-critics-saying-1236058643/",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2024/10/GL2_12129R-H-2024.jpg?w=1296&h=730&crop=1",
            "publishedAt": "2024-11-11T21:52:00Z",
            "content": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter While many of the reviewers who got an early look at the follow-up to the 2001 best picture winner said it's largely a rehash, most of them were dazzled by its battles and epic scope. \n\t\t\t\t\t\t\tBy \n\n\tKevin Dolak\n \n\tThe reviews are in for Gladiator II ahead of its nationwide release next week, and the critics are, for the most part, not giving it the thumbs down, writing resoundingly solid reviews for the action epic that comes to theaters decades after the 2000 Ridley Scott-directed best picture Oscar winner. The sequel has a 77 percent freshness rating on Rotten Tomatoes and a 67 average on Metacritic or “generally favorable” reviews. \nGladiator II is set years after the events of the blockbuster hit Gladiator, starring Russell Crowe and Joaquin Phoenix. In the sequel, Lucius Verus, portrayed by Paul Mescal, the son of Crowe’s Maximus, is forced to fight in the Colosseum after his home is conquered by Rome’s tyrannical emperors. Pedro Pascal’s General Marcus Acacius lays siege to Lucius’ home of Numidia and he must draw on his past to find the strength and honor to restore Rome to its former glory. Denzel Washington steps into a rare villainous role as Macrinus, a former slave turned master of gladiators.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tLifestyle\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tPaul Mescal to Star in 'A Streetcar Named Desire' in New York and London\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tMovies\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'Gladiator II' Review: Paul Mescal and a Scene-Stealing Denzel Washington in Ridley Scott's Entertaining but Imitative Sequel\t\t\n\t\t\t\n\n\n\n\n\n\n \n\tThe sequel continues director Scott’s breakneck pace of large-scale Hollywood epic feature films, reviving and revisiting film franchises he originated over his lengthy career, as he did directing Prometheus and Alien: Covenant. Scott was nominated for a best director Oscar for the original Gladiator, and it seems he brings the epic scope of that blockbuster back to tell the tale in the sequel. \nThe Hollywood Reporter‘s own David Rooney told readers that the film is a bit of a rehash that works, writing that “in terms of brutal spectacle, elaborate period reconstruction and vigorous set pieces requiring complex choreography, the sequel delivers what fans of its Oscar-winning 2000 predecessor will crave — battles, swordplay, bloodshed, Ancient Roman intrigue. That said, there’s a déjà vu quality to much of the new film, a slavishness that goes beyond the caged men forced to fight for their survival and seeps into the very bones of a drama overly beholden to the original.” \n\tThe BBC’s Caryn James writes that “Mescal, a counterintuitive choice given his sensitive roles in Normal People and Aftersun, is the mesmerizing center of the film, holding it together with the same power and magnetism Russell Crowe brought to the original. The sequel has a less perfect balance between emotion and action than the first, with beheadings and swordfights almost overwhelming the characters, but it comes close enough.”\n\n\t\n\n\n\n\n\n\n\n\n \n\tNick Schager, critic at The Daily Beast, seems a bit less enamored, writing that the sequel is “an elaborate imitation of its predecessor. If little more than a cover song, however, it’s a majestic and malicious one that reaffirms its maker’s unparalleled gift for grandiosity.” \n\tFinding himself to be a fan of this blockbuster epic after all, The Guardian’s Peter Bradshaw expressed the same thought as Schager when he wrote that even though Scott’s return to the Roman arena is something of a repeat, it’s “still a thrilling spectacle and Mescal a formidable lead. We are entertained.” \nEmpire magazine’s Boyd Hilton wrote that “what could have been a ponderous, predictable sequel to a much-loved Oscar-winner instead turns out to be a fun romp. However Gladiator II fares this awards season, it’s a hell of a ride.” \n\tNot everyone liked Scott’s return to Rome, though. Alison Willmore of New York magazine wrote, “The thrill of the action sequences just underscores the hollowness of the rest of the enterprise. Sure, not all of us spend a lot of time thinking about the Roman Empire, but those who do deserve better than this.” \n\tAnd The Film Verdict’s Alonso Duralde writes, “Unfortunately, Scott has chosen not to fill every one of the 148 minutes with quotable moments or with a strapping Paul Mescal taking on soldiers, sharks or mad monkeys, and when Gladiator II is being neither wild nor crazy, it’s all a little dull.” \nGladiator II is set to hit theaters on Nov. 22.\n\n\t\n\n\n\n\n\n\n\n\n Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form."
        },
        {
            "source": {
                "name": "Financial Times"
            },
            "author": "Alex Rogers, Lauren Fedor, Aime Williams",
            "title": "Donald Trump to appoint immigration hawk Stephen Miller as deputy chief of staff - Financial Times",
            "description": "Adviser championed policies during president-elect’s first term that included separating migrants from their children",
            "url": "https://www.ft.com/content/b3086f55-d22c-4c6f-9b46-0bf4b59b5d76",
            "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff6d7cab0-e864-498e-9415-39057121ecb5.jpg?source=next-barrier-page",
            "publishedAt": "2024-11-11T21:10:24Z",
            "content": "Want a deeper look? The new FT Digital Edition: today’s FT, cover to cover on any device. This subscription does not include access to ft.com or the FT App. Essential digital access to quality FT journalism on any device. Pay a year upfront and save 20%. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Terms & Conditions apply See why over a million readers pay to read the Financial Times."
        },
        {
            "source": {
                "name": "Nbcsportsphiladelphia.com"
            },
            "author": "Dave Zangaro",
            "title": "Eagles snap counts: Jalyx Hunt sees significant time vs. Cowboys - NBC Sports Philadelphia",
            "description": "Here’s a complete look at Eagles snap counts from the Eagles’ Week 10 win over the Cowboys.",
            "url": "https://www.nbcsportsphiladelphia.com/nfl/eagles-snap-counts-jalyx-hunt-sees-significant-time-vs-cowboys/629681/",
            "urlToImage": "https://media.nbcsportsphiladelphia.com/2024/09/Hunt-J-USATSI-2172678521.jpg?quality=85&strip=all&resize=1200%2C675",
            "publishedAt": "2024-11-11T21:09:55Z",
            "content": "ARLINGTON, Texas — Coming into Sunday’s game in North Texas, rookie third-round pick Jalyx Hunt had played a total of just 17 defensive snaps all season. He more than doubled his season total in one game. Hunt played 25 defensive snaps against the Cowboys and many of them came before the Eagles began to pull their starters in the fourth quarter of their 34-6 win at AT&T Stadium. Hunt even saw the field on Sunday before Bryce Huff, who is still dealing with a wrist injury that has limited the big-money free agent acquisition. Here’s how the edge rusher snaps shook out: Josh Sweat 37 snaps (62%), Hunt 25 (42%), Brandon Graham 22 (37%), Nolan Smith 22 (37%), Huff 12 snaps (20%). Obviously, the Eagles pulled their starters and veterans late in Sunday’s game but Hunt’s expanded role wasn't simply because of that. On Wednesday, head coach Nick Sirianni was asked about Huff’s role going forward and brought up Hunt on his own. “I think all four of those guys have done a nice job,” Sirianni said. “Then we'll see Jalyx getting into the mix as well. I think he's been doing a good job at practice to be able to go.”  It’ll be worth monitoring the usage of Hunt and Huff the rest of the season. There’s a chance that Hunt will continue to be a part of the rotation if he’s giving the Eagles some juice. He did against the Cowboys when he had a good rush that turned into a batted pass that was nearly picked off by Nakobe Dean. Other defensive notes • Veteran cornerback Darius Slay played 24 of 60 defensive snaps after suffering an ankle injury on the third play of the game when he broke up a pass. Slay was in and out of the lineup as Isaiah Rodgers (36 snaps) continued to replace him. Slay has been solid when healthy this season but he has dealt with knee, groin and now an ankle injury. Slay had his ankle wrapped after the game and said he’d be fine but it’s a quick turnaround for a Thursday night game. • No defensive players played all 60 snaps but C.J. Gardner-Johnson was the closest. He played 57 of 60, followed by Cooper DeJean, Quinyon Mitchell and Reed Blankenship, who each played 52. • Mitchell and DeJean played well in their 52 snaps. They each gave up just 2 receptions on a total of 9 targets, according to NFL NextGen Stats. • At linebacker, Zack Baun played 51 snaps (85%), while Nakobe Dean played 44 (73%). Baun filled up the stat sheet with 8 tackles, 2 forced fumbles, 1 TFL and 1 fumble recovery. • At defensive tackle, Jalen Carter led the way with 43 snaps (72%), followed by Moro Ojomo 27 snaps (45%), Milton Williams 27 snaps (45%), Jordan Davis 21 snaps (35%) and Thomas Booker 7 snaps (12%) • The Eagles got a chance to empty their bench late so Oren Burks played 14 snaps, while Kelee Ringo, Sydney Brown and Jeremiah Trotter Jr. each got 8. Offensive notes • The Eagles were able to pull their starters early in the fourth quarter, which is a nice boost going into a Thursday Night Football game against the Commanders, who had to fight and claw in a loss to the Steelers on Sunday. • The only starters who played all 68 offensive snaps were Fred Johnson and Mekhi Becton. Teams just don’t have enough backup offensive linemen on game day to rest everyone. • Jalen Hurts, Cam Jurgens, Lane Johnson and Landon Dickerson played 54 of 68 snaps, while Kenny Pickett, Tyler Steen, Nick Gates and Jack Driscoll played the remaining 14 snaps in the fourth quarter. • Saquon Barkley had to play just 35 of 68 snaps and had just 15 touches. That’s important if you’ve been worried about his workload. Barkley had 78 yards on those touches. Kenny Gainwell played 22 snaps, while Will Shipley got 11. • Dallas Goedert made his return after a three-game absence with a hamstring injury and caught a second-quarter touchdown. He led the way for the tight ends, playing 43 snaps but Grant Calcaterra was right behind him with 42 and Jack Stoll played 17. • At wideout, A.J. Brown had a quiet 109-yard performance that featured another 40+ yard catch. He played 50 snaps, followed by DeVonta Smith (49), Jahan Dotson (30), Johnny Wilson (18) and Ainias Smith (18). • After clearing the NFL’s concussion protocol in a week, Ben VanSumeren was active and played 5 snaps on offense and didn’t see the field on defense. He continues to be used in that lead blocker role. Subscribe to Eagle Eye anywhere you get your podcasts: Apple Podcasts | YouTube Music | Spotify | Stitcher | Simplecast | RSS | Watch on YouTube"
        },
        {
            "source": {
                "id": null,
                "name": "GSMArena.com"
            },
            "author": "Prasad",
            "title": "Mac mini 2024 gets a teardown, has no user upgradeable parts - GSMArena.com",
            "description": "Looks better on the inside than most computers do on the outside. Apple's 2024 Mac mini recently went on sale and has already gone through the teardown...",
            "url": "https://www.gsmarena.com/mac_mini_2024_gets_a_teardown_has_no_user_upgradeable_parts-news-65273.php",
            "urlToImage": "https://fdn.gsmarena.com/imgroot/news/24/11/mac-mini-m4-teardown/-952x498w6/gsmarena_000.jpg",
            "publishedAt": "2024-11-11T21:01:01Z",
            "content": "Apple's 2024 Mac mini recently went on sale and has already gone through the teardown treatment. Today, we are taking a look at once such teardown by YouTube creator Brandon Geekabit, who is performi… [+3378 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Mary Whitfill Roeloffs",
            "title": "Will Trump Eliminate The Department Of Education? What We Know As Elon Musk Applauds ‘Good Idea.’ - Forbes",
            "description": "Trump has said he’ll close the Department of Education “very early” in his administration. Here’s what that could mean.",
            "url": "https://www.forbes.com/sites/maryroeloffs/2024/11/11/will-trump-eliminate-the-department-of-education-what-we-know-as-elon-musk-applauds-good-idea/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67326c09e0571ffac123f7d4/0x0.jpg?format=jpg&crop=3388,1907,x0,y13,safe&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-11-11T20:47:38Z",
            "content": "President-elect Donald Trump has repeatedly vowed to shutter the federal Department of Education and relegate all educational responsibility to individual statesa move that could impact crucial fundi… [+8003 chars]"
        },
        {
            "source": {
                "name": "Space.com"
            },
            "author": "Mike Wall",
            "title": "SpaceX launching 24 Starlink satellites from Florida today after weather delay - Space.com",
            "description": "It was the second Florida launch by SpaceX on Nov. 11.",
            "url": "https://www.space.com/spacex-starlink-launch-group-6-69",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/9MQntfRCdxX8XwKftU9m7a-1200-80.png",
            "publishedAt": "2024-11-11T20:47:33Z",
            "content": "It was the second Florida launch by SpaceX on Nov. 11. \nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n SpaceX launched 24 new Starlink internet satellites into orbit from Florida's Space Coast and landed a rocket at sea in the second of back-to-back launches today (Nov. 11). A Falcon 9 rocket carrying the Starlink spacecraft streaked into the afternoon sky over Cape Canaveral Space Force Station on Monday at 4:28 p.m. EST (2128 GMT). The launch had originally been planned for Sunday evening, but was delayed due to \"unfavorable recovery weather conditions,\" according to SpaceX. It was also pushed back nearly a half-hour on launch day. About 8 minutes after launch, the Falcon 9's first stage returned to Earth for a vertical touchdown on the SpaceX droneship \"A Shortfall of Gravitas,\" which was stationed in the Atlantic Ocean. It was the 12th launch and landing for this particular booster, according to a SpaceX mission description. Five of its previous 11 flights were Starlink missions. The Falcon 9's upper stage, meanwhile, continued carrying the 24 Starlink satellites to low Earth orbit (LEO) and was expected to deploy them there about 65 minutes after liftoff.  — SpaceX launches 20 Starlink internet satellites from California on Oct. 30 (video) — 8 ways that SpaceX has transformed spaceflight — Starlink satellites: Facts, tracking and impact on astronomy Monday's launch followed on the heels of another Starlink mission, which lifted off from California's Vandenberg Space Force Base early on Saturday morning (Nov. 9). It also came just over four hours after a different Falcon 9 rocket launched the Koreasat-6A communications satellite from NASA's Pad 39A at the Kennedy Space Center in Florida earlier on Monday. SpaceX has now launched 106 Falcon 9 missions in 2024. Nearly 70% of them have been dedicated to building out the Starlink megaconstellation, which currently consists of more than 6,500 active spacecraft. Breaking space news, the latest updates on rocket launches, skywatching events and more! Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Michael Wall is a Senior Space Writer with Space.com and joined the team in 2010. He primarily covers exoplanets, spaceflight and military space, but has been known to dabble in the space art beat. His book about the search for alien life, \"Out There,\" was published on Nov. 13, 2018. Before becoming a science writer, Michael worked as a herpetologist and wildlife biologist. He has a Ph.D. in evolutionary biology from the University of Sydney, Australia, a bachelor's degree from the University of Arizona, and a graduate certificate in science writing from the University of California, Santa Cruz. To find out what his latest project is, you can follow Michael on Twitter. China planning to build its own version of SpaceX's Starship SpaceX Dragon fires thrusters to boost ISS orbit for the 1st time Good news everyone! 'The Art of Futurama' by Matt Groening crash lands today Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. "
        }
    ]
}