{
    "status": "ok",
    "totalResults": 33,
    "articles": [
        {
            "source": {
                "name": "Associated Press",
                "article_id": 1
            },
            "author": "MIKE CORDER",
            "title": "Assailants attack Israeli soccer fans in Amsterdam. The violence was condemned as antisemitic - The Associated Press",
            "description": "Dutch authorities say people on scooters attacked Israeli fans overnight after a soccer game in Amsterdam apparently fueled by calls to target Jewish people spread online.",
            "url": "https://apnews.com/article/maccabi-tel-aviv-amsterdam-violence-protests-palestinian-bcea212281f682098c4c77ef552af5f1",
            "urlToImage": "https://dims.apnews.com/dims4/default/7eda329/2147483647/strip/true/crop/3024x1701+0+2/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F49%2Fe195da0d66b6f18fe2a9f7a52540%2Fcb9213b4bbc64cf993871f61e396c7ff",
            "publishedAt": "2024-11-08T14:09:00Z",
            "content": "Copyright 2024 The Associated Press. All Rights Reserved. Dutch authorities say antisemitic rioters attacked Israeli soccer fans after a match between Ajax and Maccabi Tel Aviv. Amsterdam police say five people have been hospitalized and 62 arrested. In this image taken from video, police escort Maccabi Tel Aviv supporters to the metro station leading them to the Ajax stadium, after pro-Palestinian supporters marched near the stadium, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) Amsterdam’s Mayor Femke Halsema, centre, acting Amsterdam police chief Peter Holla, left, and head of the Amsterdam public prosecutor’s office René de Beukelaer hold a news conference after Israeli fans and protesters clashed overnight after a soccer match, in Amsterdam, Netherlands, Friday Nov, 8, 2024. (AP Photo/Mike Corder) In this image taken from video, police stand guard forming a line near the Ajax stadium, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, police detain a man near the Ajax stadium, after pro-Palestinian supporters marched despite a ban on pro-Palestinian demonstrations near the soccer stadium, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, police frisk pro-Palestinian supporters near the Ajax stadium in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, pro-Palestinian supporters march with Palestinian flags near the Ajax stadium in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, police detain a person next to the place where Maccabi Tel Aviv supporters gather ahead of the Europa League soccer match between their team and Ajax, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, police escort Maccabi Tel Aviv supporters to the metro, after pro-Palestinian supporters marched near the soccer stadium, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) In this image taken from video, police stand guard as Maccabi Tel Aviv supporters light flares at the Dam square, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) Eran Zahavi of Maccabi Tel Aviv, center, arrives at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov) Eran Zahavi of Maccabi Tel Aviv, center, arrives at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov) Ben Mansford, CEO of Maccabi Tel Aviv, speaks to the media as he arrives at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov) People welcome Maccabi Tel Aviv soccer fans as they arrive at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov) People welcome Maccabi Tel Aviv soccer fans as they arrive at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov) Maccabi Tel Aviv soccer fans arrive at Israel’s Ben-Gurion International Airport on a flight from Amsterdam, where Israeli soccer fans were attacked following a match between the Israeli club and Ajax Amsterdam, in Lod, Israel, Friday, Nov. 8, 2024. (AP Photo/Tsafrir Abayov)                                AMSTERDAM (AP) — Israeli fans were assaulted after a soccer game in Amsterdam by hordes of young people apparently riled up by calls on social media to target Jewish people, Dutch authorities said Friday. Five people were treated at hospitals and dozens were arrested after the attacks, which were condemned as antisemitic by authorities in Amsterdam, Israel and across Europe. Reports of antisemitic speech, vandalism and violence have been on the rise in Europe since the start of the war in Gaza, and tensions mounted in Amsterdam ahead of Thursday night’s match between the Dutch team Ajax and Maccabi Tel Aviv. Pro-Palestinian demonstrators were banned by local authorities from gathering outside the stadium, and video showed a large crowd of Israeli fans chanting anti-Arab slogans on their way to the game. Afterward, youths on scooters and on foot crisscrossed the city in search of Israeli fans, punching and kicking them and then fleeing quickly to evade police, Amsterdam Mayor Femke Halsema said. On the social media platform Telegram, “there is talk of people going on a Jew hunt,” Halsema said. “That is so shocking and so despicable that I still cannot fathom it.” Dutch Minister of Justice and Security David van Weel vowed to track down and prosecute the perpetrators. AP correspondent Charles de Ledesma reports leaders condemn Israeli fans attacked in the Dutch capital. Police had to escort some fans back to hotels, according to authorities. In this image taken from video, pro-Palestinian supporters march with Palestinian flags near the Ajax stadium in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) Ofek Ziv, a Maccabi fan from the Israeli city of Petah Tikva, said someone threw a rock at his head, causing light bleeding, as he and a friend left the stadium. He said a group of men began to chase him, before he and his friend got into a taxi, picked up other fans and took shelter at a hotel. In this image taken from video, police frisk pro-Palestinian supporters near the Ajax stadium in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) \n “I’m very scared, it’s very striking,” Ziv said. “And the police didn’t come to help us.” Another Israeli fan, Alyia Cohen, said upon arriving back in Israel that he would go back to Amsterdam for future matches. “We are not afraid of anything, ours is the people of Israel.”  Five people were treated in the hospital and released, while some 20 to 30 people suffered light injuries, police said. At least 62 suspects were arrested, with 10 still in custody, the city’s public prosecutor, René de Beukelaer, told reporters at a news conference Friday. A statement from Prime Minister Benjamin Netanyahu’s office said he “views the horrifying incident with utmost gravity.” He demanded that the Dutch government take “vigorous and swift action” against those involved. Condemnation of the violence poured in from around Europe. “Antisemitism has absolutely no place in Europe, and we are determined to fight it and to fight all forms of hatred,” said Ursula von der Leyen, the president of the European Commission. “We want Jewish life and culture to thrive in Europe.” Dutch Prime Minister Dick Schoof condemned the violence and flew home early from a European Union summit in Hungary. The attacks shattered Amsterdam’s long-cherished view of itself as a beacon of tolerance and haven for persecuted religions, including Sephardic Jews from Portugal and Spain who fled to the city centuries ago. Police said security will be beefed up at Jewish institutions across the city, which has a large Jewish community and was home to Jewish World War II diarist Anne Frank and her family as they hid from Nazi occupiers. In this image taken from video, police detain a man near the Ajax stadium, after pro-Palestinian supporters marched despite a ban on pro-Palestinian demonstrations near the soccer stadium, in Amsterdam, the Netherlands, Thursday, Nov. 7, 2024. (AP Photo InterVision) Halsema, Amsterdam’s mayor, described the violence as “an eruption of antisemitism that we had hoped never again to see in Amsterdam.” In the past, Ajax was known as a soccer club with links to Amsterdam’s Jewish community because visiting fans had to pass the city’s Jewish quarter to get to the club’s former stadium. Ajax fans sometimes wave Star of David flags and chant the Dutch word for Jews. Israel’s foreign minister, Gideon Saar, flew to Amsterdam on Friday and in a message on X he said that hatred of Jews is “appearing in place after place after place.” Saar met with the Dutch minister for security and justice, pledging Israeli help in the investigation, and also held talks with Geert Wilders, a far right, anti-Islam lawmaker whose party won national elections last year. Amsterdam police spokeswoman Sara Tillart said it was too early in their investigation to say if anybody other than soccer fans was targeted. Authorities outlawed demonstrations across the city for the weekend and gave police extra powers to frisk people. Israel’s government initially ordered two planes sent to Amsterdam to bring fans home, but Netanyahu’s office later said it would work to help citizens arrange commercial flights. Maccabi’s CEO, Ben Mansford, spoke to reporters at Israel’s international airport as some fans returned. “Lots of people went to watch a football game ... to support Israel, to support the star of David,” he said. For them to be attacked, “that’s very sad times for us all given the last year we’ve had.” Tensions had been brewing in Amsterdam for days ahead of the match. A Palestinian flag was torn down from a building in Amsterdam on Wednesday, Dutch broadcaster NOS reported, and authorities banned a pro-Palestinian demonstration near the stadium. Ahead of the game, large crowds of supporters of the Israeli team could be seen on video chanting anti-Arab slogans as they headed to the stadium, escorted by police.  “Let the IDF win, and (expletive) the Arabs,” the fans chanted, using the acronym of the Israeli military, as they shook their fists. It also showed police pushing several pro-Palestinian protesters away from a Maccabi fan gathering in a square earlier in the day. Security issues around hosting games against visiting Israeli teams led the Belgian soccer federation to decline to stage a men’s Nations League game in September. That game against Israel was played in Hungary with no fans in the stadium. Israel was exiled from the Asian Football Confederation in the 1970s after Arab nations refused to play against it. Israel played in European qualifying for the 1982 World Cup and has been a member of European soccer body UEFA since 1994. The violence in Amsterdam will no doubt lead to a review of security at upcoming matches involving Israeli teams. UEFA had announced Monday that a Maccabi match initially to be played in Istanbul on Nov. 28 against the Turkish team Besiktas, would be moved to a yet-to-be-decided neutral venue. Italian police said security was increased for Maccabi Tel Aviv’s basketball game at Virtus Bologna Friday night, both for fans and for the Maccabi team. Israel’s national soccer team is scheduled to play France in Paris on Nov. 14 in the Nations League. French Interior Minister Bruno Retailleau said Friday the match would go ahead as planned. “I think that for a symbolic reason we must not yield, we must not give up,” he said, noting that sports fans from around the world came together for the Paris Olympics this year to celebrate the “universal values” of sports. Associated Press reporters Julia Frankel and Ibrahim Hazboun in Jerusalem, Lee Keath in Cairo, Graham Dunbar in Geneva, and Raf Casert in Brussels, contributed to this report.  Copyright 2024 The Associated Press. All Rights Reserved."
        },
        {
            "source": {
                "name": "TMZ",
                "article_id": 2
            },
            "author": "TMZ Staff",
            "title": "Bhad Bhabie Suggests She May Have Cancer on Instagram, Fans Freak Out - TMZ",
            "description": "Bhad Bhabie issued a cryptic message that has many of her fans concerned, implying that she may have cancer.",
            "url": "https://www.tmz.com/2024/11/08/bhad-bhabie-may-have-cancer-danielle-bregoli/",
            "urlToImage": "https://imagez.tmz.com/image/b6/16by9/2024/11/08/b6e1d90bc4594cf1a4ae9b5314a287d8_xl.jpg",
            "publishedAt": "2024-11-08T13:14:13Z",
            "content": "UPDATE 10:15 AM PT -- A family source confirms to TMZ ... Bhad Bhabie does have cancer. She's currently under the care of a doctor. Bhad Bhabie issued a cryptic message that has many of her fans concerned, implying that she may have cancer. Bhabie, AKA Danielle Bregoli, hopped on Instagram Thursday and posted, \"I'm Sorry my cancer medicine made me loose [sic] weight. I'm slowly gaining it back. So stop running w the worst narratives.\" Of course, it's a mystery what all that means ... but Bhabie recently revealed her dramatic weight loss in photos she posted to her social media accounts. Many of her supporters expressed concern and support online after she brought up cancer. Waiting for your permission to load the Instagram Media. One person wrote ... \"Bhad Bhabie’s strength shines through as she shares her diagnosis. Wishing her resilience and support on this journey.\" Another stated, \"Wtffff omg doesn't she have an infant child? Praying for Bhad Bhabie, may she fully recover.\" And a third said, \"F*** cancer\" in a post, before adding, 'We Are On Make Me Pray For You.\" Again, it's not clear if Bhabie has cancer ... but we've reached out to her reps for an answer. So far, no word back. Meanwhile, back in March, Bhabie announced her and her boyfriend, Le Vaughn, were the proud parents of a baby girl three months after she confirmed they were having their first child. Let's hope Bhabie is cancer-free for the sake of her family. Originally Published -- 5:14 AM PT Yes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of Use"
        },
        {
            "source": {
                "name": "USA Today",
                "article_id": 3
            },
            "author": "Sudiksha Kochi, Riley Beggin",
            "title": "Election 2024 live updates: An updated tally on final House races as they're called - USA TODAY",
            "description": "Keeping tabs on the final tally as control of the House of Representatives remains up for grabs with dozens of races still undecided.",
            "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/08/election-2024-updates-house-of-representatives-control/76125967007/",
            "urlToImage": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/11/07/USAT/76108415007-usatsi-23750116.jpg?crop=5231,2943,x0,y348&width=3200&height=1801&format=pjpg&auto=webp",
            "publishedAt": "2024-11-08T13:03:35Z",
            "content": "WASHINGTON - Control of the House of Representatives remains up for grabs as the vote counting heads into the weekend in two dozen pivotal U.S. House races, with both parties hoping to seize the lower chamber for 2025. It's a last chance at power for Democrats after Donald Trump claimed the White House while Republicans gained a majority in the Senate. It will take 218 seats to rule the House, and although neither party has reached the threshold, the numbers appear to favor the GOP. The Associated Press count showed Democrats at 199 seats while Republicans had claimed 212 by early Friday evening, including three seats that the GOP flipped from the Democrats. You can follow the latest results from coast to coast and check out the races in your state here. Keep up with live coverage from across the USA TODAY Network. Sign-up for Your Vote: Text with the USA TODAY elections team. Republican Rep. Don Bacon will serve a fifth term in Congress representing Nebraska’s 2nd congressional district, according to the Associated Press, which called his race at 6:11 p.m. EST Friday. He beat Democratic challenger and state Sen. Tony Vargas by 2.4 points.  Sign-up for Your Vote: Text with the USA TODAY elections team. Bacon’s margin of victory in 2024 is just below his win two years ago, when he also faced Vargas and won by 2.6 percentage points. In this year’s May primary, he fended off hardline conservative and Omaha businessman Dan Frei, who had the backing of Nebraska’s state party.  The district, encompassing Omaha and area west of the city, earned the nickname “blue dot” after going for Biden by over six points in 2020.  – Savannah Kuchar and Maya Marchel Hoff  House Minority Leader Hakeem Jeffries, D-N.Y., said in an interview with Spectrum News NY1 on Thursday that he thinks Democrats still have a “clear pathway” to winning back control of the House, noting that he’s been keeping an eye on races in the west. “And if I have the opportunity to continue to lead House Democrats in either the majority or the minority, it certainly would be an opportunity to and continue to be a great honor,” Jeffries added in the interview.  Republicans, who flipped the Senate to their control and won the presidency, are confident they can keep control of the House too. So far, 211 seats have been won by Republicans while 199 have been won by Democrats, according to the latest count from the Associated Press.  Jeffries said in the interview that Democrats have to “fully and comprehensively reevaluate what have we done right, and where have we fallen short.”  “I think that there are lessons to be learned from this election in all directions,” he said.  - Sudiksha Kochi House Speaker Mike Johnson, R-La., sent a letter on Wednesday morning to his Republican colleagues asking them to back him for another term leading the chamber, even as key races remain uncalled and there's been no final call on which party will be in the majority next year.   “I’m ready to take the field with all of you, and I am humbly asking for your support to continue leading this Conference as your Speaker,” Johnson wrote in the letter. “It has been the honor of my lifetime to serve with you thus far, and I look forward to playing the biggest offense of our lives. We have a country to save—and we will.” Republicans appear poised to keep control of the House, after flipping the Senate to their control and winning the White House.  House Majority Leader Steve Scalise, R-La., also sent a letter to his GOP colleagues on Wednesday asking them to back him again for the No. 2 spot.  “I have already met with President Trump multiple times during the last year to discuss our shared goals so we will be ready to begin this work quickly and hit the ground running on day one in January,” Scalise wrote.  - Sudiksha Kochi Rep. Marcy Kaptur, D-Ohio, has been in Congress for 41 years. As the legislature’s longest-serving woman, the 78-year-old Democrat is looking to win another term by defeating her Republican opponent, Derek Merrin.  Theirs is one of the closest matchups left to be called. As of Friday morning, Kaptur was ahead by 0.3 percentage points with 99% of votes in.  - Rachel Barber Democrat Janelle Bynum’s challenge to first-term Rep. Lori Chavez-DeRemer, a Republican endorsed by Donald Trump, resulted in a tight race that continued into Friday.  Bynum, a state representative, is attempting to flip the seat representing suburbs and areas south of Portland. Both candidates are small business owners who promised to represent common interests and work across the aisle.  As of Friday morning, Bynum had a 2.4% lead over Chavez-DeRemer with 78% of votes counted.  - Rachel Barber Freshman Rep. Yadira Caraveo, D-Colo., who is seeking a second term, was leading Republican Gabe Evans by less than one percentage point with 88% of votes counted Friday morning.  Representing a split electorate in an area north of Denver, Yadira has a reputation as a moderate willing to break from her party, including when she was one of six House Democrats who voted to condemn the Biden administration for its handling of the southern border.   - Rachel Barber Rep. Jared Golden, a Democrat, is vying to hold onto his seat in a district occupying most of Maine north of Portland. He faces Republican challenger Austin Theriault, a state representative and former NASCAR driver.  Golden has represented Maine’s 2nd Congressional District since 2018. Voters in the primarily rural region have stuck with the moderate Democrat, while going for Trump in 2020 and backing him again in 2024.  As of Friday morning, Golden had less than half a percentage point lead over Theriault with 98% of votes counted. - Rachel Barber With most precincts reporting, a little more than 1% margin remained Friday morning between Democrat April McClain Delaney and Republican Neil Parrott in the race to represent Maryland's 6th congressional district that spans the westernmost part of the state.  A lawyer whose husband previously represented the district, McClain Delaney worked in the Department of Commerce during the Biden administration. Parrott served in the Maryland House of Delegates for over a decade. Both ran campaigns promising to govern with “common sense” and portraying their opponent as out of touch or extreme.  - Rachel Barber Rep. David Schweikert, R-Ariz., is in the midst of what many have called the most contentious election of his 13-year career.  As of Friday morning, the Arizona lawmaker who represents the 1st congressional district that covers Scottsdale held a 3.8 percentage point lead over his Democratic opponent, Amish Shah, with 76% of the vote counted so far. - Rachel Barber Democrat Kirsten Engle was leading Rep. Juan Ciscomani, R-Ariz., by a little more than 200 votes with 72% of precincts reporting Friday morning.  Their race to represent Arizona's 6th congressional district that includes Tuscon marks the second time Ciscomani and Engel have faced off and remains too close to call. Ciscomani is seeking a second term and a win for him would boost Republicans looking to hold onto the House. - Rachel Barber Republican Rep. Ken Calvert, R-Calif., was leading Democrat Will Rollins by 3% as of Friday morning with 54% of the vote counted.   Calvert is the state’s longest-serving House member, having been in office since 1992 and fended off multiple challengers over the years, including Rollins in 2022. He is looking to keep his seat representing California’s 41st Congressional District, southeast of Los Angeles. - Rachel Barber With 71% of votes counted as of Friday at 9:30 a.m., less than 700 votes differentiated the candidates in a race to represent California District 47, which encompasses Orange County and includes Irvine, Huntington Beach, Costa Mesa and Newport Beach. It's a battle to take the seat previously held by Rep. Katie Porter, a Democrat, after her failed Senate run.  This year’s race is between two attorneys: Democrat Dave Min and Republican Scott Baugh, who is currently ahead but lost to Porter by more than 9,000 votes in 2022. Baugh is a former California Assembly member and served as chair of the Orange County Republican Party for a decade. Min worked for U.S. Sen. Chuck Schumer as a senior economic advisor and voters elected him to the California Senate in 2020. - Rachel Barber If Republicans win control of the House, the party will control both chambers of Congress, and the White House - a trifecta.From swift appointments of Trump's Cabinet choices to major changes in policy, Republicans in Congress are likely to use their leverage to advance Trump‘s priorities and will likely face few roadblocks from the Democratic minority. \"This historic election has proven that a majority of Americans are eager for secure borders, lower costs, peace through strength, and a return to common sense,\" House Speaker Mike Johnson, R-La., said in a statement Wednesday, even as the House has not yet been called for Republicans and Democrats insist it is still in play. -- Riley Beggin What do the election results mean for you?Sign up for USA TODAY's On Politics newsletter for breaking news and exclusive analysis."
        },
        {
            "source": {
                "name": "Investor's Business Daily",
                "article_id": 4
            },
            "author": "ED CARSON, Investor's Business Daily",
            "title": "Futures Mixed On Earnings, China - Investor's Business Daily",
            "description": "Arista, Cloudflare, Affirm, Axon and more reported. The major indexes are up sharply for the week.",
            "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-earnings-china-stimulus-fed-trump/",
            "urlToImage": "https://www.investors.com/wp-content/uploads/2024/02/Stock-jeromepowell-01-shutt.jpg",
            "publishedAt": "2024-11-08T12:33:00Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "CBS News",
                "article_id": 5
            },
            "author": "Kathryn Watson, Melissa Quinn, Tucker Reals, Jacob Rosen, Graham Kates, Camilo Montoya-Galvez",
            "title": "What could Trump's second term bring? Deportations, tariffs, Jan. 6 pardons and more - CBS News",
            "description": "Former President Donald Trump will be the 47th president of the United States. Here's what that could mean.",
            "url": "https://www.cbsnews.com/news/second-trump-presidency-implication/",
            "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/06/f252cb88-cd68-4eff-89fe-f915d666becb/thumbnail/1200x630/b4172f147ec69d139bcb59fc83540d24/ap24311400234175-1.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7",
            "publishedAt": "2024-11-08T12:06:00Z",
            "content": "Watch CBS News \n    By\n                        \n                      Kathryn Watson, \n                              \n                      Melissa Quinn, \n                              \n                      Tucker Reals, \n                              \n                      Jacob Rosen, \n                              \n                      Graham Kates, \n                              \n                      Camilo Montoya-Galvez\n \nUpdated on:  November 9, 2024 / 7:33 AM EST\n          / CBS News\n         When President-elect Donald Trump is inaugurated in January, he'll assume the powers of the presidency with a surer sense of what he wants to accomplish and how to get it done, after four years on the job and four years planning his return. A Republican-controlled Senate likely puts his nominees on a glide path to confirmation, while the question of House control is still being determined.  Here's what may be in store for Trump's second term, based on what he's said since he left office in 2021: Trump has praised those who breached the Capitol building on Jan. 6, 2021, as \"patriots\" and referred to them as \"hostages\" of a Justice Department \"weaponized\" against him. He has said that those who were arrested as a result of their actions during the Capitol riot should be freed, and he vowed to pardon a \"large portion\" of the more than 1,000 people who have been convicted of or pleaded guilty to crimes stemming from the Jan. 6 attack. Even before his election victory, defendants were trying to delay their cases, anticipating pardons. At least one defendant invoked Trump's win in an effort to delay proceedings in his case; lawyers for 21-year-old Christopher Carnell said in a filing the day after the election that Trump has \"made multiple clemency promises\" to Jan. 6 defendants and wrote that Carnell is \"expecting to be relieved of the criminal prosecution that he is currently facing when the new administration takes office.\" They said Carnell \"is now awaiting further information from the Office of the President-elect regarding the timing and expected scope of clemency actions relevant to his case.\" His request was swiftly denied. At a recent Trump rally in North Carolina, an attendee yelled at Trump to \"pardon the January sixers.\" Trump looked at the man and replied, \"Yeah, it's true.\" Trump told conservative radio host Hugh Hewitt recently that he'd fire special counsel Jack Smith, who has brought two federal criminal indictments against him, \"within two seconds\" of becoming president. Smith was appointed independent special counsel by Attorney General Merrick Garland to oversee Trump's federal criminal investigations and cases.  The Justice Department and special counsel Jack Smith's office are engaged in active discussions about how to wind down the ongoing federal prosecutions against President-elect Donald Trump, according to two people familiar with the talks. At the center of the discussions is the Justice Department's longstanding policy against prosecuting a sitting president and the need to enable a smooth transition to a second term in the White House for Trump, the sources said. Experts told CBS News the Justice Department is likely to drop Trump's federal criminal cases. Smith charged Trump with four counts stemming from his conduct after the 2020 election, as he and others sought to overturn his defeat in that race.  That case appeared to be heading for a spring 2024 trial before Trump's lawyers appealed a decision related to presidential immunity to the Supreme Court, which in July concluded former presidents cannot be prosecuted for official acts during their time in office. In a separate federal criminal case in Florida, Trump was accused of mishandling sensitive government records. The judge dismissed the case in July, ruling Smith had been unlawfully appointed special counsel by the attorney general. Smith has appealed the decision.  If he had been convicted in the federal cases, he could have tried to pardon himself because the Constitution confers broad pardon power. But Trump can't pardon himself from his New York conviction in a case stemming from a \"hush money\" payment because that's a state offense. His sentencing date is set for Nov. 26, but it remains to be seen whether that will go forward.  Trump could simply move to dismiss the cases against him, said Mark Tushnet, a constitutional law scholar at Harvard Law School.  \"He won't have to pardon himself — as the chief executive and chief law enforcement office of the U.S. government, he can simply order that the prosecutions be dismissed,\" Tushnet said.  In Fulton County, Georgia, Trump's 2020 election interference case has been delayed amid allegations of impropriety against the district attorney. That delay is likely to now be extended. Lead Trump attorney Steve Sadow told a judge in a hearing last December that proceedings would not be pushed off indefinitely if Trump won the presidency, suggesting 2029 is the year the trial could resume. Trump has given mixed responses on the future of the Federal Reserve chair he appointed in 2018, Jerome Powell. In February, Trump said he wouldn't reappoint Powell.  But after Trump won this year's presidential election, Powell said he would not leave if asked to resign by Trump. Powell's term expires in 2026.  In February, Trump said he had a \"couple of choices\" for Fed chair, but didn't say who those options might be.  Trump has accused Powell of being \"political.\" However, in July, he told Bloomberg Businessweek, \"I would let him serve it out,\" Trump said, and he added, \"especially if I thought he was doing the right thing.\" Beyond the question of who would lead the Fed is a bigger issue: Trump has previously said he thinks the U.S. president should have more influence on Fed decisions — a risk to the central bank's historical independence from political meddling, according to experts. \"I feel the president should have at least a say in there. Yeah, I feel that strongly,\" Trump said in an Aug. 8 press conference at his Mar-a-Lago club in Florida. \"I think that, in my case, I made a lot of money, I was very successful, and I think I have a better instinct than, in many cases, people that would be on the Federal Reserve or the chairman.\" Trump will expect the Fed to support economic growth by continuing to ease borrowing costs for consumers and businesses while containing inflation. That amounts to a delicate balancing act, given some of the president-elect's key economic policies, like imposing stiff new tariffs, boosting federal spending and deporting undocumented immigrants, could lead to higher prices. Supreme Court justices sometimes try to time their retirements with a presidential administration corresponding to the party of the president who appointed them. When Trump takes office, there will be three justices who were appointed by previous Republican presidents — Chief Justice John Roberts, and Justices Clarence Thomas and Samuel Alito. Trump nominated the other three members of the conservative wing during his first term — Justices Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett. Thomas is the longest-serving member of the court, having been nominated by President George H.W. Bush and confirmed by the Senate in 1991. Roberts and Alito were both tapped for the court by President George W. Bush in 2005 and 2006, respectively. Thomas, 76, and Alito, 74, are also the two oldest members of the Supreme Court. None of those three justices have publicly indicated an interest in leaving the Supreme Court. Trump's Supreme Court nominations during his first term widened the court's conservative majority from 6-3, and replacing any of the three other members would maintain that ideological split. Any nominations during Trump's second term would likely be of younger judges who could serve for decades, ensuring a conservative hold on the court for years to come. Gorsuch and Kavanaugh were in their 50s when he nominated them, and Barrett was 48.  Trump told CBS News in August that he'd release a list of potential Supreme Court nominees ahead of the election, but that list never arrived.  At his final campaign stop in Pennsylvania before Election Day, Trump again promised to start mass deportations, but acknowledged \"it's terrible to do.\"  \"I don't want to do that. I'm not looking to do that,\" Trump said. \"I think it's terrible to do, but we have no choice.\" Nearly 80% of undocumented immigrants in the U.S. have been in the country a decade or more, and millions of them work and have families here. A concerted effort to round up, detain and deport people by the millions would not only raise legal and human rights concerns, it would cost billions of dollars a year.   But Trump told NBC News after winning the election that there is \"no price tag.\"  \"It's not a question of a price tag,\" he told NBC, adding, \"We have no choice. When people have killed and murdered, when drug lords have destroyed countries and now they're going to go back to those countries because they're not staying here. There is no price tag.\" Trump has said he may start with deporting undocumented migrants in Springfield, Ohio, and Aurora, Colorado — two communities targeted by his campaign rhetoric. He said in his debate with Harris that in Springfield, migrants were \"eating the dogs\" and cats, and said of Aurora that it was being overrun by Venezuelan gangs. Local and state officials of both parties disputed Trump's claims.  Trump has long cast doubts on the threat of climate change and prioritized increasing U.S. oil and gas production. \"Drill, baby, drill\" became a refrain at campaign rallies. He has vowed to unlock new lands for drilling, expedite drilling permits and speed up approval of natural gas pipelines.  Trump has also expressed desire to dismantle the Inflation Reduction Act and redistribute any unspent climate funds, which, among other things, support electric vehicle production, EV tax credits, and incentives for battery production and critical mineral mining.  Such a move could prove unpopular with consumers, the automotive industry and even some members of his own party, who have recently supported certain programs funded by the IRA that have brought major manufacturing projects and jobs to conservative districts. Eliminating the individual tax credits for EV could be catastrophic for the automotive industry, which continues to see EV sales numbers grow, and many companies are basing production goals on these growing sales numbers. If the tax incentive is revoked, it would make EVs more expensive and harder to sell. One of Trump's most prominent backers, billionaire Tesla CEO Elon Musk, has benefitted from EV incentives.  During his first term, Trump withdrew the U.S. from the Paris Climate Agreement, which included national goals for reducing greenhouse gas emissions. Mr. Biden later rejoined the accords. Trump's record on climate issues has prompted warnings from scientists and climate activists about the accelerating dangers of failing to move rapidly toward clean energy and more sustainable development. \"The science on climate change is unforgiving, with every year of delay locking in more costs and more irreversible changes,\" said Rachel Cleetus, the policy director and lead economist for the Climate and Energy Program at UCS. Climate advocates say four more years of Trump policies will mean the most robust action to fight climate change will need to be pursued at the state and local level, as well as by the business sector. Kennedy's name has been floated to oversee a variety of health-related issues in a second Trump administration, including to run the Department of Health and Human Services. It's unclear, though, whether a nomination to a Cabinet position would receive the necessary support from Senate Republicans. Sen. Marco Rubio, a Florida Republican, told CNN that the Senate will \"give great deference to a president that just won a stunning, what I think is an Electoral College landslide when all is said is done and a mandate.\" \"He's being given a mandate to govern, and I think presidents who are given a mandate to govern deserve from the Senate the opportunity to surround themselves with people who are going to execute their policies,\" Rubio said.  Kennedy has spent years promoting false information and fears about vaccines, baselessly linking vaccines to autism long after such claims were disproven. He also falsely claimed COVID-19 was \"ethnically targeted\" to attack certain ethnic groups while sparing Ashkenazi Jews and Chinese people — a conspiracy theory that drew accusations of antisemitism and racism. Kennedy also claimed Trump would push to remove fluoride from drinking water, a pet project of Kennedy's.  Kennedy has said recently that he doesn't want to take vaccine options away from Americans, but his skepticism of them and conspiracy-laden views on science and medicine alarm public health experts.  Kennedy has also campaigned against pesticide use in agriculture and processed food additives.  During a rally in Henderson, Nevada, Trump suggested Kennedy would \"work on health and women's health,\" and said on election night that Kennedy is \"going to go make America healthy again.\" In an interview with conservative commentator Tucker Carlson last week, Trump said Kennedy \"can do whatever he wants,\" adding that he'd like the one-time independent presidential candidate to look at pesticides and vaccines. \"I want you to take care of the women of this country, the men of this country and the children of this country,\" he said. When NBC News recently asked Trump if \"banning certain vaccines\" might be on the table, Trump didn't dismiss the idea outright, saying he would make a decision and referred to Kennedy as a talented man with \"strong views.\"  Trump has said he would boost economic growth through a combination of cutting taxes and eliminating regulations on business. Specifically, he is expected to push Congress to extend the sweeping tax cuts enacted under the 2017 Tax Cuts & Jobs Act (TCJA), many of which are set to expire at the end of 2025.  Trump has also proposed lowering corporate taxes to 15% from their current level of 21%; reversing a $10,000 deduction cap on state and local property taxes; ending taxes on tipped wages and overtime pay; and eliminating taxes on Social Security benefits. If Congress extends the TCJA cuts, income taxes would decline under Trump for Americans of all incomes, but the biggest beneficiaries would be high-income households, according to an analysis by the University of Pennsylvania's Penn Wharton Budget Model.  Overall, Trump's tax cuts would lower federal revenue by $5.8 trillion over the next 10 years, adding to the nation's mounting debt, Penn Wharton estimates. The national debt has grown significantly under both Trump and Mr. Biden in the last eight years.  On the regulatory front, Trump has pledged to remove federal restrictions on fossil fuel production, eliminate red tape in housing construction and ease rules on cryptocurrencies, among other efforts. Investors expect such moves to drive up corporate profits and, in turn, stock prices. Trump has said he wants to impose tariffs on all international imports, which economists generally believe will lead to an increase in the price of goods.  Trump pledged to impose 10% across-the-board levies on all products imported to the U.S. from overseas, something he says will protect American jobs and raise more federal revenue, which suggests that he believes that high tariffs would force companies to bring production back to the U.S., creating American jobs, and therefore more taxable revenue.  But most economists say that would likely backfire. Manufacturers would pass costs on to consumers, effectively creating  a new tax on Americans. Trump also proposed a levy of 60% or more on Chinese imports — so, in total, if these tariffs were enacted, a typical middle-class household  would face an estimated $1,700 a year in additional costs, according to the non-partisan Peterson Institute for International Economics.  Trump has been inconsistent on questions surrounding LGBTQ rights, but during his first term, he rolled back protections for LGBTQ people — especially transgender individuals — and anti-trans rhetoric became a theme of his 2024 campaign. His campaign spent tens of millions on one such high-visibility ad that ran during the World Series, NFL and college football games with the memorable tagline \"\"Kamala is for they/them. Trump is for you.\"  The Trump administration reversed a policy that required schools to allow transgender students to use bathrooms that correspond with their gender identity. His administration banned some transgender people from serving in the military — a policy that Mr. Biden reversed. And he also tried to repeal health protections for transgender people and sought to end protections for transgender individuals in federal prison, among other policies. During his campaign, Trump pledged to use his second term to punish doctors who provide gender affirming care for minors and impose consequences for teachers who discuss it with their minor students.  The president-elect's stances on abortion have been contradictory in the years since he began running for the presidency. He's touted the Supreme Court's 2022 decision overturning a constitutional right to abortion in Roe v. Wade, taking credit for appointing three of the justices who joined the majority ruling.  He frequently says the issue should be left up to the states — some of which have imposed near-total abortion bans. Trump has also pledged not to sign a national abortion ban.  \"My view is now that we have abortion where everybody wanted it from a legal standpoint, the states will determine by vote or legislation, or perhaps both, and whatever they decide must be the law of the land,\" Trump said in April. At the presidential debate with Harris, Trump said, \"I'm not signing a ban,\" adding that there's \"no reason to sign a ban because we've gotten what everybody wanted.\" In October, he went further, saying he'd veto a national abortion ban. Anti-abortion advocates have called for further restrictions on abortion through a law already on the books. They believe the Comstock Act, which concerns the the shipping of materials deemed as \"obscene, lewd, lascivious, indecent, filthy or vile,\" could be applied to ban anything used to aid an abortion — not just the mailing of abortion pills. Trump told CBS News in August that he would not enforce the Comstock Act. On IVF, another reproductive rights issue that has come to the fore in recent months, Trump has pledged to expand access to the expensive fertility treatments. The pledge came in response to backlash following a ruling by the Alabama Supreme Court that determined that frozen embryos created during the IVF process could be considered children, raising the possibility of infanticide prosecutions if they're destroyed. This prompted clinics in the state to temporarily halt treatments. Democrats have warned that Republicans want to restrict access to the procedures, while blaming the Alabama ruling and threats to fertility treatments in other states on Trump. Trump announced last month a new plan that would require the federal government to pay for the fertility treatments or require insurance companies to cover costs associated with IVF. He has not said how the government would pay for the high cost of IVF, and the idea of an insurance mandate for IVF treatments runs counter to one of the main pursuits of his first term, the repeal of the Affordable Care Act. He did succeed in killing the law's individual mandate through the enactment of his 2017 tax cuts.  Israeli Prime Minister Benjamin Netanyahu was among the first foreign leaders to hail Trump's victory. \"Your historic return to the White House offers a new beginning for America and a powerful recommitment to the great alliance between Israel and America,\" Netanyahu said in a tweet even before Trump's election win was confirmed.  Netanyahu spoke to Trump in a \"warm and cordial\" phone call, his spokesperson said, adding that the two men \"agreed to work together for Israel's security\" and also discussed \"the Iranian threat.\" Trump has not said how he'll address Israel's still-expanding wars against Iran-backed Hamas in the Gaza Strip and Hezbollah in Lebanon, but he's suggested he can end the conflagration in the heart of the Middle East quickly.  Netanyahu, under intense domestic and international pressure over his handling of the multi-front war, has relied heavily on Washington, Israel's closest ally, for military and diplomatic backing to continue the fight. He will be urging Trump to keep that vital support coming amid intense international pressure over the humanitarian crises in Gaza and Lebanon, and growing domestic pressure over his handling of the war. But veteran Israeli diplomat, government adviser and now journalist Alon Pinkas told CBS News ahead of the U.S. election that in his view, Trump is a \"very transactional man\" who fails to understand the complexities of the wars Israel is fighting and the motivation behind them. \"He's war averse,\" Pinkas said of Trump, adding that the president-elect's isolationist tendencies presented \"a great risk\" for Israel. Even if Trump were to decide to back away from active support for Israel and essentially let Netanyahu do as he sees fit, without criticism or threats of suspending aid, Pinkas said that wouldn't be enough to ensure Israel's security. \"If you look at the last six months, about American involvement in intercepting Iranian ballistic missiles in April, in deploying a THAAD missile system in Israel just three weeks ago, in deterring Iran to the best of their ability and providing Israel hardware and munitions that otherwise Israel may not have received,\" said Pinkas, \"it's not enough that they write, the Congress…a blank check of $3.8 billion, which is the annual military aid, and say, 'leave us alone, do with it what you want.' There needs to be active American diplomacy.\" Trump will take over as the U.S. commander-in-chief amid the deadliest conflict on the European continent since World War II. He's said he can end the nearly three-year war sparked by Russia's full-scale invasion of Ukraine before he even takes office. Ukrainian President Volodymyr Zelenskyy said he had an \"excellent\" conversation with Trump after the election, adding that they had agreed to \"advance\" cooperation.  But on the campaign trail, Trump never said how he would end the war, and Ukrainians have voiced fear for months that he could do so by curbing the U.S. military and financial support — already worth more than $50 billion — which has been a lifeline for the country's defense, and force Zelenskyy to meet Russia's demands to cede occupied territory.  Any fresh attempt to end violence like this is likely to involve peace talks of some kind, but Russian President Vladimir Putin has said repeatedly that the war will not end until the areas his forces have unilaterally and illegally annexed — around a fifth of Ukraine's territory — are recognized as part of Russia.  Zelenskyy insists that all of Ukraine's land must be returned, and he's warned repeatedly that allowing Putin to seize ground will embolden the Russian leader, with direct implications for America. \"This aggression, and Putin's army, can come to Europe, and then the citizens of the United States, the soldiers of the United States, will have to protect Europe because they're the NATO members,\" Zelenskyy told CBS News early this year. There is clear precedent for Trump's stance on the U.S.-led NATO alliance that was born out of the military partnerships formed during World War II. During his first term and since, Trump has made it clear that he feels America's European NATO allies slipped into complacency, relying on their superpower partner for theoretical defense in what had been decades of peacetime.  He demanded publicly, repeatedly that some of America's oldest and closest allies meet their NATO membership commitment to devote at least 2% of their annual GDP to their defense budgets. Trump accused some allies of freeloading - benefitting from the guarantee of NATO's collective defense principle without paying their fair share. While the European jitters over the Ukraine war are undoubtedly a factor, his reprimands seem to have worked, to some degree. The majority of NATO member states now meet at least the 2% threshold. It's little wonder, perhaps, that the only two countries that devote more than the U.S. to defense, proportionally, are Poland, which borders Ukraine, and Estonia, which borders Russia.   There are still wider concerns, meanwhile, among NATO partners over the level of Trump's commitment to the alliance, and he vowed on the campaign trail to \"fundamentally reevaluate NATO's purpose and mission.\" \n\nAlain Sherter, \n                                                  \n                      Paula Cohen, \n                                                  \n                                  Imtiaz Tyab, \n                                                  \n                                  Mary Cunningham, \n                                                  \n                                  Kaia Hubbard and \n                                                  \n                                  Tracy J. Wholf\n                  \n        contributed to this report. \n      \n Kathryn Watson is a politics reporter for CBS News Digital, based in Washington, D.C. \n© 2024 CBS Interactive Inc. All Rights Reserved.\n Copyright ©2024 CBS Interactive Inc. All rights reserved."
        },
        {
            "source": {
                "name": "Barron's",
                "article_id": 6
            },
            "author": null,
            "title": "Notre Dame Bells Ring Out In Paris For First Time Since 2019 Fire - Barron's",
            "description": "The bells of Notre Dame in Paris rang out together on Friday for the first time since a 2019 fire that devastated the historic cathedral, AFP reporters said.",
            "url": "https://www.barrons.com/articles/notre-dame-bells-ring-out-in-paris-for-first-time-since-2019-fire-466132fa",
            "urlToImage": "https://asset.barrons.com/barrons/images/afp-metadata-default.jpg",
            "publishedAt": "2024-11-08T11:51:52Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "Reuters",
                "article_id": 7
            },
            "author": "Kevin Yao, Ellen Zhang",
            "title": "China unveils $1.4 trillion local debt package but no direct stimulus - Reuters",
            "description": "China unveiled a 10 trillion yuan ($1.40 trillion) debt package on Friday to ease local government financing strains and stabilise flagging economic growth, as it faces fresh pressure from the re-election of Donald Trump as U.S. president.",
            "url": "https://www.reuters.com/world/china/china-unveils-steps-tackle-hidden-debt-local-goverments-2024-11-08/",
            "urlToImage": "https://www.reuters.com/resizer/v2/SNM6NTOZSZKFZCXXDR5UNDWF4U.jpg?auth=5957fe170bdab4d65f28bf1cd0cf83e4b3d579308bc3f46715d6e47b6869ef75&height=1005&width=1920&quality=80&smart=true",
            "publishedAt": "2024-11-08T11:18:40Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "NBC News",
                "article_id": 8
            },
            "author": "Patrick Smith",
            "title": "Hurricane Rafael moves across Gulf of Mexico as a rare major November storm while Cuba recovers - NBC News",
            "description": "Rafael was moving west across the Gulf of Mexico on Friday morning as the first major hurricane in the Gulf in November for almost 40 years, bringing the threat of life-threatening conditions to the southern United States coastline.",
            "url": "https://www.nbcnews.com/weather/hurricanes/hurricane-rafael-moves-gulf-mexico-rare-major-november-storm-cuba-reco-rcna179273",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241108-cuba-rafael-mb-1100-e511b2.jpg",
            "publishedAt": "2024-11-08T11:11:16Z",
            "content": " Profile Sections tv Featured More From NBC Follow NBC News  news Alerts There are no new alerts at this time Rafael was moving west across the Gulf of Mexico on Friday morning as the first major hurricane in the Gulf in November for almost 40 years, bringing the threat of life-threatening conditions to the southern United States coastline. Forecasters said the storm could cause dangerous surf and riptides across the whole Gulf region in the coming days, after causing havoc in Cuba where millions are still without power. As of 4 a.m. ET, Rafael was 585 miles east of the mouth of the Rio Grande with sustained wind speeds of 120 mph, making it a Category 3 hurricane, moving west at a rate of 9 mph, the National Hurricane Center said. Rafael is now tied with Hurricane Kate in 1985 as the strongest storms recorded in the Gulf. The storm is expected to weaken throughout the weekend, but it could still produce tropical storm-force winds — which is between 39 and 73 mph — up to 115 miles from its center. Cuban President Miguel Díaz-Canel on Thursday visited areas hit by the storm and spoke to a team working to fix six electricity towers that were knocked down by winds of 115 mph earlier this week. The country's entire power network collapsed, the state-run operator UNE said, plunging the nation's 10 million people into darkness — the second full blackout on the island in the last month — with many areas still unconnected. More than 283,000 people were evacuated, 98,300 from the capital, authorities said.  The capital, Havana, with 2 million people living in densely packed and largely old buildings, is particularly vulnerable to natural disasters. Desperate locals made their way to hotels with their own generators in search of scarce power. \"It is the second time that we have to live through all that has happened: the weather and the problems with the energy grid of the country,\" local resident Mario de la Rosa Negrin told The Associated Press. \"The hotel offered, in solidarity, the power from their power plants to the neighbors so that people could charge their mobile phones and their lamps.\"  Rafael is the 17th named storm of the hurricane season. It is only the sixth hurricane to be recorded in the Gulf of Mexico in November and the third to be rated Category 2 or higher. The others were Ida in 2009, a Category 2 storm, and Kate in 1985, which was Category 3. Patrick Smith is a London-based editor and reporter for NBC News Digital. © 2024 NBCUniversal Media, LLC"
        },
        {
            "source": {
                "name": "ScienceAlert",
                "article_id": 9
            },
            "author": "Clare Watson",
            "title": "There's a Critical Thing We Can Do to Keep Alzheimer's Symptoms at Bay - ScienceAlert",
            "description": "Deep sleep could be key to forestalling slow declines in brain health that may one day lead to Alzheimer's disease, the most common form of dementia.",
            "url": "https://www.sciencealert.com/theres-a-critical-thing-we-can-do-to-keep-alzheimers-symptoms-at-bay",
            "urlToImage": "https://www.sciencealert.com/images/2023/05/PersonLyingInMRIMachineRedLaseLightOnHead.jpg",
            "publishedAt": "2024-11-08T11:04:29Z",
            "content": "Deep sleep could be key to forestalling slow declines in brain health that may one day lead to  Alzheimer's disease, the most common form of dementia. In their 2023 study of 62 older, cognitively healthy adults, researchers from the University of California (UC) Berkeley, Stanford University, and UC Irvine in the US found individuals with brain changes associated with Alzheimer's performed better on memory function tests as they got more deep sleep. This was irrespective of education and physical activity, two factors along with social connection known to contribute to cognitive resilience in older age. Those with similar Alzheimer's-linked changes who failed to get as much deep sleep didn't fare quite as well on the same tests. By comparison, sleep made little difference to those individuals with few deposits. Taken together, the results, which were published in May last year, imply having a generous amount of solid shut-eye could help support the decline in memory that sets in as dementia begins to take hold. \"Think of deep sleep almost like a life raft that keeps memory afloat, rather than memory getting dragged down by the weight of Alzheimer's disease pathology,\" said University of California (UC) Berkeley neuroscientist Matthew Walker. \"This is especially exciting because we can do something about it. There are ways we can improve sleep, even in older adults.\" The study echoes previous research which has found a build-up of amyloid-beta proteins in the brains of people with disrupted sleep. But poor sleep is both a risk factor for and a symptom of Alzheimer's disease, making it tricky to tease apart cause and effect. Likewise, clumpy amyloid-beta proteins might only be a sign of Alzheimer's disease, not its root cause. Even so, levels of amyloid-beta proteins are commonly used as a marker of Alzheimer's disease, as research suggests they – and another protein called tau – can start clogging up brain cells decades before symptoms of the disease arise. Past research from Walker's group found significant levels of amyloid-beta aggregating in the brains of older adults can disrupt deep sleep – also known as non-rapid eye movement slow wave sleep – and impair memory function. But some folk appear to stave off the decline that comes with Alzheimer's disease, even when levels of amyloid-beta proteins are relatively high. To find out why, Walker and colleagues monitored participants' brain waves as they slept, and then asked them to complete a memory test the next day. Among those whose brain scans revealed similarly high levels of beta-amyloid deposits, getting a good night's sleep seemed to make a critical difference in cognitive function. This effect was only seen when the researchers looked specifically at non-rapid eye movement slow wave sleep, and not at other sleep wave frequencies or sleep stages. Longer-term studies in older adults are needed to test whether increasing deep sleep over a number of years can actually help preserve a person's cognitive function in that time, even as levels of amyloid-beta increase. This research adds to scores of studies suggesting that sleep could be a modifiable risk factor for Alzheimer's disease, one that could potentially forestall molecular changes by giving the brain time to clean up waste products that accumulate during the day. It also points to sleep quality being important. \"With a certain level of brain pathology, you're not destined for cognitive symptoms or memory issues,\"  UC Berkeley neuroscientist and lead author Zsófia Zavecz said of the study findings in 2023. Although people may display molecular changes indicating a progression toward Alzheimer's disease, Zavecz says their findings suggest lifestyle factors can help buffer against those effects. \"One of those factors is sleep and, specifically, deep sleep,\" she said. The study, though small, also hints at why getting good sleep naturally might be a better option than taking sleeping pills to get some shut-eye. Recent research shows users of sleeping pills appear to have lower levels of amyloid proteins in their cerebrospinal fluid, which washes the brain clean at night. But these medications come with side effects; they may also lull people into shallow bouts of sleep rather than deep sleep phases. Instead, to set yourself up for a good night's sleep, Zavecz suggests cutting out  coffee late in the day, doing some exercise, avoiding screen time, and taking a hot shower before bed. While you snooze, rest assured scientists are working hard to figure out the knotty problems of Alzheimer's disease, which affects millions of people worldwide. The study has been published in BMC Medicine. A version of this article was first published in May 2023."
        },
        {
            "source": {
                "name": "NBC News",
                "article_id": 10
            },
            "author": "Sahil Kapur, Lawrence Hurley",
            "title": "Trump will name more conservative judges. He may even pick a majority of the Supreme Court. - NBC News",
            "description": "Republicans are gearing up to lock in their remake of the judiciary under President-elect Donald Trump and a new Senate majority, including potentially installing several more conservative Supreme Court justices.",
            "url": "https://www.nbcnews.com/politics/2024-election/trump-will-name-conservative-judges-may-even-pick-majority-supreme-cou-rcna179130",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-01/230121-supreme-court-justices-al-0827-e8fcfb.jpg",
            "publishedAt": "2024-11-08T10:00:00Z",
            "content": " Profile Sections tv Featured More From NBC Follow NBC News  news Alerts There are no new alerts at this time WASHINGTON — Republicans are gearing up to lock in their remake of the judiciary under President-elect Donald Trump and a new Senate majority, including potentially installing several more conservative Supreme Court justices. Having already picked three Supreme Court justices in his first term — who were critical in overturning abortion rights — Trump will have appointed a majority of the court if he lands two more. Trump made the Supreme Court and lower courts priorities in his first term. He worked with Senate Republicans to help reshape the entire judiciary by naming 234 federal judges. Republicans will hold at least 52 Senate seats, having flipped Democratic-held seats in West Virginia, Montana and Ohio. The number may grow, with several other races still too close to call. Either way, they’ll have power to confirm judges and justices with simple majorities. Conservatives are prepared for Supreme Court retirements, with the most attention on Justice Samuel Alito, 74. Follow 2024 election live updates “I imagine that Justice Alito will want to get the hell out of D.C. as quickly as possible,” said Mike Davis, the Senate GOP’s former chief counsel for nominations, who runs the conservative Article 3 Project advocacy group. “That’s who I would predict.”The top candidates to become the next Senate majority leader — John Thune, R-S.D., and John Cornyn, R-Texas — both plan to prioritize confirming judges under Trump. “Come January, we must be ready to confirm his nominees,” Cornyn said while mentioning other priorities like passing a budget, extending the Trump tax cuts and pursuing tougher border policies. A source close to Thune said that “confirming conservative judges will certainly be a priority,” calling Trump’s first term a “great” model to look to. When it comes to the Supreme Court, observers have their eyes on the two oldest conservatives. Justice Clarence Thomas, who has served on the court since 1991, will turn 80 by the next presidential election in 2028. He is close to being the longest-serving justice of all time, a mark he would reach that year. Alito, who wrote the 2022 ruling that overturned Roe v. Wade, has served since 2006 and turns 78 ahead of the next presidential election. Both are conservative stalwarts who are in some ways more aligned with the Trump wing of the GOP than the three justices Trump appointed in his first term. They have also both been subject to hostile scrutiny in recent years over allegations of ethical lapses. “I certainly expect there will be a vacancy, quite possibly two,” said John Malcolm, a lawyer at the conservative, Trump-allied Heritage Foundation who was among those who helped compile a list of potential high court nominees for Trump when he first ran in 2016. If Trump gets two appointments, he would be the first president since Franklin D. Roosevelt to have appointed a majority of justices to the court, a milestone he could reach as soon as the summer of 2026 depending on the timing of retirements. Trump’s previous appointees — Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett — have been instrumental in shifting the court further to the right with a 6-3 conservative majority. All three voted to overturn abortion rights and regularly joined rulings invalidating Biden administration actions. Davis, a pugnacious Trump supporter known for throwing rhetorical flames at Trump's critics, called his three justices the “most consequential accomplishment of his first term.” And there may be fresh criteria this time. “President Trump will build on that with even more bold and fearless judicial picks,” he said. “It means judges who will follow the law and don’t care what the liberal media says about them.” If Thomas or Alito steps down, Trump is likely to look to the dozens of appeals court judges he appointed in his first term to find candidates to replace them, some experts believe. Trump’s former White House counsel Don McGahn, who played a key role in judicial selections in the first term, spoke at a recent event about the importance of justices’ having “courage to do the job you’ve been given.” He added that some of Trump’s potential Supreme Court nominees are “certainly more strident” than earlier generations of conservative judges were. And among Democrats, anxieties are running high about whether Justice Sonia Sotomayor, 70, a lifelong diabetic, will hang on for four more years. Some Democrats had openly wondered this year whether she should step down and assure a liberal replacement, to avoid a repeat of what happened to former Justice Ruth Bader Ginsburg, who died during Trump's first term, which enabled him to swing the court to the right by picking Barrett. “Sonia Sotomayor needs to retire right now,” a Democratic official working in the Biden administration said within hours of NBC News’ projecting that Trump had won the presidency. If she does, there’s no rule prohibiting Democrats from confirming a potential Sotomayor successor in the lame-duck session. They wouldn’t need any Republican votes to do it. But some on the left who are familiar with the Senate confirmation process point out there is no guarantee that a replacement for Sotomayor would be confirmed in time. “I don’t think they could realistically confirm a replacement, and it would be risky,” said Alex Aronson, a former Democratic Senate staffer who now runs Court Accountability, a liberal legal group. Sotomayor didn’t respond to a request seeking comment on her plans, relayed via a Supreme Court spokeswoman. Sen. Chuck Grassley, R-Iowa, told NBC News in September he would seek to return as Judiciary Committee chairman if Republicans retake the majority. Grassley has seniority on the committee, which determines what judicial nominations the full Senate votes on. Ahead of the election, numerous Republican senators on the Judiciary Committee told NBC News they expected at least one, if not more, Supreme Court retirements should Trump prevail and their party win the Senate. Sen. Josh Hawley, R-Mo., said he believes the GOP would look to find more justices like Thomas or Alito, especially if they’re the ones being replaced. Unlike in 2016, Trump hasn’t issued a public list of potential Supreme Court nominees. But the task of identifying potential nominees is made easier for him because he now has a deep bench of lower court judges he appointed to pick from. “He has the luxury that he appointed several outstanding judges who have now been judges for a number of years, so they have a judicial track record,” said Malcolm of the Heritage Foundation. Among them are Judge Andrew Oldham of the New Orleans-based 5th U.S. Circuit Court of Appeals, who was a law clerk for Alito. Another is Judge Amul Thapar of the Cincinnati-based 6th U.S. Circuit Court of Appeals. He was Trump’s first appeals court nominee in 2017. Vice President-elect JD Vance’s wife, Usha Vance, clerked for Thapar when he was a district court judge. Other names conservative legal insiders frequently mention as potential Supreme Court nominees include Judge James Ho of the 5th Circuit appeals court, Neomi Rao of the U.S. Court of Appeals for the District of Columbia Circuit and Judge Patrick Bumatay of the San Francisco-based 9th U.S. Circuit Court of Appeals. Trump appointed all of them to their current positions. There are 47 vacancies on the lower courts — trial courts and the 13 influential courts of appeal — that President Joe Biden hasn’t filled. But waiting in the wings are dozens of Republican-nominated judges who in January would be eligible to retire on full pay but were most likely delaying doing so until there was a Republican president who could appoint their successors. There are 83 such judges, according to Russell Wheeler, a scholar at the nonpartisan Brookings Institution who tracks judicial nominations. Once Trump takes office, he will probably be able to fill most of those slots. Trump already transformed the federal courts in his first term, appointing 54 appeals court judges and 174 district court judges, many of whom are closely linked with the Federalist Society, a conservative legal group. Even putting aside the Supreme Court, those judges have had a major role to play in pushing the law to the right.  Biden has made his own mark on the judiciary, appointing 210 district and appeals court judges in total, including 44 appeals court judges, falling just short of Trump’s total. His appointees have been substantially more diverse than Trump’s, and he has also picked some with experience as public defenders or civil rights lawyers. To what extent Trump will follow the road map from his first term, in which he deferred to conservative lawyers like McGahn and legal activist Leonard Leo on judicial appointments, remains to be seen. Neither McGahn nor Leo responded to requests for comment on whether they will offer their advice this time around. In recent years, the Democratic-led Senate has sought to impose new ethics rules and organize inquiries into reports about potential corruption at the Supreme Court, only to get stymied by Republicans who used the filibuster to block the bills and prevent subpoenas from being enforced. Outgoing Senate Minority Leader Mitch McConnell, R-Ky., who shepherded Trump’s three justices through the chamber, said those efforts are likely to end under a GOP-led Senate. “We’ll quit beating up the Supreme Court every time we don’t like the decision they make,” he said. Sahil Kapur is a senior national political reporter for NBC News. Lawrence Hurley is a senior Supreme Court reporter for NBC News.  © 2024 NBCUniversal Media, LLC"
        },
        {
            "source": {
                "name": "NPR",
                "article_id": 11
            },
            "author": null,
            "title": "Judge strikes down Biden program shielding immigrant spouses from deportation - NPR",
            "description": "A federal judge on Thursday struck down a Biden administration policy that aimed to ease a path to citizenship for some undocumented immigrants who are married to U.S. citizens.",
            "url": "https://www.npr.org/2024/11/08/g-s1-33370/judge-biden-program-immigrant-spouses-deportation",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4b%2F49%2F8b03e3594c23a30cc90b1b0fd50b%2Fap24313214968767.jpg",
            "publishedAt": "2024-11-08T09:54:26Z",
            "content": "By  \n      The Associated Press\n    \n   \n                President Joe Biden is shown speaking with the U.S. Border Patrol and local officials, as he looks over the southern border, Feb. 29, 2024, in Brownsville, Texas, along the Rio Grande.\n                \n                    \n                    Evan Vucci/AP\n                    \n                \nhide caption\n A federal judge on Thursday struck down a Biden administration policy that aimed to ease a path to citizenship for some undocumented immigrants who are married to U.S. citizens. The program, lauded as one of the biggest presidential actions to help immigrant families in years, allowed undocumented spouses and stepchildren of U.S. citizens to apply for a green card without first having to leave the country. The temporary relief from deportation brought a brief sense of security to some 500,000 immigrants estimated to benefit from the program before Texas-based U.S. District Judge J. Campbell Barker put it on hold in August, days after applicants filed their paperwork. Barker ruled Thursday that the Biden administration had overstepped its authority by implementing the program and had stretched the legal interpretation of relevant immigration law “past its breaking point.” The short-lived Biden administration initiative known as “Keeping Families Together” would have been unlikely to remain in place after Donald Trump took office in January. But its early termination creates greater uncertainty for immigrant families as many are bracing for Trump's return to the White House. Trump's election victory this week sets the stage for a swift crackdown on undocumented individuals after the Republican ran on promises of “mass deportation.” The president-elect energized his supporters on the campaign trail with a litany anti-immigrant statements, including that immigrants were “poisoning the blood” of the nation. During his first term, Trump appointed Barker as a judge in Tyler, Texas, which lies in the 5th U.S. Circuit Court of Appeals, a favored venue for advocates pushing conservative arguments. Barker had placed the immigration initiative on hold after Texas and 15 other states, led by their Republican attorneys general, filed a legal challenge accusing the executive branch of bypassing Congress to help immigrant families for “blatant political purposes.” Republicans argued the initiative created costs for their states and could draw more migrants to the U.S. The policy would have applied to people who have been living continuously in the U.S. for at least 10 years, do not pose a security threat and have utilized the existing legal authority known as “parole in place” that offers deportation protections. Those married to a citizen by June 17, the day before the program was announced, could pay a $580 application fee and fill out a lengthy application explaining why they deserve humanitarian parole. If approved, applicants would have three years to seek permanent residency and obtain work authorization. It was not immediately clear Thursday whether anyone had received approval under the program, which only accepted applications for about a week before the federal judge placed it on hold. Noncitizen spouses are already eligible for legal status but often have to apply from their home countries. The process typically includes a years-long wait outside of the U.S., which can separate family members with different immigration statuses. Sponsor Message Become an NPR sponsor"
        },
        {
            "source": {
                "name": "HuffPost",
                "article_id": 12
            },
            "author": "Ed Mazza",
            "title": "Stephen Colbert Reveals The Most 'Disturbing' Part Of Trump's Big Comeback - HuffPost",
            "description": "The \"Late Show\" host can't get over this one alarming presidential plot twist.",
            "url": "https://www.huffpost.com/entry/stephen-colbert-trump-disturbing_n_672dbcdfe4b01e5999fcb601",
            "urlToImage": "https://img.huffingtonpost.com/asset/672dc9d21f00001b00b2690d.jpeg?cache=GITZUmFpYO&ops=1200_630",
            "publishedAt": "2024-11-08T08:26:49Z",
            "content": "Deputy Editor, Trends, HuffPost Stephen Colbert said Donald Trump’s victory this week in the presidential election had one immediate effect with the Justice Department reportedly winding down its criminal cases against him.  “So after years of investigation into Trump’s many crimes ― including trying to overthrow the U.S. government ― everything’s just totally cool,” Colbert said in disbelief. “It reminds me of that classic song, ‘I Fought The Law And What? I Won!? How Is That Possible?’”  Colbert called the move a “disturbing legal precedent” and offered a mocking take on where it could lead next.  Check it out in his Thursday night “Late Show” monologue:  By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy."
        },
        {
            "source": {
                "name": "CNN",
                "article_id": 13
            },
            "author": "Karina Tsui",
            "title": "‘We barely made it out’: Californians desperately flee their homes amid raging wildfires - CNN",
            "description": "Terrie Morin, 60, and her husband Dave were at the barber shop when they heard about a raging wildfire making headway toward their Camarillo home on Wednesday morning.",
            "url": "https://www.cnn.com/2024/11/08/us/californians-flee-homes-amid-raging-wildfires-hnk/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24312122907623.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-08T07:25:00Z",
            "content": "\n            Terrie Morin, 60, and her husband, Dave, were at a barber shop when they heard about a raging wildfire making headway toward their Camarillo home on Wednesday morning.\n     \n            The couple were hosting two guests at the time, but because their guests worked late, Morin suspected they slept through the residence‚Äôs fire alarms.\n     \n            ‚ÄúI run in the house, and I‚Äôm banging on the door, and they did not hear me. They were knocked out,‚Äù Morin told CNN. ‚ÄúGet the dog. Get out of here. You don‚Äôt have time, just get out!‚Äù she recalled telling them.\n     \n            Ten minutes later, Dave noticed sparks in their backyard. The temperature also was picking up.\n     \n            ‚ÄúIt was hot. It was so hot,‚Äù Morin recalled.\n     \n            Dozens of homes in Southern California‚Äôs Ventura County were set alight in a sweeping wildfire that burned through thousands of acres of land in just a matter of hours midweek ‚Äì‚Äì prompting authorities to send more than 14,000 evacuation notices across the region.\n     \n            The Mountain Fire began early Wednesday near the small community of Somis and, driven by winds gusting over 60 mph, soon damaged or destroyed homes in the nearby Camarillo area some 40 miles northwest of Los Angeles, Cal Fire said. The flames have seared through more than 20,700 acres of land, according to Cal Fire.\n     \n            The families who evacuated at a moment‚Äôs notice, some who say they have now lost their homes, must deal with other losses that can also be devastating, from daily essentials like medications and shoes to meaningful possessions such as sculptures and artwork, to treasured keepsakes from the birth of a child or the life of a parent.\n     \n            At least 132 properties have been destroyed by the fire, while 88 have been left damaged, Ventura County Fire Department officials said Thursday evening. Ten damage inspection teams have been deployed to inspect structures along the path of the blaze.\n     \n            Ten people endured non-life-threatening injuries from the Mountain Fire, which are mostly related to smoke inhalation, Ventura County Sheriff Jim Fryhoff said.\n     \n            Fire activity died down Thursday night into Friday and firefighters are racing to take advantage of improved weather conditions before gusty Santa Ana winds ‚Äì which helped drive the fire‚Äôs explosive growth ‚Äì potentially arrive again next week, Capt. Thomas Shoots, a Cal Fire spokesperson, told CNN. Officials reported positive results Friday evening after gaining slightly more containment on the fire with no further growth.\n     \n            Reining in the northeast side of the fire is a top priority but will be ‚Äútime-consuming,‚Äù Shoots said Friday. The side abuts a stretch of rugged terrain without natural fire barriers such as roadways, requiring the firefighters to go directly to the fire‚Äôs edge, cut away vegetation and cool the area down.\n     \n            Getting evacuees back to their homes also is a pressing concern, he said, but smoldering ground, debris and downed power lines are safety threats that will also affect when officials decide to let people back in, he said. ‚ÄúWe‚Äôre making those plans (with law enforcement partners) to figure out which areas‚Äù can be opened, he said.\n     \n            ‚ÄúThe biggest challenge is that with a 20,000 acre fire, all it takes is one hot piece of material jumping across the line to get that fire going again,‚Äù Shoots said.\n     \n            By the time Morin, her husband and their friends got out of the house, the fire had caught on to the surrounding trees. Smoke was everywhere, she told CNN.\n     \n            In a panic, the California native grabbed her husband‚Äôs diabetes medication, her laptop, and some dresses, but she couldn‚Äôt get hold of everything she wanted in time ‚Äì‚Äì including clothes and other memorabilia from when her son was a baby.\n     \n            The four adults made their escape through clouds of thick smoke.\n     \n            ‚ÄúWe couldn‚Äôt see anything. We were basically driving just in the smoke. (Dave) was freaking out. And I was telling him, ‚ÄòDave, pull over. Let me take the wheel. I‚Äôm OK. Pull over,‚Äô‚Äù Morin said.\n     \n            Residents just outside Camarillo, including Eugene Zaharov, were suddenly ordered to evacuate by firefighting crews on Wednesday. Zaharov only had time to grab his wallet, keys and a box of documents as the blaze advanced toward his neighborhood and filled the air with flying embers, he told CNN Friday.\n     \n            Zaharov was devastated when he returned to the neighborhood to find almost all the homes ‚Äì except his and two others ‚Äì had been burned, he said. Firefighters had been able to halt the flames as they singed his property line.\n     \n            ‚ÄúI just feel so sorry for all the neighbors that lost their homes,‚Äù Zaharov said. ‚ÄúIt‚Äôs just unimaginable as to what it‚Äôs going to take to get their lives together and find places to live.\n     \n            ‚ÄúSome are probably going to rebuild. Some won‚Äôt. Lives are upended.‚Äù\n     \n            Stan Jensen and Dawn DaMart were more than 1,000 miles from home when flames began consuming their house in Camarillo.\n     \n            ‚ÄúWe were in Minnesota and our friends were texting us asking us if we were OK,‚Äù DaMart said Friday. ‚ÄúI think they didn‚Äôt want to tell us, but they knew that our house was on fire. Finally, we had a person working at the house doing remodeling and he said, ‚ÄòI don‚Äôt want to be the one to tell you this, but your house is burning down.‚Äô‚Äù\n     \n            The couple sat helplessly and watched a news clip of their home in flames. Almost everything they own is gone, DaMart said, including supplies for her business and her father‚Äôs ring, which ‚Äúmeant the world to me.‚Äù\n     \n            They hope receiving insurance payments won‚Äôt be challenging given the ‚Äúmonumental‚Äù destruction the community has faced, DaMart said.\n     \n            According to the sheriff‚Äôs office, 400 homes were evacuated by officials, while 800 homes that were door-knocked appeared to have already been evacuated; 250 residents chose to stay, Fryhoff said.\n     \n            ‚ÄúWe see it over and over and over: People have the best intentions to stay and defend their home right up until the time the fire hits their home,‚Äù Ventura County Fire Chief Dustin Gardner said.\n     \n            ‚ÄúAnd it gets hot, and it gets smoky. You can‚Äôt see, you can‚Äôt breathe, and you sure as hell can‚Äôt defend your home. And then you‚Äôre stuck, and then our firefighters have to get in, pull you out.‚Äù\n     \n            Some, with fireproofing in the structures of their homes, were exceptions. Steven Snyder was one of them.\n     \n            Synder, a resident of Camarillo, went to bed on Wednesday as the Mountain Fire raged around his fireproofed home.\n     \n            ‚ÄúWhen I looked out the window it looked like little campfires that were sparking up,‚Äù Snyder told CNN, adding that he watched the fire come over the hill in his direction.\n     \n            When Snyder woke up on Thursday, the land around him was charred. Many of his neighbors‚Äô homes were on fire.\n     \n            Fire personnel in the area urged Snyder, his wife, daughter, and 7-week-old granddaughter to stay home. The family had lost power but had plenty of water and food ‚Äì‚Äì which they shared with fire personnel.\n     \n            Firefighters have been working aggressively to gain control of the Mountain Fire by dropping water from helicopters. The fire, which had virtually no containment for more than 24 hours, was 14% contained Friday evening, according to Cal Fire.\n     \n            The worst of the winds, which prompted the fire to spread more quickly on Wednesday through Thursday morning, gusted consistently from 30 mph to 40 mph, with some gusts in excess of 60 mph, according to a CNN weather analysis. Winds began decreasing Thursday afternoon, and conditions are set to improve with humidity increasing through the weekend.\n     \n            Winds are expected to blow at 5 mph to 10 mph Friday.\n     \nRed flag warnings, which alert people to weather conditions favorable for fires, have expired for the Los Angeles area and the Los Angeles and Ventura County mountains.\n     \n            Though reasons for the Mountain Fire‚Äôs rapid spread are clear, its cause remains unknown, a Ventura County fire official said Thursday morning.\n     \n            The county fire department‚Äôs investigation unit is working on several things, including determining whether power lines were involved in causing the fire, Johnson said when asked about power lines as a possible cause.\n     \n            ‚ÄúI could tell you that there could be a million things that start a fire,‚Äù Johnson said. ‚ÄúWhen a fire like that breaks, we don‚Äôt initially go to ‚ÄòWhat started this?‚Äô Our job is to bring stabilization, so we went immediately to work in that regard.‚Äù\n     \n            Other devastating wildfires have previously been blamed on fallen power lines that remained energized, prompting power companies to plan for broad shut-offs before it can happen again.\n     \n            As a precaution, Southern California Edison, Southern California‚Äôs main electric provider, cut off power intentionally overnight Wednesday to 69,931 customers ‚Äì including 23,603 in Ventura County ‚Äì as part of its Public Safety Power Shutoff plan.\n     \n            Fall marks a critical inflection point for California‚Äôs fire season.\n     \n            The combination of very windy and very dry conditions primes the landscape, turning it into tinder-dry fuel, which can easily catch fire with the smallest spark and then spread rapidly in high winds.\n     \n            As the world warms due to fossil fuel pollution, scenarios like the Mountain Fire could play out more frequently.\n     \n            The number of extreme fall fire-weather days in California has more than doubled since the early 1980s because of warmer and drier autumns as global temperatures rise, according to a study by a climate scientist at the University of California, Los Angeles.\n     \nCNN‚Äôs Taylor Romine, Taylor Galgano, Rebekah Riess, Mary Gilbert, Robert Shackelford and Elizabeth Wolfe contributed to this report.\n ¬© 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ‚Ñ¢ & ¬© 2016 Cable News Network."
        },
        {
            "source": {
                "name": "ESPN",
                "article_id": 14
            },
            "author": "Ben Baby",
            "title": "Burrow, Chase's brilliance wasted as Bengals fall - ESPN",
            "description": "Joe Burrow and Ja'Marr Chase played like \"the best duo in the league\" in lighting up the Ravens' defense Thursday night, but the Bengals came up short again to fall to 4-6 on the season.",
            "url": "https://www.espn.com/nfl/story/_/id/42262587/burrow-chase-light-ravens-defense-bengals-fall-4-6",
            "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1108%2Fr1411967_1296x729_16%2D9.jpg",
            "publishedAt": "2024-11-08T07:18:00Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "Wccftech",
                "article_id": 15
            },
            "author": "Omar Sohail",
            "title": "iPhone 18 Camera Upgrade May Include A Variable Aperture For The Primary Unit, With Apple Reportedly Obtaining These Parts From A Different Supplier - Wccftech",
            "description": "Apple could introduce variable aperture technology for the first time in the iPhone 18, as another supplier may be included in this deal",
            "url": "https://wccftech.com/iphone-18-could-feature-variable-aperture-for-primary-camera/",
            "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/11/48MP-camera-belonging-to-iPhone-14-Pro-and-iPhone-14-Pro-Max.jpg",
            "publishedAt": "2024-11-08T06:23:00Z",
            "content": "Apple finally included a telephoto lens in its iPhone 15 Pro Max last year, with the upgrade extended to the iPhone 16 Pro and iPhone 16 Pro Max. This is just one of the many examples of how the Cupertino firm adopts various standards much later than the competition, likely because it wants to offer the best configuration to customers. One other technology that the company is said to bring for the iPhone 18 that rivals like Samsung introduced years ago is variable aperture for the main camera, and according to one analyst, another supplier will provide these parts. Samsung, Apple’s biggest rival in the smartphone, launched its variable aperture technology for the Galaxy S9 and Galaxy S9 Plus in 2018, but the optical upgrade did not give it a major edge in the competition, which could be the reason why the Korean giant abandoned this lens for future models. According to Ming-Chi Kuo, in his latest Medium blog post, Apple will bring variable aperture technology to the iPhone 18 in 2026, with Sunny Optical being the primary supplier thanks to its vast experience designing and manufacturing the same parts for Android smartphones. “One major upgrade for the 2026 high-end iPhone 18 is the wide-camera lens upgrading to a variable aperture camera, significantly enhancing the user photography experience. My latest industry survey indicates Sunny Optical will be the primary shutter supplier (with Luxshare as secondary) and the second variable aperture lens supplier (after Largan Precision). Sunny Optical's advantages include experience designing and manufacturing variable aperture cameras for Android clients, while their strong position in shutter orders supports their lens order prospects.” The California-based titan took years to finally bring the telephoto upgrade and that too remains exclusive to the ‘Pro’ models, meaning that while Apple is behind the other players in this regard, its reason for delaying these upgrades could be because it wishes to adopt the best possible parts to deliver the best possible experience. The report does not mention which iPhone 18 model will feature the variable aperture lens, but the 2026 lineup is rumored to debut with other new technologies. Previously, Kuo stated that 2nm chipsets will be found in the 2026 models, but not every iPhone 18 will be treated to these due to high costs. Additionally, we might see Apple bring Samsung into its camera sensor supply chain, breaking Sony’s monopoly. Then again, Kuo’s predictions have been proven wrong in the past, so we recommend treating this report with a pinch of salt for now. News Source: Ming-Chi Kuo Subscribe to get an everyday digest of the latest technology news in your inbox  Some posts on wccftech.com may contain affiliate links. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to amazon.com © 2024 WCCF TECH INC. 700 - 401 West Georgia Street, Vancouver, BC, Canada "
        }
    ]
}