{
    "status": "ok",
    "totalResults": 33,
    "articles": [
        {
            "source": {
                "name": "Associated Press",
                "article_id": 1
            },
            "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT",
            "title": "Trump wins Georgia and North Carolina, moving closer to reclaiming the White House - The Associated Press",
            "description": "Donald Trump has won the battleground state of Georgia, the onetime Republican stronghold that had voted for Democrats four years ago. Along with his win in North Carolina, Trump has narrowed Kamala Harris’ pathways to victory and expanded his routes to reach…",
            "url": "https://apnews.com/article/election-day-trump-harris-white-house-83c8e246ab97f5b97be45cdc156af4e2",
            "urlToImage": "https://dims.apnews.com/dims4/default/172cee3/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F9a%2F58dfb10636ee837a26572b5178a4%2F44c5a056ee2d430c9a7ef4ea973ce388",
            "publishedAt": "2024-11-06T06:18:00Z",
            "content": "Copyright 2024 The Associated Press. All Rights Reserved. Donald John Trump has won the 2024 presidential election, marking his return to the White House after serving as the 45th president of the United States. AP explains after Donald Trump was elected the 47th president of the United States on Wednesday in an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S. Capitol, was convicted of felony charges and survived two assassination attempts. Addressing his supporters from his Election night watch party in Florida, Donald Trump claimed an “unprecedented and powerful mandate” in the 2024 contest and called on the nation to “unite” and put divisions behind. Republican presidential nominee former President Donald Trump arrives at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Republican presidential nominee former President Donald Trump smiles at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Republican presidential nominee former President Donald Trump arrives at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Democratic presidential nominee Vice President Kamala Harris phone banks with volunteers at the DNC headquarters on Election Day, Tuesday, Nov. 5, 2024, in Washington. (AP Photo/Jacquelyn Martin) Republican presidential nominee former President Donald Trump, Melania Trump and Barron Trump, arrive to speaks at an election night watch party, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Republican presidential nominee former President Donald Trump and his running mate Sen. JD Vance, R-Ohio, stand on stage at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Republican presidential nominee former President Donald Trump arrives to speak to the National Fraternal Order of Police fall meeting, Friday, Sept. 6, 2024, in Charlotte, N.C. (AP Photo/Evan Vucci)                  Follow live: Updates from AP’s coverage of the presidential election.  WASHINGTON (AP) — Donald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S. Capitol, was convicted of felony charges and survived two assassination attempts.  With a win in Wisconsin, Trump cleared the 270 electoral votes needed to clinch the presidency. He won Michigan on Wednesday afternoon, sweeping the “blue wall” along with Pennsylvania — the one-time Democrat-leaning, swing states that all went for Trump in 2016 before flipping to President Joe Biden in 2020.  His Democratic rival, Vice President Kamala Harris, called Trump on Wednesday afternoon to concede the race and congratulate him. A short time later, Biden also called Trump to congratulate him and to invite the president-elect to the White House, formally kicking off the transition ahead of Inauguration Day, the White House said. Biden also called Harris.  Foreign leaders called Trump too, including Israeli Prime Minister Benjamin Netanyahu and French President Emmanuel Macron.  The victory validates Trump’s bare-knuckles approach to politics. He had attacked Harris in deeply personal – often misogynistic and racist – terms as he pushed an apocalyptic picture of a country overrun by violent migrants. The coarse rhetoric, paired with an image of hypermasculinity, resonated with angry voters – particularly men – in a deeply polarized nation.  \n \n  “I want to thank the American people for the extraordinary honor of being elected your 47th president and your 45th president,” Trump told throngs of cheering supporters in Florida even before his victory was confirmed.  In state after state, Trump outperformed what he did in the 2020 election while Harris failed to do as well as Joe Biden did in winning the presidency four years ago. Upon taking office again, Trump will work with a Senate that will now be in Republican hands, while control of the House hadn’t been determined.  “We’ve been through so much together, and today you showed up in record numbers to deliver a victory,” Trump said. “This was something special and we’re going to pay you back,” he said.   The U.S. stock market, Elon Musk’s Tesla, banks and bitcoin all stormed higher Wednesday, as investors looked favorably on a smooth election and Trump returning to the White House. In his second term, Trump has vowed to pursue an agenda centered on dramatically reshaping the federal government and pursuing retribution against his perceived enemies.   The results cap a historically tumultuous and competitive election season that included two assassination attempts targeting Trump and a shift to a new Democratic nominee just a month before the party’s convention. Trump will inherit a range of challenges when he assumes office on Jan. 20, including heightened political polarization and global crises that are testing America’s influence abroad.  His win against Harris, the first woman of color to lead a major party ticket, marks the second time he has defeated a female rival in a general election. Harris, the current vice president, rose to the top of the ticket after Biden exited the race amid alarm about his advanced age. Despite an initial surge of energy around her campaign, she struggled during a compressed timeline to convince disillusioned voters that she represented a break from an unpopular administration.  The vice president, who has not appeared publicly since the race was called, was set to speak Wednesday afternoon at Howard University, where her supporters gathered Tuesday night for a watch party while the results were still in doubt. What to know about the 2024 election: News outlets globally count on the AP for accurate U.S. election results. Since 1848, the AP has been calling races up and down the ballot. Support us. Donate to the AP.  Trump is the first former president to return to power since Grover Cleveland regained the White House in the 1892 election. He is the first person convicted of a felony to be elected president and, at 78, is the oldest person elected to the office. His vice president, 40-year-old Ohio Sen. JD Vance, will become the highest-ranking member of the millennial generation in the U.S. government.  There will be far fewer checks on Trump when he returns to the White House. He has plans to swiftly enact a sweeping agenda that would transform nearly every aspect of American government. His GOP critics in Congress have largely been defeated or retired. Federal courts are now filled with judges he appointed. The U.S. Supreme Court, which includes three Trump-appointed justices, issued a ruling this year affording presidents broad immunity from prosecution.  Trump’s language and behavior during the campaign sparked growing warnings from Democrats and some Republicans about shocks to democracy that his return to power would bring. He repeatedly praised strongman leaders, warned that he would deploy the military to target political opponents he labeled the “enemy from within,” threatened to take action against news organizations for unfavorable coverage and suggested suspending the Constitution.  Some who served in his White House, including Vice President Mike Pence and John Kelly, Trump’s longest-serving chief of staff, either declined to endorse him or issued dire public warnings about his return.  While Harris focused much of her initial message around themes of joy, Trump channeled a powerful sense of anger and resentment among voters.   He seized on frustrations over high prices and fears about crime and migrants who illegally entered the country on Biden’s watch. He also highlighted wars in the Middle East and Russia’s invasion of Ukraine to cast Democrats as presiding over – and encouraging – a world in chaos.  It was a formula Trump perfected in 2016, when he cast himself as the only person who could fix the country’s problems, often borrowing language from dictators.  “In 2016, I declared I am your voice. Today I add: I am your warrior. I am your justice. And for those who have been wronged and betrayed, I am your retribution,” he said in March 2023.  This campaign often veered into the absurd, with Trump amplifying bizarre and disproven rumors that migrants were stealing and eating pet cats and dogs in an Ohio town. At one point, he kicked off a rally with a detailed story about the legendary golfer Arnold Palmer in which he praised his genitalia.  One defining moment came in July when a gunman opened fire at a Trump rally in Butler, Pennsylvania. A bullet grazed Trump’s ear and killed a supporter. His face streaked with blood, Trump stood and raised his fist in the air, shouting “Fight! Fight! Fight!” Weeks later, a second assassination attempt was thwarted after a Secret Service agent spotted the barrel of a gun poking through the greenery while Trump was playing golf.  Trump’s return to the White House seemed unlikely when he left Washington in early 2021 as a diminished figure whose lies about his defeat sparked a violent insurrection at the U.S. Capitol. He was so isolated then that few outside of his family bothered to attend the send-off he organized for himself at Andrews Air Force Base, complete with a 21-gun salute.  Democrats who controlled the U.S. House quickly impeached him for his role in the insurrection, making him the only president to be impeached twice. He was acquitted by the Senate, where many Republicans argued that he no longer posed a threat because he had left office.  But from his Mar-a-Lago resort in Florida, Trump – aided by some elected Republicans – worked to maintain his political relevance. Rep. Kevin McCarthy, the California Republican who then led his party in the U.S. House, visited Trump soon after he left office, essentially validating his continued role in the party.  As the 2022 midterm election approached, Trump used the power of his endorsement to assert himself as the unquestioned leader of the party. His preferred candidates almost always won their primaries, but some went on to defeat in elections that Republicans viewed as within their grasp. Those disappointing results were driven in part by a backlash to the Supreme Court ruling that revoked a woman’s constitutional right to an abortion, a decision aided by Trump-appointed justices. The midterm election prompted questions within the GOP about whether Trump should remain the party’s leader.  But if Trump’s future was in doubt, that changed in 2023 when he faced a wave of state and federal indictments for his role in the insurrection, his handling of classified information and election interference. He used the charges to portray himself as the victim of an overreaching government, an argument that resonated with a GOP base that was increasingly skeptical – if not outright hostile – to institutions and established power structures.  Special counsel Jack Smith was evaluating Wednesday how to wind down the two federal criminal cases against Trump.  Florida Gov. Ron DeSantis, who challenged Trump for the Republican nomination, lamented that the indictments “sucked out all the oxygen” from the GOP primary. Trump easily captured his party’s nomination without participating in a debate against DeSantis or other GOP candidates.  With Trump dominating the Republican contest, a New York jury found him guilty in May of 34 felony charges in a scheme to illegally influence the 2016 election through a hush money payment to a porn actor who said the two had sex. He faces sentencing this month, though his victory poses serious questions about whether he will ever face punishment.  He also has been found liable in two other New York civil cases: one for inflating his assets and another for sexually abusing advice columnist E. Jean Carroll in 1996.   Trump is subject to additional criminal charges in an election-interference case in Georgia that has become bogged down. On the federal level, he’s been indicted for his role in trying to overturn the results of the 2020 election and improperly handling classified material. When he becomes president, Trump could appoint an attorney general who would erase the federal charges.   As he prepares to return to the White House, Trump has vowed to swiftly enact a radical agenda that would transform nearly every aspect of American government. That includes plans to launch the largest deportation effort in the nation’s history, to use the Justice Department to punish his enemies, to dramatically expand the use of tariffs and to again pursue a zero-sum approach to foreign policy that threatens to upend longstanding foreign alliances, including the NATO pact.  When he arrived in Washington 2017, Trump knew little about the levers of federal power. His agenda was stymied by Congress and the courts, as well as senior staff members who took it upon themselves to serve as guardrails.   This time, Trump has said he would surround himself with loyalists who will enact his agenda, no questions asked, and who will arrive with hundreds of draft executive orders, legislative proposals and in-depth policy papers in hand.    Colvin reported from West Palm Beach, Florida.  Copyright 2024 The Associated Press. All Rights Reserved."
        },
        {
            "source": {
                "name": "PBS",
                "article_id": 2
            },
            "author": "Adam Kemp",
            "title": "Democrats still ‘optimistic’ as ‘Blue Wall’ tally continues - PBS NewsHour",
            "description": "As former President Donald Trump’s electoral vote count climbs past 230, the Kamala Harris campaign remains “optimistic” that a path to victory is still possible. PBS News Hour’s Laura Barrón-López reported live from the Harris watch party at Howard Universit…",
            "url": "https://www.pbs.org/newshour/live-update/election-news-2024/democrats-still-optimistic-as-blue-wall-tally-continues",
            "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2024/11/2024-11-06T051248Z_1873400161_RC2HZAALF79C_RTRMADP_3_USA-ELECTION-HARRIS-1024x723.jpg",
            "publishedAt": "2024-11-06T05:43:00Z",
            "content": "Double your support for intelligent, in-depth, trustworthy journalism. PBS News Special Election Night 2024 Featured stories  See all Donald Trump elected 47th president of the United States By Zeke Miller, Michelle L. Price, Jill Colvin, Will Weissert, Associated Press GOP takes Senate majority for first time in 4 years with wins in West Virginia, Ohio and Montana By Lisa Mascaro, Mary Clare Jalonick, Associated Press Live results: Abortion on the ballot How to watch 2024 election results By Joshua Barajas, Erica R. Hendry Live blog: Election 2024 fact checks By PolitiFact staff Donald Trump elected 47th president of the United States By Zeke Miller, Michelle L. Price, Jill Colvin, Will Weissert, Associated Press  See all \n                    Nov 6, 2024 12:43 AM EST\n             By Adam Kemp As former President Donald Trump’s electoral vote count climbs past 230, the Kamala Harris campaign remains “optimistic” that a path to victory is still possible. PBS News Hour’s Laura Barrón-López reported live from the Harris watch party at Howard University that campaign sources see a path to 270, with the vice president hoping to carry the “Blue Wall” states, including Wisconsin and Michigan. “Nobody is feeling ‘ghosts of 2016,’” Barrón-López said. “I was texting with a Democratic House member in Nevada, they are extremely confident that Harris will win Nevada.” Harris also picked up Nebraska’s 2nd district, which is worth one electoral vote. Barrón-López said that Nebraska vote, plus the Blue Wall and Nevada could equal victory. Barrón-López said some of her campaign sources said they are beginning to feel “a little bit nervous” but are trying to project calm to campaign supporters. (The campaign is) “reminding people here of what it was like in 2020, when at this point some of these states looked as if they were favoring Donald Trump and it wasn’t until Wednesday and beyond that things started to shift for Democrats,” Barrón-López said. Watch Barrón-López’s full report. \nSupport Provided By:\nLearn more\n Subscribe to Here’s the Deal, our politics\n                 newsletter for analysis you won’t find anywhere else. Thank you. Please check your inbox to confirm. © 1996 - 2024 NewsHour Productions LLC. All Rights Reserved. PBS is a 501(c)(3) not-for-profit organization. Sections About Stay Connected Subscribe to Here's the Deal with Lisa Desjardins Thank you. Please check your inbox to confirm. Learn more about Friends of the News Hour. Support for News Hour Provided By"
        },
        {
            "source": {
                "name": "CNN",
                "article_id": 3
            },
            "author": "Jeremy Herb, Tami Luhby, Eric Levenson",
            "title": "Battleground states rush to count ballots after mostly smooth Election Day vote - CNN",
            "description": "Battleground states are counting the ballots that will decide the next US president into the early hours of Wednesday morning, after Election Day voting that largely went smoothly despite fake bomb threats that targeted multiple states.",
            "url": "https://www.cnn.com/2024/11/06/politics/battleground-states-vote-count-ballots/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2182510980.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-06T05:39:00Z",
            "content": "\n            Battleground states continued counting outstanding ballots into the early hours of Wednesday after Election Day voting that largely went smoothly despite fake bomb threats that targeted multiple states.\n     \n            The results showed Donald Trump won the 270 Electoral College votes needed to take the White House and that Republicans will control the Senate. The House remains up for grabs.\n     \n            On Election Day, bomb threats were reported across five key battleground states, both to polling places and government offices where votes are counted. The threats were not credible, but they led to temporary closures at precincts in several states. The FBI, which engaged with local and state officials, confirmed that some of the threats originated from Russian email domains.\n     \n            US officials continue to say that at least some of the bomb threats made to polling locations in multiple states appeared to originate from Russian email domains. But the investigation is ongoing, and the FBI has yet to publicly confirm that someone in Russia was behind the threats.\n     \n            Fulton County – a key Democratic-heavy county in Georgia – saw 32 threats on Tuesday, according to officials there.\n     \n            Attention is now focused on the states that have yet to be called in the presidential race and open House and Senate races that will determine the balance of power.\n     \n            While some sporadic issues popped up – long lines, isolated problems with machines, lawsuits and baseless claims of cheating – states reported a mostly straightforward Election Day.\n     \n            Here’s where things stand with the key states:\n     \n            Michigan Secretary of State Jocelyn Benson said the Wolverine State is still on track to be the first presidential battleground state to report complete unofficial results, potentially overnight.\n     \n            Benson said she expects a final delivery of about 4,000 Detroit ballots to arrive at the city’s counting center in “about an hour or so.” Those ballots will need to be processed and tabulated before the city can begin reporting results from that batch.\n     \n            “That’s this sort of human aspect of this process. But the tabulation itself is mostly done,” she said.\n     \n            Benson said that the state had a “successful” in-person early voting period as a result of Michigan’s new voting laws. This was the first general election in the state since the new measures went into effect allowing at least nine days of early voting and early tabulation of mail ballots.\n     \n            A total of five locations across Michigan received bomb threats that were not deemed to be credible: four precincts and the secretary of state’s office in Lansing, per Benson.\n     \n            Unlike some of the other states that also received similar threats, Benson said that Michigan did not see any disruptions of the voting process as a result of the threats. She emphasized that the election went smoothly in precincts across Michigan.\n     \n            CNN projected that Trump will win Georgia just after 12:30 a.m. ET on Wednesday.\n     \n            A big chunk of the roughly 400,000 outstanding ballots in Georgia are in-person votes from metro Atlanta that were cast on Tuesday, Gabriel Sterling, chief operating officer with the Georgia secretary of state’s office, told CNN.\n     \n            There are also two batches of absentee ballots – including 10,400 ballots in Chatham County in the Savannah area – that still need to be sent in.\n     \n            A total of 12 voting locations had their hours extended due to bomb threats, according to Georgia Secretary of State Brad Raffensperger, as well as three additional polling locations due to “normal causes.”\n     \n            Fulton County officials said it feels “amazing” to have the counting go so smoothly, particularly after the county grappled with 32 bomb threats on Tuesday.\n     \n            That last polls closed in Nevada after midnight ET thanks to long lines at polls.\n     \n            Nevada officials are working on tallying in-person Election Day data as the last voter in the state cast a ballot at 12:45 a.m. ET, Clark County registrar Lorena Portillo told reporters. Authorities will “start processing mail ballots” in Clark County on Wednesday, she added.\n     \n            “There were no major issues across the state” in the election process, said Nevada Secretary of State Francisco Aguilar.\n     \n            In the state, however, an issue with ballot signatures emerged among young voters – many of them do not know how to sign their name, Nevada Secretary of State Francisco Aguilar told CNN.\n     \n            State officials are urgently reaching out to a large number of young voters to confirm their signatures so their votes can be counted. But officials say many teenagers and young adults in their 20s only know how to sign their names electronically.\n     \n            “What we’re finding is there’s a lot of younger people who have a signature issue because they live in a digital world, they haven’t used a real signature in real life,” said Aguilar.\n     \n            In Clark County, Nevada, more than 11,000 ballots still need verification.\n     \n            Voters who need to cure ballots with signature issues have until November 12 to do so, according to state election rules.\n     \n            The state saw multiple polling places with waits over an hour on Tuesday, including nine in Washoe County. In Nye County, a county clerk says the estimated line is 2.5 hours for at least one polling place.\n     \n            CNN projected that Trump will win Pennsylvania, a key state for his path to the White House.\n     \n            There are still votes outstanding in the state to be counted. Philadelphia received 202,713 mail-in ballots and another 437,427 votes have been cast at polling places as of 11:55 p.m. ET, city commissioner Omar Sabir said.\n     \n            The city’s results are important because Vice President Kamala Harris will need a large pickup there to win Pennsylvania, where she trails Trump in the current count.\n     \n            “We will continuously post updates. We will not stop until we have finished,” Sabir said in a news conference early Wednesday morning.\n     \n            In Pennsylvania, Cambria County is conducting a hand-count of ballots that could not be scanned at the precinct earlier Tuesday due to a software issue, Secretary of State Al Schmidt said, adding that process can “take some time.”\n     \n            The hand-count is typically done by “partisan teams of two” who work together, and the process would be open to observation by candidates and authorized representatives, he said.\n     \n            Voting time in the county was extended after a “software malfunction” disrupted voters’ abilities to scan their ballots, the Office of County Commissioners said. The malfunction was caused by a printing error, Scott Hunt, the county’s top election official, told CNN earlier Tuesday, and new ballots are on their way to polling places. The ballots that were already cast but could not be read by the machine will be hand-counted, he said.\n     \n            By contrast, the vast majority of votes – both in-person votes and mail-in ballots – in the second largest county in Pennsylvania will be counted by midnight, according to Allegheny County Executive Sara Innamorato.\n     \n            “It’s been smooth sailing here in Allegheny County,” Innamorato told CNN, noting the turnout has been major. “The vibes are good when it comes to elections here in Allegheny County.”\n     \n            Pennsylvania saw voting extended in several counties that saw bomb threats. A building that houses the Centre County Elections office in Bellefonte, Pennsylvania, was temporary evacuated to investigate a threat received via email to the elections office.\n     \n            CNN projected that Trump will win Wisconsin at about 5:30 a.m. ET Wednesday, giving Trump the necessary Electoral College votes to win the presidency.\n     \n            Milwaukee has finished processing about 75% of all absentee ballots as of about 10:45 p.m. ET, city election commission chair Paulina Gutierrez told reporters.\n     \n            Polling places around the city have also reported the results from about 132,000 Election Day votes to Milwaukee County, with eight polling sites still sending results, she said.\n     \n            “We’re still a couple hours away” from finishing the absentee count, Gutierrez said, predicting that the tally would wrap up sometime after midnight.\n     \n            In Milwaukee, an error in setting up tabulator machines required a recount of about 30,000 ballots. The city redid all of those 30,000 ballots and has been progressing swiftly since then, city spokesperson Jeff Fleming said, while declining to share a specific estimate of when the count will wrap up.\n     \n            Despite the swift recount, Republicans are already raising concerns about the snafu and demanding answers from Milwaukee.\n     \n            Sen. Ron Johnson and Wisconsin GOP chair Brian Schimming visited the city’s central count as election observers and spoke with the city’s chief elections official.\n     \n            Wearing a neon green “election observer” sticker and trailed by a bevy of reporters and Republican election observers, Johnson walked around the hangar-like counting center, looking at the machines and watching the vote count take place.\n     \n            In an exchange that lasted several minutes, Johnson told Gutierrez to preserve all surveillance videos of the count and all records about the vote totals from the first tally of the roughly 30,000 ballots.\n     \n            As polls closed in Arizona Tuesday evening, hundreds of college students were still waiting in line to vote at Arizona State University’s Tempe campus fitness center, according to Alysa Horton, an ASU student and digital editor-in-chief at the university’s State Press newspaper. The line continued to grow in the final hour of voting.\n     \n            “The line looks like students are determined to get their vote in and they’ll go to any extreme to stay in line,” Horton said. “I saw no one leave the line because of the wait.”\n     \n            With many students opting to vote on Election Day in person, the line – which at one point consisted of roughly 300 people – extended for less than a quarter of a mile, Horton said.\n     \n            Arizona also was one of the states that received non-credible threats to polling places that appeared to originate in Russia, Secretary of State Adrian Fontes said. Four polling locations in Navajo County received the hoax bomb threats from a .ru email address, although officials have not confirmed attribution to Russia.\n     \nThis story has been updated with additional developments.\n \nCNN’s Sean Lyngaas, Dalia Faheid, Brian Todd, Zachary Cohen, Casey Tolan, Holmes Lybrand, Scott Glover, Pamela Brown, Jim Acosta and Laura Dolan contributed to this report.\n © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
        },
        {
            "source": {
                "name": "CNBC",
                "article_id": 4
            },
            "author": "Lim Hui Jie",
            "title": "Toyota posts nearly 20% drop in second-quarter operating profit, missing estimates - CNBC",
            "description": "Despite the lower takings, Toyota had raised its interim and full year dividend forecast",
            "url": "https://www.cnbc.com/2024/11/06/toyota-posts-nearly-20percent-drop-in-second-quarter-operating-profit-missing-estimates.html",
            "urlToImage": "https://image.cnbcfm.com/api/v1/image/107215994-1679971290930-gettyimages-1237223066-AFP_9UM2JA.jpeg?v=1707241777&w=1920&h=1080",
            "publishedAt": "2024-11-06T05:27:36Z",
            "content": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Japanese automaker Toyota Motor on Wednesday reported its first quarterly operating profit drop in about two years, as it strives to navigate the market shift toward electric vehicles. Here are Toyota's results compared with estimates from analysts, compiled by LSEG. The world's largest automaker by sales volume saw a 20% year-on-year drop in operating profit during the quarter. Net profit attributable to company more than halved to 573.7 billion yen from 1.28 trillion a year ago. The automaker's sales volume for the second-quarter slipped to 2.3 million from 2.42 million units a year ago. Still, Toyota raised its full-year dividend forecast to 90 yen, up from 75 yen a year earlier. Toyota has been slower in embracing fully battery-powered electric vehicles, with chairman Akio Toyoda reportedly saying that an \"electric-vehicle only future\" would lead to job losses in the automotive industry. \"There are 5.5 million people involved in the automotive industry in Japan. Among them are those who have been doing engine-related (work) for a long time,\" Toyoda told reporters, according to Reuters. \"If electric vehicles simply become the only choice, including for our suppliers, those people's jobs would be lost.\" The company maintained a full-year operating profit of 4.3 trillion yen. Toyota also has been in the spotlight this year due to the multiple vehicle recalls, most recently in September. The latest recall of 42,000 vehicles was over the loss of power brake assist that can extend the distance required to stop, according to the National Highway Traffic Safety Administration. It affected certain 2023-2024 Corolla Cross Hybrid vehicles, the administration said. Early in June, Toyota lost over $15 billion in market value after Japan's Transport Ministry found false data was used by Japanese automakers to certify certain models. The wide-ranging inspection by the Ministry of Land, Infrastructure, Transport and Tourism also found irregularities in certification applications by other automakers Honda, Suzuki and Yamaha. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2024 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
        },
        {
            "source": {
                "name": "Associated Press",
                "article_id": 5
            },
            "author": "STEVE PEOPLES, BILL BARROW",
            "title": "Trump weakens Democrats' coalition, and other early election takeaways - The Associated Press",
            "description": "Even with a final outcome uncertain Tuesday night, the 2024 presidential election has already exposed the depths of a fractured nation as the candidates navigated a political realignment based on gender and class under the near-constant threat of misinformati…",
            "url": "https://apnews.com/article/trump-harris-presidential-election-takeaways-d0e4677f4cd53b4d2d8d18d674be5bf4",
            "urlToImage": "https://dims.apnews.com/dims4/default/423d075/2147483647/strip/true/crop/3012x1694+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F25%2F80dada1fc156e602719f3814084a%2F830168d8f7fa46ce980f29c22b814781",
            "publishedAt": "2024-11-06T05:16:00Z",
            "content": "Copyright 2024 The Associated Press. All Rights Reserved. Donald John Trump has won the 2024 presidential election, marking his return to the White House after serving as the 45th president of the United States. Republican presidential nominee former President Donald Trump points to the crowd at an election night watch party, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Julia Demaree Nikhinson) Republican presidential nominee former President Donald Trump smiles at former first lady Melania Trump an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Republican presidential nominee former President Donald Trump waves as he walks with former first lady Melania Trump at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci) Supporters react as they watch election results at an election night campaign watch party for Republican presidential nominee former President Donald Trump Tuesday, Nov. 5, 2024, in West Palm Beach, Fla. (AP Photo/Alex Brandon) Republican vice presidential nominee Sen. JD Vance, R-Ohio, speaks as Eric Trump, from left, Lara Trump, Republican presidential nominee former President Donald Trump and former first lady Melania Trump look on at an election night watch party, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Alex Brandon) Republican presidential nominee former President Donald Trump speaks at an election night watch party, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Julia Demaree Nikhinson) Members of the Alpha Kappa Alpha sorority stand in silhouette as they attend an election watch party Tuesday, Nov. 5, 2024, in Chicago. (AP Photo/Charles Rex Arbogast) Eric Brown picks up trash left behind from Democratic presidential nominee Vice President Kamala Harris’ election night campaign watch party Wednesday, Nov. 6, 2024, on the campus of Howard University in Washington. (AP Photo/David J. Phillip) Supporters of Democratic presidential nominee Vice President Kamala Harris attend an election night campaign watch party Tuesday, Nov. 5, 2024, on the campus of Howard University in Washington. (AP Photo/Mark Schiefelbein) Attendees leave Democratic presidential nominee Vice President Kamala Harris’ election night watch party at Howard University, Tuesday, Nov. 5, 2024, in Washington. (AP Photo/Terrance Williams) An election worker processes mail-in ballots for the 2024 General Election at the Philadelphia Election Warehouse, Tuesday, Nov. 5, 2024, in Philadelphia. (AP Photo/Matt Rourke) Screens show poll results in Times Square in New York on Election Day, Tuesday, Nov. 5, 2024. (AP Photo/Yuki Iwamura) People wait in line to vote on Election Day at the Bernalillo County Visitor Center while the sunsets in the South Valley of Albuquerque, N.M., on Tuesday, Nov. 5, 2024. (Chancey Bush/The Albuquerque Journal via AP) Republican presidential nominee former President Donald Trump arrives at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Julia Demaree Nikhinson)                              Follow live: Updates from AP’s coverage of the presidential election.  WASHINGTON (AP) — Donald Trump scored a decisive victory in a deeply divided nation. And in so doing, the Republican president-elect exposed a fundamental weakness within the Democratic base and beat back concerns about his moral failings, becoming the first U.S. president with a felony conviction.  Trump won over frustrated voters with bold promises that his fiery brand of America-first economic populism and conservative culture would make their lives better. He will be tested immediately, however, and there are reasons to believe his plans for mass deportations and huge tariffs may hurt the very people who enabled his victory.  Still, he is set to enter the White House on Jan. 20, 2025, from an undisputed position of strength. With votes still being counted, he could become the first Republican in two decades to win the popular vote.   The results left Democrats facing an urgent and immediate reckoning, with no obvious leader to unite the anti-Trump coalition and no clear plan to rebuild as an emboldened Trump prepares to re-take Washington.  Here are some key takeaways: Supporters react as they watch election results at an election night campaign watch party for Republican presidential nominee former President Donald Trump Tuesday, Nov. 5, 2024, in West Palm Beach, Fla. (AP Photo/Alex Brandon)      Black voters — men and women — have been the bedrock of the Democratic Party, and in recent years, Latinos and young voters have joined them.  All three groups still preferred Democrat Kamala Harris. But preliminary data from AP VoteCast, a survey of more than 120,000 voters nationwide, suggested that Trump made significant gains.  Voters under age 30 represent a fraction of the total electorate, but about half of them supported Harris. That’s compared to the roughly 6 in 10 who backed Biden in 2020. Slightly more than 4 in 10 young voters went for Trump, up from about one-third in 2020. \n  At the same time, Black and Latino voters appeared slightly less likely to support Harris than they were to back Biden four years ago, according to AP VoteCast.  About 8 in 10 Black voters backed Harris, down from the roughly 9 in 10 who backed Biden. More than half of Hispanic voters supported Harris, but that was down slightly from the roughly 6 in 10 who backed Biden in 2020. Trump’s support among those groups appeared to rise slightly compared to 2020. Collectively, those small gains yielded an outsize outcome. Republican presidential nominee former President Donald Trump waves as he walks with former first lady Melania Trump at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Evan Vucci)        For all of the showmanship, profanity and name-calling, Trump ultimately won over voters with grand promises to improve the economy, block the flow of immigrants on the Southern border and his siren call to “make America great again.” What to know about the 2024 election: News outlets globally count on the AP for accurate U.S. election results. Since 1848, the AP has been calling races up and down the ballot. Support us. Donate to the AP.  He also appealed to religious voters in both parties by seizing on the Democrats’ support for the transgender community.  Overall, about half of Trump voters said inflation was the biggest issue factoring into their election decisions. About as many said that of the situation at the U.S.-Mexico border, according to AP VoteCast.  He papered over the fact that the economy by many conventional metrics is robust — inflation is largely in check and wages are up — while border crossings have dropped dramatically. He talked right past the facts and through relentless repetition convinced voters.   He also sold them on the promise of the largest mass deportation effort in U.S. history, although he has not explained how such an operation would work. And he is threatening to impose massive tariffs on key products from China and other American adversaries, which economists warn could dramatically boost prices for average Americans.   Ultimately, Trump’s victory may have had as much to do with the fundamental challenges Harris faced all along. Facing deep voter frustration over the direction of the country — with Biden’s approval rating dismal — she never did distance herself from her party’s sitting president. Though Trump has now been the central figure in American politics for nine years, he convinced voters he represented change. Supporters of Democratic presidential nominee Vice President Kamala Harris attend an election night campaign watch party Tuesday, Nov. 5, 2024, on the campus of Howard University in Washington. (AP Photo/Mark Schiefelbein)      Trump is poised to inherit a nation with deepening political and cultural fissures and a worried electorate.  When asked what most influenced their vote, about half of voters cited the future of democracy. That was higher than the share who answered the same way about inflation, immigration or abortion policy. And it crosses over the two major parties: About two-thirds of Harris voters and about a third of Trump voters said the future of democracy was the most important factor in their votes.  That’s not surprising given the realities of the Trump era and the rhetoric of the campaign.   Trump refused to acknowledge his 2020 defeat and watched his supporters ransack the U.S. Capitol on Jan. 6, 2021, as Congress convened to certify Democrat Joe Biden’s victory. Trump even mused two days before Election Day that he “shouldn’t have left” the White House after repeatedly promising retribution to his political enemies.  Harris, by the end of the campaign, joined other critics — including Trump’s former White House chief of staff — in describing the former president and now president-elect as a “fascist.” Trump, meanwhile, labeled Harris a “fascist” and a “communist.”  Republican presidential nominee former President Donald Trump arrives at an election night watch party at the Palm Beach Convention Center, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla. (AP Photo/Julia Demaree Nikhinson)      Incomplete returns show that Donald Trump’s criminal convictions, additional pending indictments and any concerns over his most incendiary rhetoric simply were not a sufficient concern to keep tens of millions of Americans from voting for him.  According to AP VoteCast, slightly more than half of voters said Harris has the moral character to be president, compared to about 4 in 10 who said that about Trump. It’s quite possible, as Trump has said many times on the campaign trail, that his legal peril actually helped him.   As it stands, Trump may never actually face sentencing in a New York business fraud case in which he was convicted of 34 felonies. For now, his sentencing is scheduled for later this month.   He’s already had one federal indictment in Florida dismissed, sparing him from a trial on whether he flouted U.S. law on protecting national security secrets. And he’s made clear he would use his power as president to spike the federal case against him for his role in the Jan. 6 attack on the U.S. Capitol. That would leave a Georgia racketeering case pending against Trump and others accused of trying to subvert the 2020 election result. Screens show poll results in Times Square in New York on Election Day, Tuesday, Nov. 5, 2024. (AP Photo/Yuki Iwamura)      It was the first presidential election after the Supreme Court overturned Roe v. Wade and ended a woman’s national right to terminate a pregnancy. It was also the first time that a Republican presidential candidate overly courted males with a hypermasculine approach.  But the “gender gap” that resulted was not enough to sink Trump.   About half of women backed Harris, while about half of men went for Trump, according to AP VoteCast. That appears largely consistent with the shares for Biden and Trump in 2020. Attendees leave Democratic presidential nominee Vice President Kamala Harris’ election night watch party at Howard University, Tuesday, Nov. 5, 2024, in Washington. (AP Photo/Terrance Williams)    Just a few months ago, Harris generated incredible excitement across the party. She raised more than a billion dollars seemingly overnight. She dominated her debate with Trump. She filled arenas. And just days ago drew a massive crowd to the Ellipse and National Mall.   But in the end, it wasn’t enough.   Meanwhile, Republicans have claimed control of the Senate, ousting veteran Sen. Sherrod Brown of Ohio and putting several other Democratic incumbents on the edge of defeat. The results will give Trump a significant advantage in pushing his agenda through Congress. Their only hope is to win a House majority built mostly through key suburban districts in California and New York, but that was far from certain early Wednesday.  And either way, the results shrink Democrats’ geographic footprint and, with Brown’s loss, diminish the kind of working class voice that can counter Trump’s appeal.  Trump already succeeded in painting Democrats as out-of-touch culturally with middle America. Now Democrats are left to wonder how to reconnect with parts of the country and slices of the electorate that rejected them.   ___ Copyright 2024 The Associated Press. All Rights Reserved."
        },
        {
            "source": {
                "name": "Hollywood Reporter",
                "article_id": 6
            },
            "author": "David Rooney",
            "title": "‘Red One’ Review: Dwayne Johnson and Chris Evans Save Christmas but Don’t Spare the Audience - Hollywood Reporter",
            "description": "Lucy Liu and J.K. Simmons also star in Jake Kasdan's action fantasy about an elaborate plot to kidnap Santa Claus and hijack his reindeer for nefarious purposes.",
            "url": "http://www.hollywoodreporter.com/movies/movie-reviews/red-one-review-dwayne-johnson-chris-evans-christmas-1236054244/",
            "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2024/11/MEA1_2024_UT_230516_NEAKAR_30285_BRC2_3000-H-2024.jpg?w=1296&h=730&crop=1",
            "publishedAt": "2024-11-06T05:00:39Z",
            "content": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter Lucy Liu and J.K. Simmons also star in Jake Kasdan's action fantasy about an elaborate plot to kidnap Santa Claus and hijack his reindeer for nefarious purposes. \n\t\t\t\t\t\t\tBy \n\n\tDavid Rooney\n Chief Film Critic \nDwayne Johnson’s $250 million Yuletide action-fantasy-comedy, Red One, is not to be confused with his 2021 action-comedy crime caper, Red Notice. The new film is getting a wide theatrical release, for starters, while the earlier one went straight to Netflix, topped the most-streamed chart for a minute and then was never spoken of again — almost as if it never existed. \n\tThe pop-cultural footprint of Jake Kasdan’s laborious holiday entry, while it insistently screams “Next-Gen Christmas Classic!” at you, seems unlikely to be much different. Amazon MGM Studios is being cagey about dates, but the movie seems destined to feed the hungry maw of another streaming service, Prime Video, real soon. This is a high-concept, CG-saturated bore that lacks heart and infectious humor, even if it huffs and puffs its way to a little poignancy in the end.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tMovies\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tTom Holland, Austin Butler's Race Car-Focused 'American Speed' Lands at Amazon MGM\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tNews\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'The Avengers' Stars Reunite to Brainstorm a Catchphrase for Kamala Harris Ahead of Election\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRed One\t\t\n\t\n\n\nThe Bottom Line\n\n\t\n\tDoes not sleigh.\n\t\n\n\n\nRelease date: Friday, Nov. 15Cast: Dwayne Johnson, Chris Evans, Lucy Liu, J.K. Simmons, Kiernan Shipka, Bonnie Hunt, Kristofer Hivju, Nick KrollDirector: Jake KasdanScreenwriter: Chris Morgan\n\n\t\t\t\t\t\t\t\t\tRated PG-13,\n\t\t\t\t\t\t\t\t2 hours 3 minutes\t\t\t\n\n\n\n \nFast & Furious franchise veteran Chris Morgan’s screenplay, from a story by fellow producer Hiram Garcia, plays like the result of a pitch meeting in which some over-eager junior on the studio development team said, “Hey, let’s do Elf, but with a kidnapping plot and shit tons of awesome technology!”\n\n \n\tThe movie pairs Johnson with Chris Evans as an unlikely duo on a globe-hopping mission to track down J.K. Simmons’ abducted Santa Claus (code name “Red One”) in time for the jolly bearded guy to board the sleigh and save Christmas. It’s stuffed with mythology and magic, and yet remains stubbornly unmagical. \n\tEvans plays Jack O’Malley, an unscrupulous opportunist introduced as a mouthy preteen boy (Wyatt Hunt) collecting cash from his cousins in exchange for what he claims is definitive proof that Santa Claus does not exist. Thirty years later, he’s lifting other people’s lattes from the café pickup counter before heading home to a bank of computer monitors from which he surfs the dark web, operating as the world’s greatest hacker/tracker for hire, under the alias “The Wolf.” \n\tJohnson is Callum Drift, head of the North Pole security team Enforcement, Logistics and Fortification (E.L.F., geddit?) responsible for Santa’s protection. Simmons’ Nick, as Cal fondly addresses him, likes to do the department store rounds ahead of each year’s big delivery run. The movie sets him up like a U.S. president, with a Secret Service motorcade escorting him from the shopping mall to a hangar where his team of digitally rendered reindeer stand ready for takeoff, hitched to a golden sleigh styled like a futuristic chariot.\n\n\t\n\n\n\n\n\n\n\n\n \n\tOnce airborne, they switch to hyper-speed and zip back to the North Pole, a domed super-city furnished with advanced technological capabilities yet staffed with elves that look disturbingly like mutant Yodas in a child-labor factory. Santa greets Mrs. Claus (Bonnie Hunt) before diving into his gym routine, bench-pressing major poundage to get in optimum shape for the big night. \n\tThe only reason for Santa to frown is Cal’s decision, after a few centuries of working together, to resign, making this their final Christmas together. Unlike Nick, Cal can no longer see the good in people: “I love the kids, but the grownups are killing me.” For the first time, the Naughty List is longer than the Nice, and Cal laments that people don’t even care. \n\tMeanwhile, Jack is being paid handsomely by an anonymous employer to hack the Intercontinental Seismic Surveillance System. He identifies a North Pole entry point that has remained concealed for centuries and, before long, a highly coordinated tactical unit has penetrated the dome and made off with Red One while Cal is chasing decoys. \n\tThis emergency prompts M.O.R.A., the Mythological Oversight and Restoration Authority (so many acronyms), to spring into action. The organization’s director, Zoe Harlow (Lucy Liu), tracks down the purportedly untraceable Wolf in what seems like seconds and Jack is strong-armed into teaming up with Cal to unmask the kidnappers and rescue Santa. \n\tComing on the heels of Liu’s terrific work in Steven Soderbergh’s haunted house chiller, Presence (opening Jan. 24), the thoroughly generic role assigned to her here is one of many dispiriting things about Red One. Even when Zoe gets to kick some ass in a fight scene, the action cuts away almost immediately to the armored-up dudes.\n\n\t\n\n\n\n\n\n\n\n\n \n\tThat’s not surprising given how much testosterone is clogging the aggressively charmless movie’s arteries — from buff Santa to security squads equipped with high-tech hardware and cool vehicles, from Transformers-like tricks with toys to clashes that push the boundaries of PG-13 violence. \n\tAnd that’s even before we get to gnarly muscle-bound goat-man Krampus (Kristofer Hivju), Santa’s adopted half-brother. This Dark Lord of Winter defected long ago to a gloomy German castle in the Black Forest, guarded by hellhounds, where his favored nightly ritual is a face-walloping contest with volunteers from his court of freaks. \n\tThis is a film that aims for mythological intrigue and rollicking adventure but lands more often in lead-footed bloat, suitably accompanied by Henry Jackman’s hyperventilating score. It’s always busy but seldom fun. The fantasy environments have all the appeal of the center-of-the-earth fairy kingdom in Kenneth Branagh’s instantly forgotten Artemis Fowl. Non-human North Pole workers like talking penguins and a burly polar bear — none of which are ever at risk of being mistaken for real animals — add minimal amusement. \n\tJust as Krampus comes from the Yuletide folklore of Germany, Austria and other parts of Alpine Europe, Morgan’s screenplay also incorporates the Icelandic legend of Christmas Witch Grýla (Kiernan Shipka in a role that begs for Björk), a 900-year-old shapeshifter who transforms from a hideous ogress into a diabolical babe who looks a lot like M3GAN. But there’s no place for any of the delicious campiness of that rogue robot thriller in this tiresome world.\n\n\t\n\n\n\n\n\n\n\n\n \n\tThe interlude that comes closest to generating laughs is the brief appearance of Nick Kroll as Ted, who heads up a death-mercenary security force known as the Karmanians. (If you think there’s a Kardashian allusion there, you’ll be waiting for a joke that doesn’t arrive.) When Cal and Jack get to Ted on a beach in Aruba, he’s suspended in mid-air by his ankles, possessed by the demonic voice of Grýla. But the droll Kroll is not around long enough to up the levity. \n\tThat job mostly lands on the shoulders of Evans, who deserves better and can only do so much with the witless dialogue. Johnson, reuniting with his director on two Jumanji sequels, is on straight-man duty, looking serious and purposeful throughout, until the plot mechanics give him reason to smile again. \n\tBoth Krampus and Grýla, who commands a unit of deadly giant snowmen and apparently has 13 sons who kill on command, are villains whose fundamental policy difference with Santa is their focus on punishing those on the Naughty List rather than rewarding those who qualify as Nice. \n\tJack, unsurprisingly, is a “Level 4” Naughty Lister, whose bad example has managed to rub off on his teenage son Dylan (Wesley Kimmel), despite being a neglectful dad who hardly ever spends time with him. There’s much unfunny banter between jaded Cal and cynical Jack, but if you haven’t guessed the heart-tugging turnaround of both characters well before the closing scenes, then you probably do still believe in Santa.\n\n\t\n\n\n\n\n\n\n\n\n \n\tThis holiday entry, which could almost have been called A Fast & Furious Christmas, is so ugly, artificial and overlong that it should cure kids of any belief in magic. It’s a prime example of the ways in which CG effects have impoverished the imaginations of many contemporary filmmakers — making anything possible, but too often at the expense of a human heartbeat. In any case, Red One is the equivalent of a lump of coal in your Christmas stocking. Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form."
        },
        {
            "source": {
                "name": "CNN",
                "article_id": 7
            },
            "author": "Simone Pathe",
            "title": "Moreno will defeat Brown in Ohio, CNN projects, in key pickup for GOP - CNN",
            "description": "Republican Bernie Moreno will defeat Democratic Sen. Sherrod Brown, CNN projects, a key pickup for the GOP in a state that’s been trending its way and putting the GOP one step closer to securing the Senate majority.",
            "url": "https://www.cnn.com/2024/11/05/politics/bernie-moreno-ohio-senate-race/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2161714482.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-06T04:50:00Z",
            "content": "\n            Republican Bernie Moreno will defeat Democratic Sen. Sherrod Brown, CNN projects, a key pickup for the GOP in a state that’s been trending its way and putting the GOP one step closer to securing the Senate majority.\n     \n            The three-term incumbent was already the last remaining Democrat in nonjudicial statewide office in the Buckeye State, and his defeat is yet another sign of how down ballot races are increasingly moving in the same direction as the top of the ticket with fewer ticket-splitters.\n     \n            Moreno, a Cleveland car dealership owner, leaned heavily into his endorsement from former President Donald Trump in a state that backed him by 8 points in both 2016 and 2020. Moreno emerged as the GOP nominee earlier this year after Democrats helped prop him up in the primary, believing he’d be the weakest opponent.\n     \n            The Republican tried to nationalize the race, trying to tie Brown — a progressive populist first elected to the Senate in 2006 — to Vice President Kamala Harris on immigration and inflation. Moreno’s GOP allies also tried hitting Brown over transgender athletes in an effort to cast the senator as too liberal for the state. (Brown and the Democratic Senatorial Campaign Committee went up with a response ad on the issue that says the senator agrees with GOP Gov. Mike DeWine that “these decisions should be made by local sports leagues, not politicians.”)\n     \n            Moreno trailed in public polling of the race for most of the year, although those numbers began to tighten as GOP voters consolidated around him in the final weeks before Election Day.\n     \n            He was able to overcome attacks over abortion, which was a major theme of Democrats’ messaging against him, especially after he made comments at a town hall suggesting that some suburban women were single-issue voters and questioning why women older than 50 would care about the topic. (Moreno’s campaign said he had been “clearly making a tongue-in-cheek joke.”) Democrats seized on those remarks, arguing that Moreno was out of step with Ohioans, who just last year approved a ballot measure enshrining abortion rights in the state constitution with 57% of the vote.\n     \n            Brown’s significant fundraising strength allowed him to reserve advertising at the more favorable candidate rate and dominate the airwaves over the summer. But Moreno had  significant outside firepower from GOP groups that helped boost his candidacy in the fall.\n     \n            The race was the most expensive congressional contest on record, according to data from ad tracking firm AdImpact.\n     © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
        },
        {
            "source": {
                "name": "Detroit Free Press",
                "article_id": 8
            },
            "author": "Darcie Moran, Gina Kaufman, Dave Boucher",
            "title": "Election Day 2024 live updates: Detroit turnout; Macomb tries to speed up results - Detroit Free Press",
            "description": "Residents of Michigan, a key 2024 swing state, have a final chance to cast a vote for U.S. president and other key races. Get live updates here.",
            "url": "https://www.freep.com/story/news/politics/elections/2024/11/05/election-day-2024-live-updates-michigan/76043196007/",
            "urlToImage": "https://www.freep.com/gcdn/authoring/authoring-images/2024/11/05/PDTF/76079985007-11052024-a-2-vote-11.jpg?crop=2399,1351,x0,y124&width=2399&height=1351&format=pjpg&auto=webp",
            "publishedAt": "2024-11-06T04:41:15Z",
            "content": "The day has come. Tuesday, Nov. 5 is Election Day in the U.S., and eyes are on Michigan as a swing state in the presidential race. Meanwhile, Democrats are fighting to maintain a razor-thin majority in the state House, other key roles of representation locally and in D.C. are in play, and races down the ballot will decide leadership in the realms of education and justice. Here are the latest updates from Michigan on Election Day 2024. More:Find all 2024 Michigan election results here A crash involving a Detroit elections worker transporting absentee ballots is not expected to delay the city’s vote count. The worker was driving from the city clerk’s New Center election headquarters, where signatures on absentee ballots are compared to the signature on voter registration cards, to the absentee counting room at Huntington Place, where absentee ballots are unsealed and counted. The worker crashed her car at about 10 p.m. near west Grand Boulevard and Linwood Street. Police arrived and waited for election workers to pick up the ballots, said Detroit Police Department Deputy Chief Franklin Hayes  Hayes said the driver was taken to a local hospital with minor injuries. Detroit elections director George Azzouz said only one container of ballots was in the vehicle and the ballots were picked up right away for delivery to Huntington Place. The containers hold less than 300 ballots. -M.L. Elrick The women of the nation’s oldest black sorority, the one to which Vice President Kamala Harris belongs, gathered at an event space in downtown Detroit Tuesday for an election night watch party. The event, hosted by the Lambda Pi Omega chapter of AKA Sorority, Inc., drew around 200 people. The party was billed as non-partisan and participants were not allowed to speak to media. The sorority is not allowed to make political endorsements and group leaders were fearful any comments by individual sorority members would be construed as an official position of the sorority. Decked out in Alpha Kappa Alpha regalia — salmon pink and apple green shirts and jackets and sweaters with pearls around their necks — the women sat together in front of a giant television broadcasting election night coverage, dancing, eating and talking. A few woman wore pink Chuck Taylors. The Converse shoe brand is as synonymous with Harris as pantsuits were with Hillary Clinton. Was the footwear choice by chance or by choice? No one was talking. They probably didn’t need to. -Georgea Kovanis A text from state Rep. Kathy Schmaltz, R-Jackson, sent Tuesday incorrectly said that polling locations would “open tomorrow”, prompting a complaint filed with the Secretary of State’s office, according to a press release from the Michigan Legislative Black Caucus. Caucus chair state Sen. Erika Geiss, D-Taylor, blasted the text as a “blatant attempt at disinformation and voter suppression” in a statement. A text from Lt. Gov. Garlin Gilchrist II also was received 24 minutes after 8 p.m., when polls closed. It encouraged voters to head to their polling locations and “VOTE TODAY,\" according to a copy of the message sent to a Free Press reporter. A consultant for Schmatlz’ campaign and a spokesperson with the governor’s office did not immediately respond to a Free Press request to comment.  -Clara Hendrickson Macomb County Clerk Anthony Forlini said he was heading to New Baltimore with a sheriff's deputy to pick up memory sticks with voting data, then would head to Chesterfield Township to do the same in an effort to get election results to the county − and thus online to the public − faster. The county participates in a program where a sheriff's deputy and county clerk's employee, in this case Forlini himself, go to municipalities and pick up the sticks. It's a secure process, where they transport them to the county's election department in Mount Clemens. He said three communities used the program in Tuesday's election. Forlini previously told the Free Press he worked with the sheriff in the August primary as well. About 45 minutes before most polls in Michigan closed at 8 p.m., Forlini told the Free Press: \"It's been a very busy day at the polls, and I think voter turnout is going to be fantastic.\" He reported no issues at the polls. About 9:15 p.m., Forlini said long lines continued and people in line in Harrison Township were voting past 8 p.m. -Christina Hall  Detroit is on pace to reach 51 percent voter turnout with all ballots to be counted by around midnight, a top city election official said at the Huntington Place absentee counting site after polls closed Tuesday at 8 p.m. More than 82,000 city voters cast ballots in person on Election Day as of 5 p.m. That comes after 92,000 voted absentee and 43,000 voted early, said Daniel Baxter, chief operations officer of the Detroit elections department. Workers have been counting absentee ballots since Oct. 28 in a more streamlined process than that of 2020, when Huntington Place, then the TCF center, descended into chaos amid allegations of impropriety. No more than 8,000 additional absentee ballots were expected to be delivered for counting Tuesday. Most were submitted via drop box. Baxter’s turnout projection is at the low end of the range provided by Detroit City Clerk Janice Winfrey at a briefing last week, when she expected up to 55 percent of eligible voters to cast ballots. Voter turnout in the city reached 51 percent in 2012 and 2020, and dipped to 49 percent in 2016, when Hillary Clinton lost the state by fewer than 11,000 votes. At current estimates the overall number of votes could match the roughly 257,000 people who voted in the last presidential election in 2020.  Asked how this election differs from 2020, Baxter said, “There’s no chaos going on right now, no pandemonium. Nobody is banging on windows, nobody is shouting stop the count.”  “Do you hear that?” he said. “I think I hear people singing Kumbaya.” -Violet Ikonomova Detroit police are prepared for the General Election but there is no evidence to support a false claim from former President Donald Trump about law enforcement in the majority Democratic city. “A lot of talk about massive CHEATING in Philadelphia,” Trump posted on his social media company Truth Social around 6:30pm. “Philadelphia and Detroit! Heavy Law Enforcement is there,” he added. More:Find all 2024 Michigan election results here Detroit police did not specifically respond to Trump's asserting, instead offering a statement Tuesday evening as polls closed about the security of the election. “As we have done in prior elections, the DPD has assigned personnel to locations throughout the city to ensure public safety during this election cycle for all voters. The amount of staffing deployed for this event is no different than in prior elections,” Detroit police said in a statement forwarded to the Free Press by a spokesperson in the mayor’s office. The department says it's in close communication with the city clerk “and will provide any needed assistance in ensuring election integrity.”  In 2020, Trump encouraged supporters to protest outside the city’s absentee ballot counting center as part of his false claim widespread election fraud caused his loss in Michigan. As protesters inside the then-TCF Center complained of what they believed to be voting fraud, police began to add road barricades, closing Washington Boulevard nearby the convention center and separating the group from a smaller band of counter protesters who also showed up.  Clerks are processing ballots quicker this year; they credit new election laws established as a result of an amendment to the state constitution in 2022, allowing early voting and enabling voters to automatically receive absentee ballots for all future elections. This year, election officials were able to pre-process absentee ballots eight days before Election Day. Some clerks chose not to.  -Sam Robinson Chelsea Thacker, 34, of Grosse Pointe Woods, said she was so disappointed with human rights abuses in the Middle East that she refused to vote for either Democrat Kamala Harris or Republican Donald Trump for president.  “Jill Stein, because she’s the only candidate against genocide committed by U.S.-backed Israel in Gaza and Lebanon,” said Thacker after voting Tuesday at Grosse Pointe Woods Community Center on Mack Plaza.  Thacker added she’ll never again vote for a Democrat or Republican presidential candidate until they change their positions on what she called the most pressing human rights issues.  -Matthew Dolan At the East English Village Preparatory Academy, an eastside Detroit polling station, the Free Press stopped seven voters late Tuesday as they left the building separately and at different times. All said they had voted for Vice President Kamala Harris for president. \"I wasn't hyped about it, but I did it - the other option wasn't an option\" said 34-year-old Jeff Peake, a union carpenter who referred to Trump as \"the greater of two evils.\" More:Find all 2024 Michigan election results here For the King sisters − three college-aged voters who showed up together to vote − it was Harris's commitment to protect women's rights that mattered most to them. They also loved the idea of a woman leading in the White House. \"You don't see enough women in charge,\" said 18-year-old Periece King, a first-time voter and nursing student who voted alongside her two sisters:-21-year-old Peria King, who is studying to be a stenographer, and 22-year-old Pierrah King, who works as an Amazon driver. When asked if anyone in their family was voting for Trump, they laughed and said, \"maybe an uncle.\" -Tresa Baldas As of 6 p.m., just over 3.4 million absentee ballots and early votes — 46.6% of the state's active registered voters — were cast in Michigan, according to state officials.  Officials said 93% of absentee ballots sent statewide had been returned. The number of Michiganders who had registered to vote as of 6 p.m. Tuesday was up to 16,573. In 2020, more than 28,000 voters registered on Election Day. -Kristi Tanner Kelly Flores-Mendoza, 23, of Detroit, who voted after work, said what drew her to the polls were reproductive rights, strengthening — and not defunding — education, supporting who might be the first female president, and to put an end to Trump's anti-immigrant rhetoric. Flores-Mendoza, whose parents are Mexican immigrants, she said she feels the fear in her community if Trump wins another term. She feels it herself.  \"His recent insane rhetoric and his extremist ideology — it ignites violence,\" she said.  This election has been stressful for her, considering what's at stake and how close the race is. She was excited to vote for Harris. But, she was bummed that her polling site, the Roberto Clemente Learning Academy in southwest Detroit, ran out of the werewolf \"I voted\" stickers.  -Andrea Sahouri As voters lined up early Tuesday to cast their ballots at the Northwest Activities Center in Detroit, a DJ kicked things off outside to energize the crowd, playing \"Happy,\" by Pharrell Williams. “We're trying to bring excitement to voters, to get them out to vote,” said Jacqueline Kapilango, who goes by DJ Asset, a volunteer with the group DJ at the Polls. Jamiel Martin, the Michigan project manager for DJs at the Polls, said it's an effort in 11 states. \"Our goal is to inspire folks through the DJ's performance, to excite people to come out to vote,\" Martin said. He said some polling locations may have lines, so the DJs are out there to \"keep the vibe upbeat.\" More:DJs energize Election Day crowds across Michigan as voters line up to cast ballots -Nushrat Rahman, Susan Tompor, Jalen Williams and Gina Kaufman In the leafy environs of Birmingham outside the First Presbyterian Church polling place on West Maple Road, one voter said explained her vote. Twenty-year-old Nicole Merchant, an advertising and theater major at Michigan State University, said she was inspired to fill in Vice President Kamala Harris because of the Democrat’s support for women’s rights, abortion freedom and key issues important to the gay, lesbian, bisexual and trans communities.  “This feels like a major turning point for our country and it’s very important that I’m here,” Merchant said.  -Matthew Dolan The threat made on Election Day eve to shoot up a polling location on Detroit's northwest side was not credible, Detroit police confirmed to the Free Press on Tuesday. Police didn’t say to whom the call was made but had said they were giving special attention to the polling location, which is in the 21600 block of West Seven Mile Road. On Monday, Detroit police said the department received a 911 call from an individual \"claiming to have heard a threat to a polling location via a Facebook post,\" according to a police spokesperson.  Detroit police said around 4:30 p.m. Tuesday that polling locations in Detroit are \"looking great,\" with no reported incidents of threats or crimes at the sites. -Andrea Sahouri The 2024 election was the first time Josh Puckett was able to vote in 29 years. Puckett, 47, of Redford was released from prison in July and is already prominent in metro Detroit's criminal justice reform circles. This year, fighting for reforms also meant voting in those who support changing our flawed criminal justice system, he said. When the Free Press spoke to him around 2:30 p.m. at the Clippert Multicultural Magnet Honors Academy polling location in southwest Detroit, he was in the neighborhood where he grew up, volunteering as a nonpartisan poll observer.  “Seeing it through to the end means making sure everyone's vote matters and no one gets turned away,\" he said. \"I’m really proud of Southwest Detroit. This is well organized.\" Puckett estimated he's seen at least 100 first-time voters at Clippert, and everything had gone smoothly.  (In fact, Detroit police said around 4:30 p.m. that polling locations in Detroit were \"looking great\" with no reported incidents of threats or crimes at the sites.) And although he wouldn't say who he voted for at the top of the ticket, voting down-ballot was what brought him to the polls — including the races for Michigan Supreme Court and local judges.  He did say, however, his support for Palestine made the decision between Trump and Harris difficult. Puckett said without hesitation that he believes Harris will swing Michigan and win the election.  But Dakota Shananaquet, 49, of Redford who volunteered as a poll observer at Clippert with Puckett, hesitated before saying, \"Harris.\" Shananaquet, who is Native American, said indigenous issues are key for her. She voted for Harris and explained that under the Biden-Harris administration, a lot of good was done for her community, including Biden's appointment of a Native American secretary of the interior, Deb Haaland.But as an indigenous woman, voting for Harris wasn't exactly easy, either, given the current administration's support for Israel's assault on Gaza that she described as a genocide. \"We identify it, because we as Native American people went through the same thing,\" Shananaquet said.  -Andrea Sahouri Elliot Callan, 19, of Royal Oak, said he wasn’t planning to vote until he was propelled by one issue: abortion.  Callan, a hospital kitchen worker, began to learn more about the presidential candidates and their views on ending pregnancies. He said he felt inspired to vote for Vice President Kamala Harris because of her strong support for a woman’s right to choose.  “I’m all about less government in our lives,” Callan said, adding that the last thing a pregnant woman trying to make a difficult choice about an abortion should have to worry about is government intervention.  -Matthew Dolan In an update just after 3 p.m., election officials reported that 58,466 absentee ballots had been returned since polls opened this morning and that 92% of absentee ballots sent — 2,164,803 — have been returned statewide. The number of people who registered and voted on Election Day increased to 9,612.  -Kristi Tanner Two twentysomethings emerged separately from their Ferndale voting booths Tuesday afternoon with starkly different reasons for choosing two opposing presidential candidates.  Outside Ferndale Free Methodist Church on Woodward Heights, Matthew Flint, 26, who works for Costco, cast his ballot because he was driven to oppose the Republican nominee, former President Donald Trump. “He lacks character,” Flint said in an interview. “I picked her (Democratic nominee Vice President Kamala Harris) because he’s so bad.” Just a few minutes later, Connor Elkins, also 26 from Ferndale, who works as a union drywall installer, described filling out his ballot for Trump, whom he said would solve the problem of illegal immigration. Elkins previously spent more than four years in the Marines, and said he believes the country’s armed forces were stronger under Trump’s leadership than the Biden administration, including Harris. “There is now a bold line between them,” he added. -Matthew Dolan Siblings James, 28, and Samantha Smith, 24, walked into the Flat Rock Community Center confident in their decisions in casting their votes. The two shared the sentiment that the working class and immigration and the border were their biggest concerns headed into the election, and planned on voting straight Republican. “I voted for Trump last time. The reason I voted for him is I wanted him to shake up Washington. I think there was a lot of crooked politics in there, to be honest,\" said James, a former Marine.  “And Trump, being a businessman, I think he knows how to run a country. He does pretty good for himself now.” James said he doesn’t want the results to be rushed. “I think timeframe is not really an issue. I think they should really take their time, because I'm one of the people that strongly believe that the last election was rigged and that there was false ballots,” he said. -Eric Guzmán A voting precinct in Northville, which is in both Wayne and Oakland counties, relocated on Election Day due to a gas leak. Precinct 1, which is at the community center on Main Street, suspended voting operations Tuesday, the city announced in a Facebook post about noon. Precinct 1 voters now need to go to Hillside Middle School, the city stated in another post. That location is the site of Precinct 2 and is at 775 N. Center Street in the city. Consumers Energy is on scene of the gas leak, the city stated. -Darcie Moran Oakland County saw brief issues with vote tabulators on Election Day, officials confirmed. Some precincts in a handful of communities such as Rochester Hills and Pontiac had problems earlier this morning with their tabulators, said Oakland County Clerk Lisa Brown. “That does not stop voting,” she said, noting that backup tabulators have since been deployed. -Kristi Tanner In an update just after 11:30 a.m. on Election Day, election officials revealed same-day voter registration had hit 3,704. In the August primary, same-day registrations were reported as 3,600, said Angela Benander, chief communications officer for the Michigan Department of State. Turnout on Election Day had also crept up to about 46.1% of active, registered voters in Michigan, she announced. That includes 25,000 absentee ballots returned so far on Tuesday. She said Michigan, at the time, had about 7,300 military overseas ballots that were still due back. Military overseas ballots must be postmarked on or before Election Day and are accepted within six days after the election to be counted. Both Flint and Detroit were reportedly moving swiftly in counting absentee ballots. -Darcie Moran Rodney Bragg, 58, of Grand Rapids, said he cast a straight party ticket for Democrats on Tuesday, as is the tradition for him and his family.   Standing outside LaGrave Avenue Christian Reformed Church near his city’s downtown area, he said he viewed Harris as a more trustworthy candidate and had been urging family members to vote for her. He believes she’s a step toward a brighter future.    A veteran of the U.S. Marine Corps, Bragg said Harris would never back events like the Jan. 6 riots at the U.S. Capitol, something he said for which Trump is to blame.   “They called it an insurrection. To me, that was treason,” Bragg said. “I can’t accept that. They attacked the Capitol. I swore an oath.”  Grand Rapids is the heart of Kent County, a west Michigan county that’s emerged as a key battleground in statewide elections in recent years. While Trump carried Kent County on his way to winning Michigan in 2016, Democrats at the top of the ticket have won there in each statewide election since 2018.   Trump, in what’s become a tradition itself, held his final rally before Election Day in Grand Rapids, giving a nearly two-hour long speech to supporters at Van Andel Arena which ran past 2 a.m. Tuesday.  -Arpan Lobo  Some voters were headed to an exercise class instead of the polls shortly after 9:30 a.m. Tuesday at the Warren Community Center, south of 14 Mile Road west of Mound Road. Kevin Klindt, 51, stood in line for about an hour for early voting at Warren City Hall roughly a week ago, he said. He voted for Democratic Vice President Kamala Harris. “I think she’s a better leader than Donald Trump,” he said. He’d like to see the Democrats successfully back a woman as president. He also backs the Democrats because he feels that party has helped him a lot with Social Security; he is on disability related to mental health. Linda Gardner, 77, also at the center, said she voted absentee about a month ago for Harris.  “I think all these old guys need to just move over a little bit,” Gardner said, including GOP candidate former President Donald Trump, who is 78. She recalled Trump’s portrayal of current President Joe Biden, 81, as too old and noted how close they are in age. Gardner said she is also concerned that Trump is “quite unpredictable as far as his presence on the world stage.” -Susan Tompor, columnist More than 3.3 million voters already cast their vote in Michigan between absentee ballots and early voting, delivering a turnout rate of 45.8% of active, registered Michigan voters, said Angela Benander, chief communications officer for the Michigan Department of State, in a morning call with reporters. On Tuesday, 8,000 absentee ballots were also returned and 829 people registered to vote Tuesday through same-day voter registration, she said. Turnout was also looking good at voting sites. There was one location reporting massive lines: Grace Emmanuel Baptist Church in Flint, she said. However, the line there is said to be moving quickly, despite its presence. There have been typical “blips” but no major concerns and no reports of weather-related issues or closures, said Benander. More than 100 department employees are monitoring on the ground Tuesday and agencies are prepared for any potential disruptions. Benander also offered a story positive in the eyes of her team, saying a Wexford County high school government teacher took his whole class to watch him vote so they could see how the process works. - Darcie Moran Vasilios Raspoptsis, 33, of Warren, said his family used to spend $200 or $220 a week on groceries before inflation took off. Now, it’s roughly $400 a week, even as they shop for deals at Meijer, Aldi and Costco.  He’s also a stay-at-home dad for a 3- and 4-year-old while his wife works in billing at a waste management company. It makes more sense instead of the family paying thousands of dollars for day care, he said. He voted for Democratic President Barack Obama in 2012, and then voted for GOP candidate Donald Trump in 2016 and 2020. He again cast a vote for Trump on Tuesday at the Fitzgerald Recreation Center in Warren. He’s dismayed to hear news reports suggesting it could take several days to know the results of the presidential election. “Why can’t we get them counted in a day?” Warren is the biggest city in Michigan that decided not to process absentee ballots before Election Day, despite a change in law that would allow it, the Detroit Free Press has reported. It's also the only large community in Macomb County not preprocessing ballots, according to County Clerk Anthony Forlini. Macomb County voters will help decide a number of key races in the election. -Susan Tompor, columnist Christina Harrison, 34, of Dearborn is rooting for Harris to win the presidential race. But speaking at the Charles A. Lindbergh Elementary School in Dearborn, she said she hopes there will be no political violence whatever the outcome. Harrison encouraged others to come out and vote, noting the importance of local races beyond the presidential campaign, she said. \"I think that everyone should feel like their voice matters, that it should be heard,\" Harrison said. \"You can't expect any change to happen in the country unless you're willing to go out and vote for -- even if it's not the main two candidates. I think your voice should always be heard.\" - Jenna Prestininzi Damian Fredrick walked out of Trenton City Hall with his wife and two daughters after casting their votes on Election Day. Frederick, 50, of Trenton, said that not only was it his “civic duty” to vote, but he also wanted to show the importance of voting to his daughters, ages 20 and 22. “We have a first-time voter in the house,” Frederick said. “So, I wanted her to be comfortable and know how important it is.” Fredrick said the three issues that were on his mind were inflation, immigration and security. He also said that the tension headed into this year’s election was \"higher than historically\" for him. “People are just aggressive,” Frederick said. “I even read it online. Their speech, the way they talk about their candidates. It’s just very aggressive.” Fredrick said he hopes to see results by Thursday, and hopes that “things are done correctly.” “We have to have trust in our voting system,” he said. “And right now, I think that’s lacking.” -Eric Guzman If Democratic Vice President Kamala Harris becomes president, it would be “monumental,” said 27-year-old Detroiter Lauryn Allen after she cast her ballot shortly after polls opened.  She waited in line for more than half an hour at the Northwest Activities Center in Detroit, but that didn’t really matter. It’s exciting because a line means people are voting, she said.  “It's humbling because I have that chance and opportunity to have a voice, and at one point, my ancestors didn’t,” said Allen, who lives on the west side of Detroit and works as a researcher at Henry Ford Hospital. Watching Harris at rallies and on social media, Allen felt like the presidential candidate was the right choice. She was inspired by Harris’ passion.  A Harris win would mark a shift in how Black and brown girls see themselves and how men communicate with women, she said.  Allen expects to stay up all night for the results. In 2016 — the first presidential election she voted in — she recalls the quiet of her campus after GOP candidate Donald Trump won.  “But now me, being back home and me just feeling so energized and happy and excited for the future, I believe that when it gets closer to midnight and through the night, I'll be excited,” she said.  - Nushrat Rahman Sounds from a nearby factory and traffic filled the air as Election Day kicked off Tuesday and a few voters trickled into Salina Intermediate School in Dearborn. Sporting an apron, flyers and a sign, 18-year-old Abdulrahman Masherah of Dearborn walked along the sidewalk outside the school. Masherah, a senior at Edsel Ford High School, came out to support his preferred candidate for the Dearborn Public Schools Board of Education, Jamal Aljahmi. \"As the youth, if we don't come out and help, what's the point? We need to be out here. We need to be involved in this type of stuff,\" Masherah said. -Jenna Prestininzi A line formed just after 7 a.m. at the Northwest Activities Center in the Schulze neighborhood of Detroit as voters prepared to cast their ballot on Election Day. As they did, a DJ kicked things off to the tune of “Happy” by Pharrell Williams to energize the crowd outside as volunteers passed out political flyers to people. “We're trying to bring excitement to voters, to get them up to vote,” said Jacqueline Kapilango, who goes by DJ Asset, a volunteer and DJ at the Polls. - Nushrat Rahman Polls are open from 7 a.m. until 8 p.m. local time in Michigan today. Four counties in Michigan's Upper Peninsula are on Central time, while the rest of the state is on Eastern time. If you are in line by 8 p.m., you should remain in line and have the right to cast your vote.   Some 25 voters already stood in line at Fitzgerald Recreation Center on Nine Mile Road in Warren before doors opened on Election Day — and the line quickly grew to more than 50. Nathalia Damasceno, 30, who is Latina, is voting for the first time since becoming a U.S. citizen in 2023. She said she did not particularly like GOP candidate former President Donald Trump or Democrat Vice President Kamala Harris.  The student at Lawrence Tech University is frustrated with how Democrats let inflation get out of control and how housing prices soared.  She said Trump doesn’t sound like the best choice, either, given his selection of appointees to the U.S. Supreme Court and the overturning of Roe v. Wade, the landmark Supreme Court abortion ruling. She’s also concerned that Trump supporters don’t want to hear differing viewpoints. She doesn’t feel represented by either candidate, but she plans to vote for Kamala Harris. Others in line planned to cast their ballot differently. Michael Griffin, 71, of Warren, and his wife, Shirley Griffin, 74, stood among voters with plans to vote for Trump. The retirees both voted for Trump when they lived in Indiana in 2016 and after they moved to Michigan in 2020. Michael Griffin said he was “tired of all this crap, mainly the border and inflation.” Griffin said he wasn’t a fan of boys playing in girls’ sports either. Concerns regarding transgender students have been fodder for GOP advertisements in the state. But what really upsets him, he said, are illegal border crossings and how so many people have easily crossed the Mexican border into the United States. He and his wife remain optimistic that Trump can win a second term in the White House.  “We talk about it all the time,” he said of the election. “If he gets the turnout, he wins.”  — Susan Tompor, columnist The presidential race is looming over the whole nation, but is especially close in Michigan, one of seven key swing states this cycle. Polling in Michigan is close enough that it’s impossible to predict the outcome. And that’s not the only hot contest.   Michigan’s U.S. Senate race between Democrat Elissa Slotkin and Republican Mike Rogers has been running tight, with the open seat considered a key prize for either party.   There are also three ultracompetitive congressional races. The 7th and 8th Congressional Districts near Lansing and Saginaw, respectively, have open seats. In the 10th Congressional District, it’s a rematch between incumbent Republican U.S. Rep. John James and Democrat Carl Marlinga, who lost the district by just about half a percentage point last cycle.   -Staff This is a breaking news story and will be updated. Darcie Moran and Gina Kaufman also compiled and edited most entries with field reporters, and contributed writing to the entries."
        },
        {
            "source": {
                "name": "NHL News",
                "article_id": 9
            },
            "author": null,
            "title": "Holloway in alert, stable condition after injury - NHL.com",
            "description": "Dylan Holloway left Tuesday's game against the Tampa Bay Lightning in the first period and did not return.\nHolloway appeared to be hit with a shot up high late in the first period. He finished his shift but was attended to on the bench by team medical personn…",
            "url": "https://www.nhl.com/blues/news/holloway-in-alert-stable-condition-after-injury",
            "urlToImage": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/prd/ln8ugwyeotao28pmnyoy.jpg",
            "publishedAt": "2024-11-06T04:41:15Z",
            "content": "Dylan Holloway left Tuesday's game against the Tampa Bay Lightning in the first period and did not return. Holloway appeared to be hit with a shot up high late in the first period. He finished his shift but was attended to on the bench by team medical personnel. Officials ended the first period with 1:11 left and added the time onto the start of the second period. Holloway was transported to the hospital for continued monitoring and was alert and in stable condition. \"I think the only way I can put it to you guys (the media) is if you're at work, you get a call that one of your family members is sick and rushed to the hospital,\" Blues Head Coach Drew Bannister said of his perspective of the injury from the bench. \"Holly is a family member. That was a tough. I thought we, as a group, showed a lot of fortitude mentally being able to push through that... We were able to get updates on Holly and kind of put our minds at ease a little bit, and we focused ourselves. \"From what we've heard, he's doing well. It's a good sign.\""
        },
        {
            "source": {
                "name": "ABC News",
                "article_id": 10
            },
            "author": "ABC News",
            "title": "10,000 North Korean troops now in Russia's Kursk region, Pentagon says - ABC News",
            "description": null,
            "url": "https://abcnews.go.com/International/north-korean-troops-russia-kursk-region-pentagon/story?id\\\\u003d115502852",
            "urlToImage": null,
            "publishedAt": "2024-11-06T04:41:00Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "Fortune",
                "article_id": 11
            },
            "author": "Jeff John Roberts",
            "title": "Bitcoin smashes all time high on expected Trump victory - Fortune",
            "description": "The crypto industry has thrown massive financial support behind Donald Trump, betting that his election would lead to more favorable policy.",
            "url": "https://fortune.com/crypto/2024/11/05/bitcoin-smashes-all-time-high-on-expected-trump-victory/",
            "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2024/10/Bitcoin_disappearing_1.jpg?resize=1200,600",
            "publishedAt": "2024-11-06T04:31:00Z",
            "content": "Crypto markets roared on Tuesday night as investors, anticipating a victory for Donald Trump, sent the price of Bitcoin towards $75,000. That amounts to an all time for the original cryptocurrency, which hit $73,000 in March, but has since traded below that in part due to uncertainty about the outcome of the U.S. presidential race. Trump and the Republican party fully embraced crypto in the summer, resulting in massive financial support from the industry, which had chafed against the more restrictive policies of the Biden administration. Crypto boosters gleefully took to social media on Tuesday night to hail the price surge and to predict the imminent departure of the Democrat-appointed Chair of the Securities and Exchange Commission, Gary Gensler, who many blame for stifling the industry. Bernie Moreno, the Republican Senate candidate in Ohio, also defeated Democratic incumbent Sherrod Brown, who chaired the powerful Banking Committee. Moreno pulled in tens of millions of donations from the industry after running on a pro-crypto platform, while Brown became a target due to his anti-crypto stances. The likelihood of a Trump victory also came as validation for the crypto-based betting site Polymarket, whose prediction markets have pointed to a victory for the Republican candidate for weeks. At the outset of election day, the site favored Trump by around 58% but, by late Tuesday evening, those odds had increased to around 90%.  Meanwhile, a host of other cryptocurrencies gained ground as the election results trickled in. Ethereum, the second biggest cryptocurrency, jumped by around 7% while No. 3 cryptocurrency Solana gained around 15%. The novelty cryptocurrency Dogecoin posted the biggest gains, climbing nearly 20%. The surge is explained in large part by tech billionaire and Trump ally Elon Musk, who has long been a booster of Dogecoin and recently claimed he would operate a Department Of Government Efficiency (DOGE) under a Trump Administration. The election outcome is also good news for publicly traded companies like Coinbase and MicroStrategy, whose share price is closely tied to the performance of Bitcoin. © 2024 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information\nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."
        },
        {
            "source": {
                "name": "CNN",
                "article_id": 12
            },
            "author": "Nicole Goodkind, Samantha Delouya",
            "title": "Stock futures, bitcoin and dollar surge as election results roll in - CNN",
            "description": "US stocks rallied in after-hours trading on Tuesday night and bitcoin hit a new record as Wall Street digested early presidential election results.",
            "url": "https://www.cnn.com/2024/11/05/investing/us-stocks-presidential-election-outcome/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2178722834-copy.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-06T04:19:00Z",
            "content": "Markets \n\n\n Hot Stocks \n\n\n Fear & Greed Index \n\n\n \n            Latest Market News \n\n\n \n            Hot Stocks \n\n\n \n            US stock futures rose early on Wednesday and bitcoin jumped as Donald Trump was headed for wins in the battleground states of Pennsylvania, Georgia and North Carolina, shrinking Kamala Harris’ possible paths to victory.\n     \n            Futures on the Dow climbed 2.84%, while the S&P 500 rose 2.2%. The US dollar index hit its highest point since July.\n     \n            Cryptocurrencies, which are considered part of the so-called Trump trade, jumped as well. Bitcoin surpassed $75,000, hitting an all-time high during early morning Wednesday. It surged past its previous all-time high of $74,000 on Tuesday night. Trump has voiced his support of cryptocurrencies in the past.\n     \n            Dogecoin, the volatile cryptocurrency championed by Elon Musk, a high-profile backer of Trump, rose by as much as 25% Wednesday against Tuesday’s closing level, though those gains have since been pared back to 16%. The cryptocurrency has surged almost 31% since the start of the week.\n     \nRelated live-story\nTrump poised to clinch presidency after battleground wins\n \n            The Dow closed 425 points higher Tuesday or 1% up, the S&P 500 gained 1.2% and the tech-heavy Nasdaq climbed 1.4%, all underscoring investor optimism as Americans cast their ballots.\n     \n            Historically, stocks have often risen on Election Day. This marks the sixth straight Election Day gain for the S&P 500 and Nasdaq.\n     \n            Mark Haefele, chief investment officer of the wealth management unit at UBS, noted that S&P 500 futures and Russell 2000 index futures for smaller listed US companies were up, “likely on anticipation of stronger domestic growth, increased (mergers and acquisitions) activity, an extension to personal tax cuts and hopes of lower corporate taxes” as a result of a Trump victory.\n     \n            “The prospect of a clear-cut election outcome may also be driving futures higher, given reduced uncertainty about the future,” he wrote in a note.\n     \nRelated article\nTrump’s media stock was halted for extremely volatile trading as America goes to the polls\n \n            Meanwhile, Mohit Kumar, economist at Jefferies, said financial companies and smaller companies were likely to lead further gains in US stocks.\n     \n            “We also expect US equities to continue to outperform Europe and global indices,” he added in a note.\n     \n            The Stoxx Europe 600 index, the benchmark for the region, was up 1.3%. Germany’s DAX and France’s CAC rose 0.8% and 1.4% respectively, while London’s FTSE 100 was trading 1.3% higher on the day.\n     \n            US stocks have historically moved higher in the months after elections regardless of the result. “Most stock price movements over time are driven by earnings, inflation and interest rates,” said Adam Turnquist, chief technical strategist for LPL Financial. “Policy does matter, particularly tax and trade policy, but not as much as some might think.”\n     \n            Traders are bracing for a turbulent week. Just two days after Election Day, the Federal Reserve will announce its latest interest rate decision, the first since it cut rates by half a point. The Fed’s announcement comes amid new data showing signs of a cooling US labor market, adding another layer to an already stacked week for markets.\n     \nAnna Cooban and Olesya Dmitracova in London contributed reporting.\n Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
        },
        {
            "source": {
                "name": "The Wall Street Journal",
                "article_id": 13
            },
            "author": "The Wall Street Journal",
            "title": "Russian Drone Jockeys Hunt Front-Line Shop Clerks and Repairmen in Ukraine - The Wall Street Journal",
            "description": null,
            "url": "https://www.wsj.com/world/russian-drone-jockeys-hunt-front-line-shop-clerks-and-repairmen-in-ukraine-6557cdf1",
            "urlToImage": null,
            "publishedAt": "2024-11-06T04:00:00Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "CNN",
                "article_id": 14
            },
            "author": "Mary Gilbert, Hannah Park, Robert Shackelford",
            "title": "Rafael strengthens into a hurricane in the Caribbean. The storm and its path could change drastically as it heads toward US - CNN",
            "description": "Rafael lashed the Cayman Islands in the western Caribbean with strong winds and heavy rain Tuesday night, and the Category 1 hurricane is expected to keep strengthening before it makes landfall in Cuba on Wednesday.",
            "url": "https://www.cnn.com/2024/11/05/us/tropical-storm-rafael-forecast-hurricane-hnk/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/cnn-digital-tracker-hurricane-satellite-visible-homepage-rafael-330p-110524.png?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-11-06T03:34:00Z",
            "content": "\n    Editor’s Note: Read our new story for the latest updates on Hurricane Rafael.\n \n            Rafael continues to strengthen and is now a Category 2 hurricane closing in on Cuba after lashing the Cayman Islands in the western Caribbean with strong winds and heavy rain Tuesday night.\n     \n            Rafael is the 11th hurricane of the 2024 Atlantic hurricane season.\n     \n            Forecasters are warning there’s more uncertainty than usual about where the storm could go once it’s in the Gulf of Mexico midweek. It’s possible Rafael could impact the Gulf Coast this weekend or miss it entirely and drive into northeastern Mexico, so residents in these areas will need to monitor updates closely.\n     \n            Forecasts should become clearer over the next 48 hours.\n     \n            Three things are clear now: The storm will be weakening on approach in the Gulf and is not expected to be as severe as hurricanes Helene and Milton; tropical storm conditions could begin in the lower and middle Florida Keys by Wednesday; and the Caribbean will face the worst of the storm.\n     \n            Hurricane and tropical storm alerts were in place for most of Cuba and the Cayman Islands as Rafael began to pass through the Caymans on Tuesday night. The hurricane center said people on the Caymans should expect dangerous storm surge and destructive waves.\n     \n            The storm will continue to “rapidly intensify” and is forecast to be a strong Category 2 hurricane as it nears landfall in western Cuba on Wednesday, according to the National Hurricane Center.\n     \n            Rafael’s potent winds will also create rough seas and significant storm surge, with expected inundation of up to 3 feet in the Cayman Islands and as much as 9 feet in western Cuba above normal tide levels.\n     \n            Rafael could bring widespread rainfall of 3 to 6 inches from Jamaica to western Cuba, with double-digit totals possible for areas stuck under multiple rounds of torrential, tropical rain. This deluge raises the risk of flash flooding and mudslides, especially in Jamaica’s mountainous regions.\n     \n            The US State Department advised Americans in Cuba who wanted to leave to “depart now, ahead of Tropical Storm Rafael’s arrival.” It also suggested US citizens scheduled to travel there reconsider their plans. Americans are barred from traveling to Cuba for pure tourism but are permitted to go for family visits and educational activities.\n     \n            The State Department also authorized its non-emergency employees and family members to voluntarily leave the island ahead of the storm.\n     \n            Rafael could become the sixth named storm to slam into the US this season, but whether this occurs and where will depend on how a variety of complex atmospheric steering factors come together.\n     \n            Two different forecast models show two opposing potential tracks for the storm that are contributing to the overall uncertainty for the US.\n     \n            “It is too soon to determine what, if any, impacts Rafael could bring to portions of the northern Gulf Coast,” the hurricane center noted Tuesday.\n     \n            One model expects Rafael to move north after hitting Cuba, keeping the storm on a path toward more of the eastern Gulf Coast by the weekend. The other shows the storm making a harder westward turn in the Gulf, which could weaken the storm or result in landfall in northeastern Mexico.\n     \n            Either way, there are still several days before the storm could approach the Gulf Coast.\n     \n            Despite the uncertainty, it’s likely the same deep, tropical moisture the storm is feeding from will fuel torrential rainfall for Florida and the Southeast starting Wednesday. A level 1 of 4 risk of flooding rainfall is in place for much of the region Wednesday with parts of Georgia and South Carolina under a level 2 of 4 risk.\n     \n            Bursts of rain could cause dangerous flash flooding, but some areas could be slow to flood given how dry a lot of the soils are after a record-breaking October.\n     \n            Shifts in the storm’s trajectory will influence what other parts of the Gulf Coast record tropical rainfall later in the week and over the weekend.\n     \nCNN’s Jennifer Hansler and Steve Almasy contributed to this report.\n © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
        },
        {
            "source": {
                "name": "Polygon",
                "article_id": 15
            },
            "author": "Oli Welsh, Zoë Hannah",
            "title": "Nintendo Switch 2 is backward-compatible with Switch games - Polygon",
            "description": "Nintendo has announced that Switch software and Nintendo Switch Online will be available on the successor to the Switch.",
            "url": "https://www.polygon.com/nintendo/449313/switch-2-backward-compatible-games-accessories",
            "urlToImage": "https://platform.polygon.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25290169/mario_switch_.jpg?quality=90&strip=all&crop=0%2C3.4613147178592%2C100%2C93.077370564282&w=1200",
            "publishedAt": "2024-11-06T02:04:00Z",
            "content": "President of Nintendo confirmed backward compatibility in a tweet Tuesday by  Oli Welsh and  Zoë Hannah Nintendo announced Tuesday that Nintendo Switch software “will also be playable on the successor to Nintendo Switch,” according to a post from Nintendo’s corporate X account. The post, attributed to Shuntaro Furukawa, president of Nintendo, also confirmed that Nintendo Switch Online will be offered on the new console. No mention was made of compatibility with Joy-Con controllers or other Switch hardware accessories, although this has previously been reported. The post said Nintendo announced the Switch 2’s backward compatibility at its Corporate Management Policy Briefing, a semiannual investor meeting where the company reports its sales and roadmaps. The presentation, which is publicly available, also addresses whether players’ Nintendo Accounts will function on the new console: “We believe that it is important for Nintendo’s future to make use of Nintendo Account and carry over the good relationship that we have built with the over 100 million annual playing users on Nintendo Switch to its successor.” The report further clarifies that, “in addition to being able to play Nintendo Switch software they currently own, consumers will be able to choose their next purchase from a broad selection of titles released for Nintendo Switch.” According to an earlier leak, the Switch 2 reportedly has a card slot. However, the message doesn’t confirm the new Switch will be able to play physical Switch games. The message from Nintendo says, “Further information about the successor to Nintendo Switch, including its compatibility with Nintendo Switch, will be announced at a later date.” Backward compatibility was considered a make-or-break feature for the Switch 2. Although strongly rumored, there remained doubts that Nintendo would be able to pull it off if the new machine’s chip architecture was very different, or if third-party publishers objected. The Switch itself was not backward compatible with any previous Nintendo consoles, and Nintendo made a mint from Switch rereleases of earlier games, such as selling 63 million copies of Mario Kart 8 Deluxe. But consumer expectations around backward compatibility have changed since Steam normalized the idea of a persistent digital library of games that works across multiple devices. In particular, PlayStation 5 and Xbox Series X are both fully backward compatible with their predecessors — something that could not be claimed for PS4 and Xbox One. In this landscape, a console without backward compatibility would have been a tough sell for Nintendo, especially considering that it has sold over 140 million Switches. Other notable revelations in Tuesday’s presentation include the report that the Pikmin, Kirby, Metroid, and Xenoblade Chronicles franchises have seen “dramatic sales growth on Nintendo Switch” compared to sales for those series’ titles on the Wii U and Nintendo 3DS. Correction (Nov. 6): A previous version of this story indicated that Nintendo had announced backward-compatibility with Switch hardware as well as software. Although previously reported, hardware compatibility has not been confirmed by Nintendo. The best of Polygon in your inbox, every Friday. © 2024 Vox Media, LLC. All Rights Reserved"
        },
        {
            "source": {
                "name": "Axios",
                "article_id": 16
            },
            "author": "Sareen Habeshian, Ivana Saric",
            "title": "Charted: How abortion fares on state ballots - Axios",
            "description": "Here's a look at where the ballot measures stand.",
            "url": "https://www.axios.com/2024/11/05/abortion-election-2024-results-state-amendments",
            "urlToImage": "https://images.axios.com/7OimgC4M548S030BsKHNyW2cqrk=/0x0:1920x1080/1366x768/2024/10/29/1730224893155.jpg",
            "publishedAt": "2024-11-06T02:03:45Z",
            "content": "Content could not be fetched."
        },
        {
            "source": {
                "name": "CBS Sports",
                "article_id": 17
            },
            "author": "",
            "title": "College Football Playoff Rankings: Oregon opens at No. 1 as Ohio State, Georgia, Miami, Texas lead top 25 - CBS Sports",
            "description": "The first top 25 rankings of the 2024 season have arrived from the CFP Selection Committee",
            "url": "https://www.cbssports.com/college-football/news/college-football-playoff-rankings-oregon-opens-at-no-1-as-ohio-state-georgia-miami-texas-lead-top-25/",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2024/11/06/7303b53e-8dfb-43f6-9b42-10a58217de99/thumbnail/1200x675/ca9baebe183e3a43f8c2ed273107f73c/graphic-cfpr24-w1.png",
            "publishedAt": "2024-11-06T01:51:00Z",
            "content": "If not listed, please contact your TV provider. The first edition of the College Football Playoff Rankings was released Tuesday night with undefeated Oregon opening at No. 1 in the initial year of the expanded 12-team field. Off to a dominant start this season with wins over Ohio State, Michigan and Illinois, the Ducks sit in the top spot seeking to make their second playoff appearance -- first since the four-team field debuted after the 2014 season. Seven of 10 teams ranked No. 1 in a season's initial CFP Rankings ultimately reached the playoff in the four-team era with Mississippi State (2014), Tennessee (2022) and Ohio State (2023) being the exceptions. With eight more spots in the field this season, Oregon sits in a strong position at 9-0 more than midway through the campaign. Ohio State, Georgia, Miami (FL) and Texas round out the rest of the top five. The top Group of Five program in Tuesday's release is Boise State at No. 12. With the 12-team playoff model granting automatic bids to the five highest-ranked conference champions, the Broncos stand in pole position to earn that opportunity should they win their league. Army West Point is the only other Group of Five team in the initial CFP Rankings at No. 25. Let's take a look at the entire CFP Rankings top 25 along with the projected bracket seedings for the first 12 teams. Check out analysis by bowls expert Jerry Palm below. The first-round games in the projected CFP bracket are very enticing. Boise State would visit Ohio State; Alabama would travel to Texas in an SEC matchup that was not played during the regular season; Notre Dame would head to Penn State;  and Indiana would play at Tennessee in a battle of high-flying offenses. I don't believe there were any egregious rankings, even if they did not match my predictions. You saw the importance of head-to-head results, even at the bottom of the rankings where 6-3 Louisville was ahead of 6-2 Clemson after the Cardinals' victory at Clemson on Saturday. The only team in the rankings rated lower than a team it beat is Alabama, which is eight spots behind Georgia. You also saw the importance of strength of schedule, which is holding back teams like Indiana, Washington State and Army. The SEC has the most teams in the rankings with eight, which is all of the conference teams that have no more than two losses overall. In fact, the only team in the rankings with more than two losses is Louisville. Sixteen of the teams in this week's rankings still have a chance to get to at least a tiebreaker to play for their respective conference titles. Given how many teams are still in play with two or fewer losses, it seems very unlikely that we will have a three-loss team in the CFP unless it's a loss in a conference championship game. That makes Alabama at LSU this week most likely a playoff elimination game. © 2004-2024 CBS Interactive. All Rights Reserved. CBS Sports is a registered trademark of CBS Broadcasting Inc. Commissioner.com is a registered trademark of CBS Interactive Inc. The content on this site is for entertainment purposes only and CBS Sports makes no representation or warranty as to the accuracy of the information given or the outcome of any game or event. There is no gambling offered on this site. This site contains commercial content and CBS Sports may be compensated for the links provided on this site. Images by Getty Images and Imagn"
        },
        {
            "source": {
                "name": "wgbh.org",
                "article_id": 18
            },
            "author": "GBH News",
            "title": "Live results from the 2024 election in Massachusetts - GBH News",
            "description": "See the latest vote counts from Massachusetts for U.S. Senate, U.S. House, ballot questions and more.",
            "url": "https://www.wgbh.org/news/politics/2024-11-05/live-results-from-the-2024-election-in-massachusetts",
            "urlToImage": "https://cdn.grove.wgbh.org/dims4/default/5bec97e/2147483647/strip/true/crop/4634x2433+0+328/resize/1200x630!/quality/70/?url=https%3A%2F%2Fk1-prod-gbh.s3.us-east-2.amazonaws.com%2Fbrightspot%2Ff8%2F34%2F7513bedc4b04b84ad05793b45818%2Fvoters-head-to-polls-boston.png",
            "publishedAt": "2024-11-06T01:43:38Z",
            "content": "Polls closed at 8 p.m. in Massachusetts. The latest results will be here as votes are counted.  You can also follow along with \n        updates from GBH News reporters in the field. Jump to: \n        Massachusetts ballot questions, \n        Massachusetts Senate, \n        Massachusetts House, \n        governor’s council, \n        county commissioner       Sign up for the latest from GBH News delivered to your inbox three times a week."
        },
        {
            "source": {
                "name": "ForexLive",
                "article_id": 19
            },
            "author": "Adam Button",
            "title": "Trump trades continue to rally as his odds improve - ForexLive",
            "description": "All the Trump trades have climbed as election results from Georgia and Florida come in. . Trump is running decidedly better in Florida and it's safe to say he has won the state.",
            "url": "https://www.forexlive.com/news/trump-trades-continue-to-rally-as-his-odds-improve-20241106/",
            "urlToImage": "https://images.forexlive.com/images/georgia_id_9dd4f9a7-ecae-458c-a097-70761995d1c3_size975.jpg",
            "publishedAt": "2024-11-06T00:41:00Z",
            "content": "\n      Subscribe to our Daily Wrap\n     Premium \n          Join Forexlive News Updates\n         \n          Join Forexlive FX & Crypto Chat\n         \n          Follow us on Twitter\n         \n          Follow Us on Facebook\n         All the Trump trades have climbed as election results from Georgia and Florida come in. Trump is running decidedly better in Florida and it's safe to say he has won the state. The stronger vote there bodes well for him but him winning that state isn't really a surprise. Perhaps what the market is reacting to is the Republican early lead in Georgia. I wonder if the market is reacting to this lead or digging deeper? When I dig deeper, Trump is running 3-4 points better in rural counties in Georgia but he's running behind his pace in the Atlanta suburbs that have reported.  Tags Most Popular \n      Select additional content:\n     Stock Daily Updates Top Forex Brokers Must Read Follow Us \n    Read our Terms,\n    Cookies and\n    Privacy Notice \n      High risk warning:\n     \n      Foreign exchange trading carries a high level of risk that may not be suitable for all investors. Leverage creates additional risk and loss exposure. Before you decide to trade foreign exchange, carefully consider your investment objectives, experience level, and risk tolerance. You could lose some or all your initial investment; do not invest money that you cannot afford to lose. Educate yourself on the risks associated with foreign exchange trading and seek advice from an independent financial or tax advisor if you have any questions.\n     \n      Advisory warning:\n     \n      FOREXLIVE™ is not an investment advisor, FOREXLIVE™ provides references and links to selected news, blogs and other sources of economic and market information for informational purposes and as an educational service to its clients and prospects and does not endorse the opinions or recommendations of the blogs or other sources of information. Clients and prospects are advised to carefully consider the opinions and analysis offered in the blogs or other information sources in the context of the client or prospect's individual analysis and decision making. None of the blogs or other sources of information is to be considered as constituting a track record. Past performance is no guarantee of future results and FOREXLIVE™ specifically hereby acknowledges clients and prospects to carefully review all claims and representations made by advisors, bloggers, money managers and system vendors before investing any funds or opening an account with any Forex dealer. Any news, opinions, research, data, or other information contained within this website is provided on an \"as-is\" basis as a general market commentary and does not constitute investment or trading advice, and we do not purport to present the entire relevant or available public information with respect to a specific market or security. FOREXLIVE™ expressly disclaims any liability for any lost principal or profits which may arise directly or indirectly from the use of or reliance on such information, or with respect to any of the content presented within its website, nor its editorial choices.\n     \n      Disclaimer:\n     \n      FOREXLIVE™ may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers.\n     \n      Finance Magnates CY Limited\n    "
        }
    ]
}